sethbrad/CprE288-Lab9/REF_tm4c123gh6pm.h
//*****************************************************************************
//
// PWM registers (PWM1)
//
//*****************************************************************************
#define PWM1_CTL_R (*((volatile unsigned long *)0x40029000))
#define PWM1_SYNC_R (*((volatile unsigned long *)0x40029004))
#define PWM1_ENABLE_R (*((volatile unsigned long *)0x40029008))
#define PWM1_INVERT_R (*((volatile unsigned long *)0x4002900C))
#define PWM1_FAULT_R (*((volatile unsigned long *)0x40029010))
#define PWM1_INTEN_R (*((volatile unsigned long *)0x40029014))
#define PWM1_RIS_R (*((volatile unsigned long *)0x40029018))
#define PWM1_ISC_R (*((volatile unsigned long *)0x4002901C))
#define PWM1_STATUS_R (*((volatile unsigned long *)0x40029020))
#define PWM1_FAULTVAL_R (*((volatile unsigned long *)0x40029024))
#define PWM1_ENUPD_R (*((volatile unsigned long *)0x40029028))
#define PWM1_0_CTL_R (*((volatile unsigned long *)0x40029040))
#define PWM1_0_INTEN_R (*((volatile unsigned long *)0x40029044))
#define PWM1_0_RIS_R (*((volatile unsigned long *)0x40029048))
#define PWM1_0_ISC_R (*((volatile unsigned long *)0x4002904C))
#define PWM1_0_LOAD_R (*((volatile unsigned long *)0x40029050))
#define PWM1_0_COUNT_R (*((volatile unsigned long *)0x40029054))
#define PWM1_0_CMPA_R (*((volatile unsigned long *)0x40029058))
#define PWM1_0_CMPB_R (*((volatile unsigned long *)0x4002905C))
#define PWM1_0_GENA_R (*((volatile unsigned long *)0x40029060))
#define PWM1_0_GENB_R (*((volatile unsigned long *)0x40029064))
#define PWM1_0_DBCTL_R (*((volatile unsigned long *)0x40029068))
#define PWM1_0_DBRISE_R (*((volatile unsigned long *)0x4002906C))
#define PWM1_0_DBFALL_R (*((volatile unsigned long *)0x40029070))
#define PWM1_0_FLTSRC0_R (*((volatile unsigned long *)0x40029074))
#define PWM1_0_FLTSRC1_R (*((volatile unsigned long *)0x40029078))
#define PWM1_0_MINFLTPER_R (*((volatile unsigned long *)0x4002907C))
#define PWM1_1_CTL_R (*((volatile unsigned long *)0x40029080))
#define PWM1_1_INTEN_R (*((volatile unsigned long *)0x40029084))
#define PWM1_1_RIS_R (*((volatile unsigned long *)0x40029088))
#define PWM1_1_ISC_R (*((volatile unsigned long *)0x4002908C))
#define PWM1_1_LOAD_R (*((volatile unsigned long *)0x40029090))
#define PWM1_1_COUNT_R (*((volatile unsigned long *)0x40029094))
#define PWM1_1_CMPA_R (*((volatile unsigned long *)0x40029098))
#define PWM1_1_CMPB_R (*((volatile unsigned long *)0x4002909C))
#define PWM1_1_GENA_R (*((volatile unsigned long *)0x400290A0))
#define PWM1_1_GENB_R (*((volatile unsigned long *)0x400290A4))
#define PWM1_1_DBCTL_R (*((volatile unsigned long *)0x400290A8))
#define PWM1_1_DBRISE_R (*((volatile unsigned long *)0x400290AC))
#define PWM1_1_DBFALL_R (*((volatile unsigned long *)0x400290B0))
#define PWM1_1_FLTSRC0_R (*((volatile unsigned long *)0x400290B4))
#define PWM1_1_FLTSRC1_R (*((volatile unsigned long *)0x400290B8))
#define PWM1_1_MINFLTPER_R (*((volatile unsigned long *)0x400290BC))
#define PWM1_2_CTL_R (*((volatile unsigned long *)0x400290C0))
#define PWM1_2_INTEN_R (*((volatile unsigned long *)0x400290C4))
#define PWM1_2_RIS_R (*((volatile unsigned long *)0x400290C8))
#define PWM1_2_ISC_R (*((volatile unsigned long *)0x400290CC))
#define PWM1_2_LOAD_R (*((volatile unsigned long *)0x400290D0))
#define PWM1_2_COUNT_R (*((volatile unsigned long *)0x400290D4))
#define PWM1_2_CMPA_R (*((volatile unsigned long *)0x400290D8))
#define PWM1_2_CMPB_R (*((volatile unsigned long *)0x400290DC))
#define PWM1_2_GENA_R (*((volatile unsigned long *)0x400290E0))
#define PWM1_2_GENB_R (*((volatile unsigned long *)0x400290E4))
#define PWM1_2_DBCTL_R (*((volatile unsigned long *)0x400290E8))
#define PWM1_2_DBRISE_R (*((volatile unsigned long *)0x400290EC))
#define PWM1_2_DBFALL_R (*((volatile unsigned long *)0x400290F0))
#define PWM1_2_FLTSRC0_R (*((volatile unsigned long *)0x400290F4))
#define PWM1_2_FLTSRC1_R (*((volatile unsigned long *)0x400290F8))
#define PWM1_2_MINFLTPER_R (*((volatile unsigned long *)0x400290FC))
#define PWM1_3_CTL_R (*((volatile unsigned long *)0x40029100))
#define PWM1_3_INTEN_R (*((volatile unsigned long *)0x40029104))
#define PWM1_3_RIS_R (*((volatile unsigned long *)0x40029108))
#define PWM1_3_ISC_R (*((volatile unsigned long *)0x4002910C))
#define PWM1_3_LOAD_R (*((volatile unsigned long *)0x40029110))
#define PWM1_3_COUNT_R (*((volatile unsigned long *)0x40029114))
#define PWM1_3_CMPA_R (*((volatile unsigned long *)0x40029118))
#define PWM1_3_CMPB_R (*((volatile unsigned long *)0x4002911C))
#define PWM1_3_GENA_R (*((volatile unsigned long *)0x40029120))
#define PWM1_3_GENB_R (*((volatile unsigned long *)0x40029124))
#define PWM1_3_DBCTL_R (*((volatile unsigned long *)0x40029128))
#define PWM1_3_DBRISE_R (*((volatile unsigned long *)0x4002912C))
#define PWM1_3_DBFALL_R (*((volatile unsigned long *)0x40029130))
#define PWM1_3_FLTSRC0_R (*((volatile unsigned long *)0x40029134))
#define PWM1_3_FLTSRC1_R (*((volatile unsigned long *)0x40029138))
#define PWM1_3_MINFLTPER_R (*((volatile unsigned long *)0x4002913C))
#define PWM1_0_FLTSEN_R (*((volatile unsigned long *)0x40029800))
#define PWM1_0_FLTSTAT0_R (*((volatile unsigned long *)0x40029804))
#define PWM1_0_FLTSTAT1_R (*((volatile unsigned long *)0x40029808))
#define PWM1_1_FLTSEN_R (*((volatile unsigned long *)0x40029880))
#define PWM1_1_FLTSTAT0_R (*((volatile unsigned long *)0x40029884))
#define PWM1_1_FLTSTAT1_R (*((volatile unsigned long *)0x40029888))
#define PWM1_2_FLTSTAT0_R (*((volatile unsigned long *)0x40029904))
#define PWM1_2_FLTSTAT1_R (*((volatile unsigned long *)0x40029908))
#define PWM1_3_FLTSTAT0_R (*((volatile unsigned long *)0x40029984))
#define PWM1_3_FLTSTAT1_R (*((volatile unsigned long *)0x40029988))
#define PWM1_PP_R (*((volatile unsigned long *)0x40029FC0))

//*****************************************************************************
//
// QEI registers (QEI0)
//
//*****************************************************************************
#define QEI0_CTL_R (*((volatile unsigned long *)0x4002C000))
#define QEI0_STAT_R (*((volatile unsigned long *)0x4002C004))
#define QEI0_POS_R (*((volatile unsigned long *)0x4002C008))
#define QEI0_MAXPOS_R (*((volatile unsigned long *)0x4002C00C))
#define QEI0_LOAD_R (*((volatile unsigned long *)0x4002C010))
#define QEI0_TIME_R (*((volatile unsigned long *)0x4002C014))
#define QEI0_COUNT_R (*((volatile unsigned long *)0x4002C018))
#define QEI0_SPEED_R (*((volatile unsigned long *)0x4002C01C))
#define QEI0_INTEN_R (*((volatile unsigned long *)0x4002C020))
#define QEI0_RIS_R (*((volatile unsigned long *)0x4002C024))
#define QEI0_ISC_R (*((volatile unsigned long *)0x4002C028))

//*****************************************************************************
//
// QEI registers (QEI1)
//
//*****************************************************************************
#define QEI1_CTL_R (*((volatile unsigned long *)0x4002D000))
#define QEI1_STAT_R (*((volatile unsigned long *)0x4002D004))
#define QEI1_POS_R (*((volatile unsigned long *)0x4002D008))
#define QEI1_MAXPOS_R (*((volatile unsigned long *)0x4002D00C))
#define QEI1_LOAD_R (*((volatile unsigned long *)0x4002D010))
#define QEI1_TIME_R (*((volatile unsigned long *)0x4002D014))
#define QEI1_COUNT_R (*((volatile unsigned long *)0x4002D018))
#define QEI1_SPEED_R (*((volatile unsigned long *)0x4002D01C))
#define QEI1_INTEN_R (*((volatile unsigned long *)0x4002D020))
#define QEI1_RIS_R (*((volatile unsigned long *)0x4002D024))
#define QEI1_ISC_R (*((volatile unsigned long *)0x4002D028))

//*****************************************************************************
//
// Timer registers (TIMER0)
//
//*****************************************************************************
#define TIMER0_CFG_R (*((volatile unsigned long *)0x40030000))
#define TIMER0_TAMR_R (*((volatile unsigned long *)0x40030004))
#define TIMER0_TBMR_R (*((volatile unsigned long *)0x40030008))
#define TIMER0_CTL_R (*((volatile unsigned long *)0x4003000C))
#define TIMER0_SYNC_R (*((volatile unsigned long *)0x40030010))
#define TIMER0_IMR_R (*((volatile unsigned long *)0x40030018))
#define TIMER0_RIS_R (*((volatile unsigned long *)0x4003001C))
#define TIMER0_MIS_R (*((volatile unsigned long *)0x40030020))
#define TIMER0_ICR_R (*((volatile unsigned long *)0x40030024))
#define TIMER0_TAILR_R (*((volatile unsigned long *)0x40030028))
#define TIMER0_TBILR_R (*((volatile unsigned long *)0x4003002C))
#define TIMER0_TAMATCHR_R (*((volatile unsigned long *)0x40030030))
#define TIMER0_TBMATCHR_R (*((volatile unsigned long *)0x40030034))
#define TIMER0_TAPR_R (*((volatile unsigned long *)0x40030038))
#define TIMER0_TBPR_R (*((volatile unsigned long *)0x4003003C))
#define TIMER0_TAPMR_R (*((volatile unsigned long *)0x40030040))
#define TIMER0_TBPMR_R (*((volatile unsigned long *)0x40030044))
#define TIMER0_TAR_R (*((volatile unsigned long *)0x40030048))
#define TIMER0_TBR_R (*((volatile unsigned long *)0x4003004C))
#define TIMER0_TAV_R (*((volatile unsigned long *)0x40030050))
#define TIMER0_TBV_R (*((volatile unsigned long *)0x40030054))
#define TIMER0_RTCPD_R (*((volatile unsigned long *)0x40030058))
#define TIMER0_TAPS_R (*((volatile unsigned long *)0x4003005C))
#define TIMER0_TBPS_R (*((volatile unsigned long *)0x40030060))
#define TIMER0_TAPV_R (*((volatile unsigned long *)0x40030064))
#define TIMER0_TBPV_R (*((volatile unsigned long *)0x40030068))
#define TIMER0_PP_R (*((volatile unsigned long *)0x40030FC0))

//*****************************************************************************
//
// Timer registers (TIMER1)
//
//*****************************************************************************
#define TIMER1_CFG_R (*((volatile unsigned long *)0x40031000))
#define TIMER1_TAMR_R (*((volatile unsigned long *)0x40031004))
#define TIMER1_TBMR_R (*((volatile unsigned long *)0x40031008))
#define TIMER1_CTL_R (*((volatile unsigned long *)0x4003100C))
#define TIMER1_SYNC_R (*((volatile unsigned long *)0x40031010))
#define TIMER1_IMR_R (*((volatile unsigned long *)0x40031018))
#define TIMER1_RIS_R (*((volatile unsigned long *)0x4003101C))
#define TIMER1_MIS_R (*((volatile unsigned long *)0x40031020))
#define TIMER1_ICR_R (*((volatile unsigned long *)0x40031024))
#define TIMER1_TAILR_R (*((volatile unsigned long *)0x40031028))
#define TIMER1_TBILR_R (*((volatile unsigned long *)0x4003102C))
#define TIMER1_TAMATCHR_R (*((volatile unsigned long *)0x40031030))
#define TIMER1_TBMATCHR_R (*((volatile unsigned long *)0x40031034))
#define TIMER1_TAPR_R (*((volatile unsigned long *)0x40031038))
#define TIMER1_TBPR_R (*((volatile unsigned long *)0x4003103C))
#define TIMER1_TAPMR_R (*((volatile unsigned long *)0x40031040))
#define TIMER1_TBPMR_R (*((volatile unsigned long *)0x40031044))
#define TIMER1_TAR_R (*((volatile unsigned long *)0x40031048))
#define TIMER1_TBR_R (*((volatile unsigned long *)0x4003104C))
#define TIMER1_TAV_R (*((volatile unsigned long *)0x40031050))
#define TIMER1_TBV_R (*((volatile unsigned long *)0x40031054))
#define TIMER1_RTCPD_R (*((volatile unsigned long *)0x40031058))
#define TIMER1_TAPS_R (*((volatile unsigned long *)0x4003105C))
#define TIMER1_TBPS_R (*((volatile unsigned long *)0x40031060))
#define TIMER1_TAPV_R (*((volatile unsigned long *)0x40031064))
#define TIMER1_TBPV_R (*((volatile unsigned long *)0x40031068))
#define TIMER1_PP_R (*((volatile unsigned long *)0x40031FC0))

//*****************************************************************************
//
// Timer registers (TIMER2)
//
//*****************************************************************************
#define TIMER2_CFG_R (*((volatile unsigned long *)0x40032000))
#define TIMER2_TAMR_R (*((volatile unsigned long *)0x40032004))
#define TIMER2_TBMR_R (*((volatile unsigned long *)0x40032008))
#define TIMER2_CTL_R (*((volatile unsigned long *)0x4003200C))
#define TIMER2_SYNC_R (*((volatile unsigned long *)0x40032010))
#define TIMER2_IMR_R (*((volatile unsigned long *)0x40032018))
#define TIMER2_RIS_R (*((volatile unsigned long *)0x4003201C))
#define TIMER2_MIS_R (*((volatile unsigned long *)0x40032020))
#define TIMER2_ICR_R (*((volatile unsigned long *)0x40032024))
#define TIMER2_TAILR_R (*((volatile unsigned long *)0x40032028))
#define TIMER2_TBILR_R (*((volatile unsigned long *)0x4003202C))
#define TIMER2_TAMATCHR_R (*((volatile unsigned long *)0x40032030))
#define TIMER2_TBMATCHR_R (*((volatile unsigned long *)0x40032034))
#define TIMER2_TAPR_R (*((volatile unsigned long *)0x40032038))
#define TIMER2_TBPR_R (*((volatile unsigned long *)0x4003203C))
#define TIMER2_TAPMR_R (*((volatile unsigned long *)0x40032040))
#define TIMER2_TBPMR_R (*((volatile unsigned long *)0x40032044))
#define TIMER2_TAR_R (*((volatile unsigned long *)0x40032048))
#define TIMER2_TBR_R (*((volatile unsigned long *)0x4003204C))
#define TIMER2_TAV_R (*((volatile unsigned long *)0x40032050))
#define TIMER2_TBV_R (*((volatile unsigned long *)0x40032054))
#define TIMER2_RTCPD_R (*((volatile unsigned long *)0x40032058))
#define TIMER2_TAPS_R (*((volatile unsigned long *)0x4003205C))
#define TIMER2_TBPS_R (*((volatile unsigned long *)0x40032060))
#define TIMER2_TAPV_R (*((volatile unsigned long *)0x40032064))
#define TIMER2_TBPV_R (*((volatile unsigned long *)0x40032068))
#define TIMER2_PP_R (*((volatile unsigned long *)0x40032FC0))

//*****************************************************************************
//
// Timer registers (TIMER3)
//
//*****************************************************************************
#define TIMER3_CFG_R (*((volatile unsigned long *)0x40033000))
#define TIMER3_TAMR_R (*((volatile unsigned long *)0x40033004))
#define TIMER3_TBMR_R (*((volatile unsigned long *)0x40033008))
#define TIMER3_CTL_R (*((volatile unsigned long *)0x4003300C))
#define TIMER3_SYNC_R (*((volatile unsigned long *)0x40033010))
#define TIMER3_IMR_R (*((volatile unsigned long *)0x40033018))
#define TIMER3_RIS_R (*((volatile unsigned long *)0x4003301C))
#define TIMER3_MIS_R (*((volatile unsigned long *)0x40033020))
#define TIMER3_ICR_R (*((volatile unsigned long *)0x40033024))
#define TIMER3_TAILR_R (*((volatile unsigned long *)0x40033028))
#define TIMER3_TBILR_R (*((volatile unsigned long *)0x4003302C))
#define TIMER3_TAMATCHR_R (*((volatile unsigned long *)0x40033030))
#define TIMER3_TBMATCHR_R (*((volatile unsigned long *)0x40033034))
#define TIMER3_TAPR_R (*((volatile unsigned long *)0x40033038))
#define TIMER3_TBPR_R (*((volatile unsigned long *)0x4003303C))
#define TIMER3_TAPMR_R (*((volatile unsigned long *)0x40033040))
#define TIMER3_TBPMR_R (*((volatile unsigned long *)0x40033044))
#define TIMER3_TAR_R (*((volatile unsigned long *)0x40033048))
#define TIMER3_TBR_R (*((volatile unsigned long *)0x4003304C))
#define TIMER3_TAV_R (*((volatile unsigned long *)0x40033050))
#define TIMER3_TBV_R (*((volatile unsigned long *)0x40033054))
#define TIMER3_RTCPD_R (*((volatile unsigned long *)0x40033058))
#define TIMER3_TAPS_R (*((volatile unsigned long *)0x4003305C))
#define TIMER3_TBPS_R (*((volatile unsigned long *)0x40033060))
#define TIMER3_TAPV_R (*((volatile unsigned long *)0x40033064))
#define TIMER3_TBPV_R (*((volatile unsigned long *)0x40033068))
#define TIMER3_PP_R (*((volatile unsigned long *)0x40033FC0))

//*****************************************************************************
//
// Timer registers (TIMER4)
//
//*****************************************************************************
#define TIMER4_CFG_R (*((volatile unsigned long *)0x40034000))
#define TIMER4_TAMR_R (*((volatile unsigned long *)0x40034004))
#define TIMER4_TBMR_R (*((volatile unsigned long *)0x40034008))
#define TIMER4_CTL_R (*((volatile unsigned long *)0x4003400C))
#define TIMER4_SYNC_R (*((volatile unsigned long *)0x40034010))
#define TIMER4_IMR_R (*((volatile unsigned long *)0x40034018))
#define TIMER4_RIS_R (*((volatile unsigned long *)0x4003401C))
#define TIMER4_MIS_R (*((volatile unsigned long *)0x40034020))
#define TIMER4_ICR_R (*((volatile unsigned long *)0x40034024))
#define TIMER4_TAILR_R (*((volatile unsigned long *)0x40034028))
#define TIMER4_TBILR_R (*((volatile unsigned long *)0x4003402C))
#define TIMER4_TAMATCHR_R (*((volatile unsigned long *)0x40034030))
#define TIMER4_TBMATCHR_R (*((volatile unsigned long *)0x40034034))
#define TIMER4_TAPR_R (*((volatile unsigned long *)0x40034038))
#define TIMER4_TBPR_R (*((volatile unsigned long *)0x4003403C))
#define TIMER4_TAPMR_R (*((volatile unsigned long *)0x40034040))
#define TIMER4_TBPMR_R (*((volatile unsigned long *)0x40034044))
#define TIMER4_TAR_R (*((volatile unsigned long *)0x40034048))
#define TIMER4_TBR_R (*((volatile unsigned long *)0x4003404C))
#define TIMER4_TAV_R (*((volatile unsigned long *)0x40034050))
#define TIMER4_TBV_R (*((volatile unsigned long *)0x40034054))
#define TIMER4_RTCPD_R (*((volatile unsigned long *)0x40034058))
#define TIMER4_TAPS_R (*((volatile unsigned long *)0x4003405C))
#define TIMER4_TBPS_R (*((volatile unsigned long *)0x40034060))
#define TIMER4_TAPV_R (*((volatile unsigned long *)0x40034064))
#define TIMER4_TBPV_R (*((volatile unsigned long *)0x40034068))
#define TIMER4_PP_R (*((volatile unsigned long *)0x40034FC0))

//*****************************************************************************
//
// Timer registers (TIMER5)
//
//*****************************************************************************
#define TIMER5_CFG_R (*((volatile unsigned long *)0x40035000))
#define TIMER5_TAMR_R (*((volatile unsigned long *)0x40035004))
#define TIMER5_TBMR_R (*((volatile unsigned long *)0x40035008))
#define TIMER5_CTL_R (*((volatile unsigned long *)0x4003500C))
#define TIMER5_SYNC_R (*((volatile unsigned long *)0x40035010))
#define TIMER5_IMR_R (*((volatile unsigned long *)0x40035018))
#define TIMER5_RIS_R (*((volatile unsigned long *)0x4003501C))
#define TIMER5_MIS_R (*((volatile unsigned long *)0x40035020))
#define TIMER5_ICR_R (*((volatile unsigned long *)0x40035024))
#define TIMER5_TAILR_R (*((volatile unsigned long *)0x40035028))
#define TIMER5_TBILR_R (*((volatile unsigned long *)0x4003502C))
#define TIMER5_TAMATCHR_R (*((volatile unsigned long *)0x40035030))
#define TIMER5_TBMATCHR_R (*((volatile unsigned long *)0x40035034))
#define TIMER5_TAPR_R (*((volatile unsigned long *)0x40035038))
#define TIMER5_TBPR_R (*((volatile unsigned long *)0x4003503C))
#define TIMER5_TAPMR_R (*((volatile unsigned long *)0x40035040))
#define TIMER5_TBPMR_R (*((volatile unsigned long *)0x40035044))
#define TIMER5_TAR_R (*((volatile unsigned long *)0x40035048))
#define TIMER5_TBR_R (*((volatile unsigned long *)0x4003504C))
#define TIMER5_TAV_R (*((volatile unsigned long *)0x40035050))
#define TIMER5_TBV_R (*((volatile unsigned long *)0x40035054))
#define TIMER5_RTCPD_R (*((volatile unsigned long *)0x40035058))
#define TIMER5_TAPS_R (*((volatile unsigned long *)0x4003505C))
#define TIMER5_TBPS_R (*((volatile unsigned long *)0x40035060))
#define TIMER5_TAPV_R (*((volatile unsigned long *)0x40035064))
#define TIMER5_TBPV_R (*((volatile unsigned long *)0x40035068))
#define TIMER5_PP_R (*((volatile unsigned long *)0x40035FC0))

//*****************************************************************************
//
// Timer registers (WTIMER0)
//
//*****************************************************************************
#define WTIMER0_CFG_R (*((volatile unsigned long *)0x40036000))
#define WTIMER0_TAMR_R (*((volatile unsigned long *)0x40036004))
#define WTIMER0_TBMR_R (*((volatile unsigned long *)0x40036008))
#define WTIMER0_CTL_R (*((volatile unsigned long *)0x4003600C))
#define WTIMER0_SYNC_R (*((volatile unsigned long *)0x40036010))
#define WTIMER0_IMR_R (*((volatile unsigned long *)0x40036018))
#define WTIMER0_RIS_R (*((volatile unsigned long *)0x4003601C))
#define WTIMER0_MIS_R (*((volatile unsigned long *)0x40036020))
#define WTIMER0_ICR_R (*((volatile unsigned long *)0x40036024))
#define WTIMER0_TAILR_R (*((volatile unsigned long *)0x40036028))
#define WTIMER0_TBILR_R (*((volatile unsigned long *)0x4003602C))
#define WTIMER0_TAMATCHR_R (*((volatile unsigned long *)0x40036030))
#define WTIMER0_TBMATCHR_R (*((volatile unsigned long *)0x40036034))
#define WTIMER0_TAPR_R (*((volatile unsigned long *)0x40036038))
#define WTIMER0_TBPR_R (*((volatile unsigned long *)0x4003603C))
#define WTIMER0_TAPMR_R (*((volatile unsigned long *)0x40036040))
#define WTIMER0_TBPMR_R (*((volatile unsigned long *)0x40036044))
#define WTIMER0_TAR_R (*((volatile unsigned long *)0x40036048))
#define WTIMER0_TBR_R (*((volatile unsigned long *)0x4003604C))
#define WTIMER0_TAV_R (*((volatile unsigned long *)0x40036050))
#define WTIMER0_TBV_R (*((volatile unsigned long *)0x40036054))
#define WTIMER0_RTCPD_R (*((volatile unsigned long *)0x40036058))
#define WTIMER0_TAPS_R (*((volatile unsigned long *)0x4003605C))
#define WTIMER0_TBPS_R (*((volatile unsigned long *)0x40036060))
#define WTIMER0_TAPV_R (*((volatile unsigned long *)0x40036064))
#define WTIMER0_TBPV_R (*((volatile unsigned long *)0x40036068))
#define WTIMER0_PP_R (*((volatile unsigned long *)0x40036FC0))

//*****************************************************************************
//
// Timer registers (WTIMER1)
//
//*****************************************************************************
#define WTIMER1_CFG_R (*((volatile unsigned long *)0x40037000))
#define WTIMER1_TAMR_R (*((volatile unsigned long *)0x40037004))
#define WTIMER1_TBMR_R (*((volatile unsigned long *)0x40037008))
#define WTIMER1_CTL_R (*((volatile unsigned long *)0x4003700C))
#define WTIMER1_SYNC_R (*((volatile unsigned long *)0x40037010))
#define WTIMER1_IMR_R (*((volatile unsigned long *)0x40037018))
#define WTIMER1_RIS_R (*((volatile unsigned long *)0x4003701C))
#define WTIMER1_MIS_R (*((volatile unsigned long *)0x40037020))
#define WTIMER1_ICR_R (*((volatile unsigned long *)0x40037024))
#define WTIMER1_TAILR_R (*((volatile unsigned long *)0x40037028))
#define WTIMER1_TBILR_R (*((volatile unsigned long *)0x4003702C))
#define WTIMER1_TAMATCHR_R (*((volatile unsigned long *)0x40037030))
#define WTIMER1_TBMATCHR_R (*((volatile unsigned long *)0x40037034))
#define WTIMER1_TAPR_R (*((volatile unsigned long *)0x40037038))
#define WTIMER1_TBPR_R (*((volatile unsigned long *)0x4003703C))
#define WTIMER1_TAPMR_R (*((volatile unsigned long *)0x40037040))
#define WTIMER1_TBPMR_R (*((volatile unsigned long *)0x40037044))
#define WTIMER1_TAR_R (*((volatile unsigned long *)0x40037048))
#define WTIMER1_TBR_R (*((volatile unsigned long *)0x4003704C))
#define WTIMER1_TAV_R (*((volatile unsigned long *)0x40037050))
#define WTIMER1_TBV_R (*((volatile unsigned long *)0x40037054))
#define WTIMER1_RTCPD_R (*((volatile unsigned long *)0x40037058))
#define WTIMER1_TAPS_R (*((volatile unsigned long *)0x4003705C))
#define WTIMER1_TBPS_R (*((volatile unsigned long *)0x40037060))
#define WTIMER1_TAPV_R (*((volatile unsigned long *)0x40037064))
#define WTIMER1_TBPV_R (*((volatile unsigned long *)0x40037068))
#define WTIMER1_PP_R (*((volatile unsigned long *)0x40037FC0))

