sethbrad/CprE288-Lab9/REF_tm4c123gh6pm.h
//*****************************************************************************
//
// ADC registers (ADC0)
//
//*****************************************************************************
#define ADC0_ACTSS_R (*((volatile unsigned long *)0x40038000))
#define ADC0_RIS_R (*((volatile unsigned long *)0x40038004))
#define ADC0_IM_R (*((volatile unsigned long *)0x40038008))
#define ADC0_ISC_R (*((volatile unsigned long *)0x4003800C))
#define ADC0_OSTAT_R (*((volatile unsigned long *)0x40038010))
#define ADC0_EMUX_R (*((volatile unsigned long *)0x40038014))
#define ADC0_USTAT_R (*((volatile unsigned long *)0x40038018))
#define ADC0_TSSEL_R (*((volatile unsigned long *)0x4003801C))
#define ADC0_SSPRI_R (*((volatile unsigned long *)0x40038020))
#define ADC0_SPC_R (*((volatile unsigned long *)0x40038024))
#define ADC0_PSSI_R (*((volatile unsigned long *)0x40038028))
#define ADC0_SAC_R (*((volatile unsigned long *)0x40038030))
#define ADC0_DCISC_R (*((volatile unsigned long *)0x40038034))
#define ADC0_CTL_R (*((volatile unsigned long *)0x40038038))
#define ADC0_SSMUX0_R (*((volatile unsigned long *)0x40038040))
#define ADC0_SSCTL0_R (*((volatile unsigned long *)0x40038044))
#define ADC0_SSFIFO0_R (*((volatile unsigned long *)0x40038048))
#define ADC0_SSFSTAT0_R (*((volatile unsigned long *)0x4003804C))
#define ADC0_SSOP0_R (*((volatile unsigned long *)0x40038050))
#define ADC0_SSDC0_R (*((volatile unsigned long *)0x40038054))
#define ADC0_SSMUX1_R (*((volatile unsigned long *)0x40038060))
#define ADC0_SSCTL1_R (*((volatile unsigned long *)0x40038064))
#define ADC0_SSFIFO1_R (*((volatile unsigned long *)0x40038068))
#define ADC0_SSFSTAT1_R (*((volatile unsigned long *)0x4003806C))
#define ADC0_SSOP1_R (*((volatile unsigned long *)0x40038070))
#define ADC0_SSDC1_R (*((volatile unsigned long *)0x40038074))
#define ADC0_SSMUX2_R (*((volatile unsigned long *)0x40038080))
#define ADC0_SSCTL2_R (*((volatile unsigned long *)0x40038084))
#define ADC0_SSFIFO2_R (*((volatile unsigned long *)0x40038088))
#define ADC0_SSFSTAT2_R (*((volatile unsigned long *)0x4003808C))
#define ADC0_SSOP2_R (*((volatile unsigned long *)0x40038090))
#define ADC0_SSDC2_R (*((volatile unsigned long *)0x40038094))
#define ADC0_SSMUX3_R (*((volatile unsigned long *)0x400380A0))
#define ADC0_SSCTL3_R (*((volatile unsigned long *)0x400380A4))
#define ADC0_SSFIFO3_R (*((volatile unsigned long *)0x400380A8))
#define ADC0_SSFSTAT3_R (*((volatile unsigned long *)0x400380AC))
#define ADC0_SSOP3_R (*((volatile unsigned long *)0x400380B0))
#define ADC0_SSDC3_R (*((volatile unsigned long *)0x400380B4))
#define ADC0_DCRIC_R (*((volatile unsigned long *)0x40038D00))
#define ADC0_DCCTL0_R (*((volatile unsigned long *)0x40038E00))
#define ADC0_DCCTL1_R (*((volatile unsigned long *)0x40038E04))
#define ADC0_DCCTL2_R (*((volatile unsigned long *)0x40038E08))
#define ADC0_DCCTL3_R (*((volatile unsigned long *)0x40038E0C))
#define ADC0_DCCTL4_R (*((volatile unsigned long *)0x40038E10))
#define ADC0_DCCTL5_R (*((volatile unsigned long *)0x40038E14))
#define ADC0_DCCTL6_R (*((volatile unsigned long *)0x40038E18))
#define ADC0_DCCTL7_R (*((volatile unsigned long *)0x40038E1C))
#define ADC0_DCCMP0_R (*((volatile unsigned long *)0x40038E40))
#define ADC0_DCCMP1_R (*((volatile unsigned long *)0x40038E44))
#define ADC0_DCCMP2_R (*((volatile unsigned long *)0x40038E48))
#define ADC0_DCCMP3_R (*((volatile unsigned long *)0x40038E4C))
#define ADC0_DCCMP4_R (*((volatile unsigned long *)0x40038E50))
#define ADC0_DCCMP5_R (*((volatile unsigned long *)0x40038E54))
#define ADC0_DCCMP6_R (*((volatile unsigned long *)0x40038E58))
#define ADC0_DCCMP7_R (*((volatile unsigned long *)0x40038E5C))
#define ADC0_PP_R (*((volatile unsigned long *)0x40038FC0))
#define ADC0_PC_R (*((volatile unsigned long *)0x40038FC4))
#define ADC0_CC_R (*((volatile unsigned long *)0x40038FC8))

//*****************************************************************************
//
// ADC registers (ADC1)
//
//*****************************************************************************
#define ADC1_ACTSS_R (*((volatile unsigned long *)0x40039000))
#define ADC1_RIS_R (*((volatile unsigned long *)0x40039004))
#define ADC1_IM_R (*((volatile unsigned long *)0x40039008))
#define ADC1_ISC_R (*((volatile unsigned long *)0x4003900C))
#define ADC1_OSTAT_R (*((volatile unsigned long *)0x40039010))
#define ADC1_EMUX_R (*((volatile unsigned long *)0x40039014))
#define ADC1_USTAT_R (*((volatile unsigned long *)0x40039018))
#define ADC1_TSSEL_R (*((volatile unsigned long *)0x4003901C))
#define ADC1_SSPRI_R (*((volatile unsigned long *)0x40039020))
#define ADC1_SPC_R (*((volatile unsigned long *)0x40039024))
#define ADC1_PSSI_R (*((volatile unsigned long *)0x40039028))
#define ADC1_SAC_R (*((volatile unsigned long *)0x40039030))
#define ADC1_DCISC_R (*((volatile unsigned long *)0x40039034))
#define ADC1_CTL_R (*((volatile unsigned long *)0x40039038))
#define ADC1_SSMUX0_R (*((volatile unsigned long *)0x40039040))
#define ADC1_SSCTL0_R (*((volatile unsigned long *)0x40039044))
#define ADC1_SSFIFO0_R (*((volatile unsigned long *)0x40039048))
#define ADC1_SSFSTAT0_R (*((volatile unsigned long *)0x4003904C))
#define ADC1_SSOP0_R (*((volatile unsigned long *)0x40039050))
#define ADC1_SSDC0_R (*((volatile unsigned long *)0x40039054))
#define ADC1_SSMUX1_R (*((volatile unsigned long *)0x40039060))
#define ADC1_SSCTL1_R (*((volatile unsigned long *)0x40039064))
#define ADC1_SSFIFO1_R (*((volatile unsigned long *)0x40039068))
#define ADC1_SSFSTAT1_R (*((volatile unsigned long *)0x4003906C))
#define ADC1_SSOP1_R (*((volatile unsigned long *)0x40039070))
#define ADC1_SSDC1_R (*((volatile unsigned long *)0x40039074))
#define ADC1_SSMUX2_R (*((volatile unsigned long *)0x40039080))
#define ADC1_SSCTL2_R (*((volatile unsigned long *)0x40039084))
#define ADC1_SSFIFO2_R (*((volatile unsigned long *)0x40039088))
#define ADC1_SSFSTAT2_R (*((volatile unsigned long *)0x4003908C))
#define ADC1_SSOP2_R (*((volatile unsigned long *)0x40039090))
#define ADC1_SSDC2_R (*((volatile unsigned long *)0x40039094))
#define ADC1_SSMUX3_R (*((volatile unsigned long *)0x400390A0))
#define ADC1_SSCTL3_R (*((volatile unsigned long *)0x400390A4))
#define ADC1_SSFIFO3_R (*((volatile unsigned long *)0x400390A8))
#define ADC1_SSFSTAT3_R (*((volatile unsigned long *)0x400390AC))
#define ADC1_SSOP3_R (*((volatile unsigned long *)0x400390B0))
#define ADC1_SSDC3_R (*((volatile unsigned long *)0x400390B4))
#define ADC1_DCRIC_R (*((volatile unsigned long *)0x40039D00))
#define ADC1_DCCTL0_R (*((volatile unsigned long *)0x40039E00))
#define ADC1_DCCTL1_R (*((volatile unsigned long *)0x40039E04))
#define ADC1_DCCTL2_R (*((volatile unsigned long *)0x40039E08))
#define ADC1_DCCTL3_R (*((volatile unsigned long *)0x40039E0C))
#define ADC1_DCCTL4_R (*((volatile unsigned long *)0x40039E10))
#define ADC1_DCCTL5_R (*((volatile unsigned long *)0x40039E14))
#define ADC1_DCCTL6_R (*((volatile unsigned long *)0x40039E18))
#define ADC1_DCCTL7_R (*((volatile unsigned long *)0x40039E1C))
#define ADC1_DCCMP0_R (*((volatile unsigned long *)0x40039E40))
#define ADC1_DCCMP1_R (*((volatile unsigned long *)0x40039E44))
#define ADC1_DCCMP2_R (*((volatile unsigned long *)0x40039E48))
#define ADC1_DCCMP3_R (*((volatile unsigned long *)0x40039E4C))
#define ADC1_DCCMP4_R (*((volatile unsigned long *)0x40039E50))
#define ADC1_DCCMP5_R (*((volatile unsigned long *)0x40039E54))
#define ADC1_DCCMP6_R (*((volatile unsigned long *)0x40039E58))
#define ADC1_DCCMP7_R (*((volatile unsigned long *)0x40039E5C))
#define ADC1_PP_R (*((volatile unsigned long *)0x40039FC0))
#define ADC1_PC_R (*((volatile unsigned long *)0x40039FC4))
#define ADC1_CC_R (*((volatile unsigned long *)0x40039FC8))

//*****************************************************************************
//
// Comparator registers (COMP)
//
//*****************************************************************************
#define COMP_ACMIS_R (*((volatile unsigned long *)0x4003C000))
#define COMP_ACRIS_R (*((volatile unsigned long *)0x4003C004))
#define COMP_ACINTEN_R (*((volatile unsigned long *)0x4003C008))
#define COMP_ACREFCTL_R (*((volatile unsigned long *)0x4003C010))
#define COMP_ACSTAT0_R (*((volatile unsigned long *)0x4003C020))
#define COMP_ACCTL0_R (*((volatile unsigned long *)0x4003C024))
#define COMP_ACSTAT1_R (*((volatile unsigned long *)0x4003C040))
#define COMP_ACCTL1_R (*((volatile unsigned long *)0x4003C044))
#define COMP_PP_R (*((volatile unsigned long *)0x4003CFC0))

//*****************************************************************************
//
// CAN registers (CAN0)
//
//*****************************************************************************
#define CAN0_CTL_R (*((volatile unsigned long *)0x40040000))
#define CAN0_STS_R (*((volatile unsigned long *)0x40040004))
#define CAN0_ERR_R (*((volatile unsigned long *)0x40040008))
#define CAN0_BIT_R (*((volatile unsigned long *)0x4004000C))
#define CAN0_INT_R (*((volatile unsigned long *)0x40040010))
#define CAN0_TST_R (*((volatile unsigned long *)0x40040014))
#define CAN0_BRPE_R (*((volatile unsigned long *)0x40040018))
#define CAN0_IF1CRQ_R (*((volatile unsigned long *)0x40040020))
#define CAN0_IF1CMSK_R (*((volatile unsigned long *)0x40040024))
#define CAN0_IF1MSK1_R (*((volatile unsigned long *)0x40040028))
#define CAN0_IF1MSK2_R (*((volatile unsigned long *)0x4004002C))
#define CAN0_IF1ARB1_R (*((volatile unsigned long *)0x40040030))
#define CAN0_IF1ARB2_R (*((volatile unsigned long *)0x40040034))
#define CAN0_IF1MCTL_R (*((volatile unsigned long *)0x40040038))
#define CAN0_IF1DA1_R (*((volatile unsigned long *)0x4004003C))
#define CAN0_IF1DA2_R (*((volatile unsigned long *)0x40040040))
#define CAN0_IF1DB1_R (*((volatile unsigned long *)0x40040044))
#define CAN0_IF1DB2_R (*((volatile unsigned long *)0x40040048))
#define CAN0_IF2CRQ_R (*((volatile unsigned long *)0x40040080))
#define CAN0_IF2CMSK_R (*((volatile unsigned long *)0x40040084))
#define CAN0_IF2MSK1_R (*((volatile unsigned long *)0x40040088))
#define CAN0_IF2MSK2_R (*((volatile unsigned long *)0x4004008C))
#define CAN0_IF2ARB1_R (*((volatile unsigned long *)0x40040090))
#define CAN0_IF2ARB2_R (*((volatile unsigned long *)0x40040094))
#define CAN0_IF2MCTL_R (*((volatile unsigned long *)0x40040098))
#define CAN0_IF2DA1_R (*((volatile unsigned long *)0x4004009C))
#define CAN0_IF2DA2_R (*((volatile unsigned long *)0x400400A0))
#define CAN0_IF2DB1_R (*((volatile unsigned long *)0x400400A4))
#define CAN0_IF2DB2_R (*((volatile unsigned long *)0x400400A8))
#define CAN0_TXRQ1_R (*((volatile unsigned long *)0x40040100))
#define CAN0_TXRQ2_R (*((volatile unsigned long *)0x40040104))
#define CAN0_NWDA1_R (*((volatile unsigned long *)0x40040120))
#define CAN0_NWDA2_R (*((volatile unsigned long *)0x40040124))
#define CAN0_MSG1INT_R (*((volatile unsigned long *)0x40040140))
#define CAN0_MSG2INT_R (*((volatile unsigned long *)0x40040144))
#define CAN0_MSG1VAL_R (*((volatile unsigned long *)0x40040160))
#define CAN0_MSG2VAL_R (*((volatile unsigned long *)0x40040164))

//*****************************************************************************
//
// CAN registers (CAN1)
//
//*****************************************************************************
#define CAN1_CTL_R (*((volatile unsigned long *)0x40041000))
#define CAN1_STS_R (*((volatile unsigned long *)0x40041004))
#define CAN1_ERR_R (*((volatile unsigned long *)0x40041008))
#define CAN1_BIT_R (*((volatile unsigned long *)0x4004100C))
#define CAN1_INT_R (*((volatile unsigned long *)0x40041010))
#define CAN1_TST_R (*((volatile unsigned long *)0x40041014))
#define CAN1_BRPE_R (*((volatile unsigned long *)0x40041018))
#define CAN1_IF1CRQ_R (*((volatile unsigned long *)0x40041020))
#define CAN1_IF1CMSK_R (*((volatile unsigned long *)0x40041024))
#define CAN1_IF1MSK1_R (*((volatile unsigned long *)0x40041028))
#define CAN1_IF1MSK2_R (*((volatile unsigned long *)0x4004102C))
#define CAN1_IF1ARB1_R (*((volatile unsigned long *)0x40041030))
#define CAN1_IF1ARB2_R (*((volatile unsigned long *)0x40041034))
#define CAN1_IF1MCTL_R (*((volatile unsigned long *)0x40041038))
#define CAN1_IF1DA1_R (*((volatile unsigned long *)0x4004103C))
#define CAN1_IF1DA2_R (*((volatile unsigned long *)0x40041040))
#define CAN1_IF1DB1_R (*((volatile unsigned long *)0x40041044))
#define CAN1_IF1DB2_R (*((volatile unsigned long *)0x40041048))
#define CAN1_IF2CRQ_R (*((volatile unsigned long *)0x40041080))
#define CAN1_IF2CMSK_R (*((volatile unsigned long *)0x40041084))
#define CAN1_IF2MSK1_R (*((volatile unsigned long *)0x40041088))
#define CAN1_IF2MSK2_R (*((volatile unsigned long *)0x4004108C))
#define CAN1_IF2ARB1_R (*((volatile unsigned long *)0x40041090))
#define CAN1_IF2ARB2_R (*((volatile unsigned long *)0x40041094))
#define CAN1_IF2MCTL_R (*((volatile unsigned long *)0x40041098))
#define CAN1_IF2DA1_R (*((volatile unsigned long *)0x4004109C))
#define CAN1_IF2DA2_R (*((volatile unsigned long *)0x400410A0))
#define CAN1_IF2DB1_R (*((volatile unsigned long *)0x400410A4))
#define CAN1_IF2DB2_R (*((volatile unsigned long *)0x400410A8))
#define CAN1_TXRQ1_R (*((volatile unsigned long *)0x40041100))
#define CAN1_TXRQ2_R (*((volatile unsigned long *)0x40041104))
#define CAN1_NWDA1_R (*((volatile unsigned long *)0x40041120))
#define CAN1_NWDA2_R (*((volatile unsigned long *)0x40041124))
#define CAN1_MSG1INT_R (*((volatile unsigned long *)0x40041140))
#define CAN1_MSG2INT_R (*((volatile unsigned long *)0x40041144))
#define CAN1_MSG1VAL_R (*((volatile unsigned long *)0x40041160))
#define CAN1_MSG2VAL_R (*((volatile unsigned long *)0x40041164))

//*****************************************************************************
//
// Timer registers (WTIMER2)
//
//*****************************************************************************
#define WTIMER2_CFG_R (*((volatile unsigned long *)0x4004C000))
#define WTIMER2_TAMR_R (*((volatile unsigned long *)0x4004C004))
#define WTIMER2_TBMR_R (*((volatile unsigned long *)0x4004C008))
#define WTIMER2_CTL_R (*((volatile unsigned long *)0x4004C00C))
#define WTIMER2_SYNC_R (*((volatile unsigned long *)0x4004C010))
#define WTIMER2_IMR_R (*((volatile unsigned long *)0x4004C018))
#define WTIMER2_RIS_R (*((volatile unsigned long *)0x4004C01C))
#define WTIMER2_MIS_R (*((volatile unsigned long *)0x4004C020))
#define WTIMER2_ICR_R (*((volatile unsigned long *)0x4004C024))
#define WTIMER2_TAILR_R (*((volatile unsigned long *)0x4004C028))
#define WTIMER2_TBILR_R (*((volatile unsigned long *)0x4004C02C))
#define WTIMER2_TAMATCHR_R (*((volatile unsigned long *)0x4004C030))
#define WTIMER2_TBMATCHR_R (*((volatile unsigned long *)0x4004C034))
#define WTIMER2_TAPR_R (*((volatile unsigned long *)0x4004C038))
#define WTIMER2_TBPR_R (*((volatile unsigned long *)0x4004C03C))
#define WTIMER2_TAPMR_R (*((volatile unsigned long *)0x4004C040))
#define WTIMER2_TBPMR_R (*((volatile unsigned long *)0x4004C044))
#define WTIMER2_TAR_R (*((volatile unsigned long *)0x4004C048))
#define WTIMER2_TBR_R (*((volatile unsigned long *)0x4004C04C))
#define WTIMER2_TAV_R (*((volatile unsigned long *)0x4004C050))
#define WTIMER2_TBV_R (*((volatile unsigned long *)0x4004C054))
#define WTIMER2_RTCPD_R (*((volatile unsigned long *)0x4004C058))
#define WTIMER2_TAPS_R (*((volatile unsigned long *)0x4004C05C))
#define WTIMER2_TBPS_R (*((volatile unsigned long *)0x4004C060))
#define WTIMER2_TAPV_R (*((volatile unsigned long *)0x4004C064))
#define WTIMER2_TBPV_R (*((volatile unsigned long *)0x4004C068))
#define WTIMER2_PP_R (*((volatile unsigned long *)0x4004CFC0))

//*****************************************************************************
//
// Timer registers (WTIMER3)
//
//*****************************************************************************
#define WTIMER3_CFG_R (*((volatile unsigned long *)0x4004D000))
#define WTIMER3_TAMR_R (*((volatile unsigned long *)0x4004D004))
#define WTIMER3_TBMR_R (*((volatile unsigned long *)0x4004D008))
#define WTIMER3_CTL_R (*((volatile unsigned long *)0x4004D00C))
#define WTIMER3_SYNC_R (*((volatile unsigned long *)0x4004D010))
#define WTIMER3_IMR_R (*((volatile unsigned long *)0x4004D018))
#define WTIMER3_RIS_R (*((volatile unsigned long *)0x4004D01C))
#define WTIMER3_MIS_R (*((volatile unsigned long *)0x4004D020))
#define WTIMER3_ICR_R (*((volatile unsigned long *)0x4004D024))
#define WTIMER3_TAILR_R (*((volatile unsigned long *)0x4004D028))
#define WTIMER3_TBILR_R (*((volatile unsigned long *)0x4004D02C))
#define WTIMER3_TAMATCHR_R (*((volatile unsigned long *)0x4004D030))
#define WTIMER3_TBMATCHR_R (*((volatile unsigned long *)0x4004D034))
#define WTIMER3_TAPR_R (*((volatile unsigned long *)0x4004D038))
#define WTIMER3_TBPR_R (*((volatile unsigned long *)0x4004D03C))
#define WTIMER3_TAPMR_R (*((volatile unsigned long *)0x4004D040))
#define WTIMER3_TBPMR_R (*((volatile unsigned long *)0x4004D044))
#define WTIMER3_TAR_R (*((volatile unsigned long *)0x4004D048))
#define WTIMER3_TBR_R (*((volatile unsigned long *)0x4004D04C))
#define WTIMER3_TAV_R (*((volatile unsigned long *)0x4004D050))
#define WTIMER3_TBV_R (*((volatile unsigned long *)0x4004D054))
#define WTIMER3_RTCPD_R (*((volatile unsigned long *)0x4004D058))
#define WTIMER3_TAPS_R (*((volatile unsigned long *)0x4004D05C))
#define WTIMER3_TBPS_R (*((volatile unsigned long *)0x4004D060))
#define WTIMER3_TAPV_R (*((volatile unsigned long *)0x4004D064))
#define WTIMER3_TBPV_R (*((volatile unsigned long *)0x4004D068))
#define WTIMER3_PP_R (*((volatile unsigned long *)0x4004DFC0))

//*****************************************************************************
//
// Timer registers (WTIMER4)
//
//*****************************************************************************
#define WTIMER4_CFG_R (*((volatile unsigned long *)0x4004E000))
#define WTIMER4_TAMR_R (*((volatile unsigned long *)0x4004E004))
#define WTIMER4_TBMR_R (*((volatile unsigned long *)0x4004E008))
#define WTIMER4_CTL_R (*((volatile unsigned long *)0x4004E00C))
#define WTIMER4_SYNC_R (*((volatile unsigned long *)0x4004E010))
#define WTIMER4_IMR_R (*((volatile unsigned long *)0x4004E018))
#define WTIMER4_RIS_R (*((volatile unsigned long *)0x4004E01C))
#define WTIMER4_MIS_R (*((volatile unsigned long *)0x4004E020))
#define WTIMER4_ICR_R (*((volatile unsigned long *)0x4004E024))
#define WTIMER4_TAILR_R (*((volatile unsigned long *)0x4004E028))
#define WTIMER4_TBILR_R (*((volatile unsigned long *)0x4004E02C))
#define WTIMER4_TAMATCHR_R (*((volatile unsigned long *)0x4004E030))
#define WTIMER4_TBMATCHR_R (*((volatile unsigned long *)0x4004E034))
#define WTIMER4_TAPR_R (*((volatile unsigned long *)0x4004E038))
#define WTIMER4_TBPR_R (*((volatile unsigned long *)0x4004E03C))
#define WTIMER4_TAPMR_R (*((volatile unsigned long *)0x4004E040))
#define WTIMER4_TBPMR_R (*((volatile unsigned long *)0x4004E044))
#define WTIMER4_TAR_R (*((volatile unsigned long *)0x4004E048))
#define WTIMER4_TBR_R (*((volatile unsigned long *)0x4004E04C))
#define WTIMER4_TAV_R (*((volatile unsigned long *)0x4004E050))
#define WTIMER4_TBV_R (*((volatile unsigned long *)0x4004E054))
#define WTIMER4_RTCPD_R (*((volatile unsigned long *)0x4004E058))
#define WTIMER4_TAPS_R (*((volatile unsigned long *)0x4004E05C))
#define WTIMER4_TBPS_R (*((volatile unsigned long *)0x4004E060))
#define WTIMER4_TAPV_R (*((volatile unsigned long *)0x4004E064))
#define WTIMER4_TBPV_R (*((volatile unsigned long *)0x4004E068))
#define WTIMER4_PP_R (*((volatile unsigned long *)0x4004EFC0))

//*****************************************************************************
//
// Timer registers (WTIMER5)
//
//*****************************************************************************
#define WTIMER5_CFG_R (*((volatile unsigned long *)0x4004F000))
#define WTIMER5_TAMR_R (*((volatile unsigned long *)0x4004F004))
#define WTIMER5_TBMR_R (*((volatile unsigned long *)0x4004F008))
#define WTIMER5_CTL_R (*((volatile unsigned long *)0x4004F00C))
#define WTIMER5_SYNC_R (*((volatile unsigned long *)0x4004F010))
#define WTIMER5_IMR_R (*((volatile unsigned long *)0x4004F018))
#define WTIMER5_RIS_R (*((volatile unsigned long *)0x4004F01C))
#define WTIMER5_MIS_R (*((volatile unsigned long *)0x4004F020))
#define WTIMER5_ICR_R (*((volatile unsigned long *)0x4004F024))
#define WTIMER5_TAILR_R (*((volatile unsigned long *)0x4004F028))
#define WTIMER5_TBILR_R (*((volatile unsigned long *)0x4004F02C))
#define WTIMER5_TAMATCHR_R (*((volatile unsigned long *)0x4004F030))
#define WTIMER5_TBMATCHR_R (*((volatile unsigned long *)0x4004F034))
#define WTIMER5_TAPR_R (*((volatile unsigned long *)0x4004F038))
#define WTIMER5_TBPR_R (*((volatile unsigned long *)0x4004F03C))
#define WTIMER5_TAPMR_R (*((volatile unsigned long *)0x4004F040))
#define WTIMER5_TBPMR_R (*((volatile unsigned long *)0x4004F044))
#define WTIMER5_TAR_R (*((volatile unsigned long *)0x4004F048))
#define WTIMER5_TBR_R (*((volatile unsigned long *)0x4004F04C))
#define WTIMER5_TAV_R (*((volatile unsigned long *)0x4004F050))
#define WTIMER5_TBV_R (*((volatile unsigned long *)0x4004F054))
#define WTIMER5_RTCPD_R (*((volatile unsigned long *)0x4004F058))
#define WTIMER5_TAPS_R (*((volatile unsigned long *)0x4004F05C))
#define WTIMER5_TBPS_R (*((volatile unsigned long *)0x4004F060))
#define WTIMER5_TAPV_R (*((volatile unsigned long *)0x4004F064))
#define WTIMER5_TBPV_R (*((volatile unsigned long *)0x4004F068))
#define WTIMER5_PP_R (*((volatile unsigned long *)0x4004FFC0))

