sethbrad/CprE288-Lab9/REF_tm4c123gh6pm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port F.
//
//*****************************************************************************
#define GPIO_PCTL_PF4_M 0x000F0000        // PF4 mask
#define GPIO_PCTL_PF4_M1FAULT0 0x00050000 // M1FAULT0 on PF4
#define GPIO_PCTL_PF4_IDX0 0x00060000     // IDX0 on PF4
#define GPIO_PCTL_PF4_T2CCP0 0x00070000   // T2CCP0 on PF4
#define GPIO_PCTL_PF4_USB0EPEN 0x00080000 // USB0EPEN on PF4
#define GPIO_PCTL_PF3_M 0x0000F000        // PF3 mask
#define GPIO_PCTL_PF3_SSI1FSS 0x00002000  // SSI1FSS on PF3
#define GPIO_PCTL_PF3_CAN0TX 0x00003000   // CAN0TX on PF3
#define GPIO_PCTL_PF3_M1PWM7 0x00005000   // M1PWM7 on PF3
#define GPIO_PCTL_PF3_T1CCP1 0x00007000   // T1CCP1 on PF3
#define GPIO_PCTL_PF3_TRCLK 0x0000E000    // TRCLK on PF3
#define GPIO_PCTL_PF2_M 0x00000F00        // PF2 mask
#define GPIO_PCTL_PF2_SSI1CLK 0x00000200  // SSI1CLK on PF2
#define GPIO_PCTL_PF2_M0FAULT0 0x00000400 // M0FAULT0 on PF2
#define GPIO_PCTL_PF2_M1PWM6 0x00000500   // M1PWM6 on PF2
#define GPIO_PCTL_PF2_T1CCP0 0x00000700   // T1CCP0 on PF2
#define GPIO_PCTL_PF2_TRD0 0x00000E00     // TRD0 on PF2
#define GPIO_PCTL_PF1_M 0x000000F0        // PF1 mask
#define GPIO_PCTL_PF1_U1CTS 0x00000010    // U1CTS on PF1
#define GPIO_PCTL_PF1_SSI1TX 0x00000020   // SSI1TX on PF1
#define GPIO_PCTL_PF1_M1PWM5 0x00000050   // M1PWM5 on PF1
#define GPIO_PCTL_PF1_PHB0 0x00000060     // PHB0 on PF1
#define GPIO_PCTL_PF1_T0CCP1 0x00000070   // T0CCP1 on PF1
#define GPIO_PCTL_PF1_C1O 0x00000090      // C1O on PF1
#define GPIO_PCTL_PF1_TRD1 0x000000E0     // TRD1 on PF1
#define GPIO_PCTL_PF0_M 0x0000000F        // PF0 mask
#define GPIO_PCTL_PF0_U1RTS 0x00000001    // U1RTS on PF0
#define GPIO_PCTL_PF0_SSI1RX 0x00000002   // SSI1RX on PF0
#define GPIO_PCTL_PF0_CAN0RX 0x00000003   // CAN0RX on PF0
#define GPIO_PCTL_PF0_M1PWM4 0x00000005   // M1PWM4 on PF0
#define GPIO_PCTL_PF0_PHA0 0x00000006     // PHA0 on PF0
#define GPIO_PCTL_PF0_T0CCP0 0x00000007   // T0CCP0 on PF0
#define GPIO_PCTL_PF0_NMI 0x00000008      // NMI on PF0
#define GPIO_PCTL_PF0_C0O 0x00000009      // C0O on PF0

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_CR0 register.
//
//*****************************************************************************
#define SSI_CR0_SCR_M 0x0000FF00    // SSI Serial Clock Rate
#define SSI_CR0_SPH 0x00000080      // SSI Serial Clock Phase
#define SSI_CR0_SPO 0x00000040      // SSI Serial Clock Polarity
#define SSI_CR0_FRF_M 0x00000030    // SSI Frame Format Select
#define SSI_CR0_FRF_MOTO 0x00000000 // Freescale SPI Frame Format
#define SSI_CR0_FRF_TI                                                         \
  0x00000010                       // Texas Instruments Synchronous
                                   // Serial Frame Format
#define SSI_CR0_FRF_NMW 0x00000020 // MICROWIRE Frame Format
#define SSI_CR0_DSS_M 0x0000000F   // SSI Data Size Select
#define SSI_CR0_DSS_4 0x00000003   // 4-bit data
#define SSI_CR0_DSS_5 0x00000004   // 5-bit data
#define SSI_CR0_DSS_6 0x00000005   // 6-bit data
#define SSI_CR0_DSS_7 0x00000006   // 7-bit data
#define SSI_CR0_DSS_8 0x00000007   // 8-bit data
#define SSI_CR0_DSS_9 0x00000008   // 9-bit data
#define SSI_CR0_DSS_10 0x00000009  // 10-bit data
#define SSI_CR0_DSS_11 0x0000000A  // 11-bit data
#define SSI_CR0_DSS_12 0x0000000B  // 12-bit data
#define SSI_CR0_DSS_13 0x0000000C  // 13-bit data
#define SSI_CR0_DSS_14 0x0000000D  // 14-bit data
#define SSI_CR0_DSS_15 0x0000000E  // 15-bit data
#define SSI_CR0_DSS_16 0x0000000F  // 16-bit data
#define SSI_CR0_SCR_S 8

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_CR1 register.
//
//*****************************************************************************
#define SSI_CR1_EOT 0x00000010 // End of Transmission
#define SSI_CR1_SOD 0x00000008 // SSI Slave Mode Output Disable
#define SSI_CR1_MS 0x00000004  // SSI Master/Slave Select
#define SSI_CR1_SSE                                                            \
  0x00000002                   // SSI Synchronous Serial Port
                               // Enable
#define SSI_CR1_LBM 0x00000001 // SSI Loopback Mode

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_DR register.
//
//*****************************************************************************
#define SSI_DR_DATA_M 0x0000FFFF // SSI Receive/Transmit Data
#define SSI_DR_DATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_SR register.
//
//*****************************************************************************
#define SSI_SR_BSY 0x00000010 // SSI Busy Bit
#define SSI_SR_RFF 0x00000008 // SSI Receive FIFO Full
#define SSI_SR_RNE 0x00000004 // SSI Receive FIFO Not Empty
#define SSI_SR_TNF 0x00000002 // SSI Transmit FIFO Not Full
#define SSI_SR_TFE 0x00000001 // SSI Transmit FIFO Empty

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_CPSR register.
//
//*****************************************************************************
#define SSI_CPSR_CPSDVSR_M 0x000000FF // SSI Clock Prescale Divisor
#define SSI_CPSR_CPSDVSR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_IM register.
//
//*****************************************************************************
#define SSI_IM_TXIM 0x00000008 // SSI Transmit FIFO Interrupt Mask
#define SSI_IM_RXIM 0x00000004 // SSI Receive FIFO Interrupt Mask
#define SSI_IM_RTIM                                                            \
  0x00000002 // SSI Receive Time-Out Interrupt
             // Mask
#define SSI_IM_RORIM                                                           \
  0x00000001 // SSI Receive Overrun Interrupt
             // Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_RIS register.
//
//*****************************************************************************
#define SSI_RIS_TXRIS                                                          \
  0x00000008 // SSI Transmit FIFO Raw Interrupt
             // Status
#define SSI_RIS_RXRIS                                                          \
  0x00000004 // SSI Receive FIFO Raw Interrupt
             // Status
#define SSI_RIS_RTRIS                                                          \
  0x00000002 // SSI Receive Time-Out Raw
             // Interrupt Status
#define SSI_RIS_RORRIS                                                         \
  0x00000001 // SSI Receive Overrun Raw
             // Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_MIS register.
//
//*****************************************************************************
#define SSI_MIS_TXMIS                                                          \
  0x00000008 // SSI Transmit FIFO Masked
             // Interrupt Status
#define SSI_MIS_RXMIS                                                          \
  0x00000004 // SSI Receive FIFO Masked
             // Interrupt Status
#define SSI_MIS_RTMIS                                                          \
  0x00000002 // SSI Receive Time-Out Masked
             // Interrupt Status
#define SSI_MIS_RORMIS                                                         \
  0x00000001 // SSI Receive Overrun Masked
             // Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_ICR register.
//
//*****************************************************************************
#define SSI_ICR_RTIC                                                           \
  0x00000002 // SSI Receive Time-Out Interrupt
             // Clear
#define SSI_ICR_RORIC                                                          \
  0x00000001 // SSI Receive Overrun Interrupt
             // Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_DMACTL register.
//
//*****************************************************************************
#define SSI_DMACTL_TXDMAE 0x00000002 // Transmit DMA Enable
#define SSI_DMACTL_RXDMAE 0x00000001 // Receive DMA Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the SSI_O_CC register.
//
//*****************************************************************************
#define SSI_CC_CS_M 0x0000000F // SSI Baud Clock Source
#define SSI_CC_CS_SYSPLL                                                       \
  0x00000000                       // Either the system clock (if the
                                   // PLL bypass is in effect) or the
                                   // PLL output (default)
#define SSI_CC_CS_PIOSC 0x00000005 // PIOSC

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_DR register.
//
//*****************************************************************************
#define UART_DR_OE 0x00000800     // UART Overrun Error
#define UART_DR_BE 0x00000400     // UART Break Error
#define UART_DR_PE 0x00000200     // UART Parity Error
#define UART_DR_FE 0x00000100     // UART Framing Error
#define UART_DR_DATA_M 0x000000FF // Data Transmitted or Received
#define UART_DR_DATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_RSR register.
//
//*****************************************************************************
#define UART_RSR_OE 0x00000008 // UART Overrun Error
#define UART_RSR_BE 0x00000004 // UART Break Error
#define UART_RSR_PE 0x00000002 // UART Parity Error
#define UART_RSR_FE 0x00000001 // UART Framing Error

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_ECR register.
//
//*****************************************************************************
#define UART_ECR_DATA_M 0x000000FF // Error Clear
#define UART_ECR_DATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_FR register.
//
//*****************************************************************************
#define UART_FR_TXFE 0x00000080 // UART Transmit FIFO Empty
#define UART_FR_RXFF 0x00000040 // UART Receive FIFO Full
#define UART_FR_TXFF 0x00000020 // UART Transmit FIFO Full
#define UART_FR_RXFE 0x00000010 // UART Receive FIFO Empty
#define UART_FR_BUSY 0x00000008 // UART Busy
#define UART_FR_CTS 0x00000001  // Clear To Send

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_ILPR register.
//
//*****************************************************************************
#define UART_ILPR_ILPDVSR_M 0x000000FF // IrDA Low-Power Divisor
#define UART_ILPR_ILPDVSR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_IBRD register.
//
//*****************************************************************************
#define UART_IBRD_DIVINT_M 0x0000FFFF // Integer Baud-Rate Divisor
#define UART_IBRD_DIVINT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_FBRD register.
//
//*****************************************************************************
#define UART_FBRD_DIVFRAC_M 0x0000003F // Fractional Baud-Rate Divisor
#define UART_FBRD_DIVFRAC_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_LCRH register.
//
//*****************************************************************************
#define UART_LCRH_SPS 0x00000080    // UART Stick Parity Select
#define UART_LCRH_WLEN_M 0x00000060 // UART Word Length
#define UART_LCRH_WLEN_5 0x00000000 // 5 bits (default)
#define UART_LCRH_WLEN_6 0x00000020 // 6 bits
#define UART_LCRH_WLEN_7 0x00000040 // 7 bits
#define UART_LCRH_WLEN_8 0x00000060 // 8 bits
#define UART_LCRH_FEN 0x00000010    // UART Enable FIFOs
#define UART_LCRH_STP2 0x00000008   // UART Two Stop Bits Select
#define UART_LCRH_EPS 0x00000004    // UART Even Parity Select
#define UART_LCRH_PEN 0x00000002    // UART Parity Enable
#define UART_LCRH_BRK 0x00000001    // UART Send Break

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_CTL register.
//
//*****************************************************************************
#define UART_CTL_CTSEN 0x00008000  // Enable Clear To Send
#define UART_CTL_RTSEN 0x00004000  // Enable Request to Send
#define UART_CTL_RTS 0x00000800    // Request to Send
#define UART_CTL_RXE 0x00000200    // UART Receive Enable
#define UART_CTL_TXE 0x00000100    // UART Transmit Enable
#define UART_CTL_LBE 0x00000080    // UART Loop Back Enable
#define UART_CTL_HSE 0x00000020    // High-Speed Enable
#define UART_CTL_EOT 0x00000010    // End of Transmission
#define UART_CTL_SMART 0x00000008  // ISO 7816 Smart Card Support
#define UART_CTL_SIRLP 0x00000004  // UART SIR Low-Power Mode
#define UART_CTL_SIREN 0x00000002  // UART SIR Enable
#define UART_CTL_UARTEN 0x00000001 // UART Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_IFLS register.
//
//*****************************************************************************
#define UART_IFLS_RX_M                                                         \
  0x00000038                       // UART Receive Interrupt FIFO
                                   // Level Select
#define UART_IFLS_RX1_8 0x00000000 // RX FIFO >= 1/8 full
#define UART_IFLS_RX2_8 0x00000008 // RX FIFO >= 1/4 full
#define UART_IFLS_RX4_8 0x00000010 // RX FIFO >= 1/2 full (default)
#define UART_IFLS_RX6_8 0x00000018 // RX FIFO >= 3/4 full
#define UART_IFLS_RX7_8 0x00000020 // RX FIFO >= 7/8 full
#define UART_IFLS_TX_M                                                         \
  0x00000007                       // UART Transmit Interrupt FIFO
                                   // Level Select
#define UART_IFLS_TX1_8 0x00000000 // TX FIFO <= 1/8 full
#define UART_IFLS_TX2_8 0x00000001 // TX FIFO <= 1/4 full
#define UART_IFLS_TX4_8 0x00000002 // TX FIFO <= 1/2 full (default)
#define UART_IFLS_TX6_8 0x00000003 // TX FIFO <= 3/4 full
#define UART_IFLS_TX7_8 0x00000004 // TX FIFO <= 7/8 full

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_IM register.
//
//*****************************************************************************
#define UART_IM_9BITIM 0x00001000 // 9-Bit Mode Interrupt Mask
#define UART_IM_OEIM                                                           \
  0x00000400                    // UART Overrun Error Interrupt
                                // Mask
#define UART_IM_BEIM 0x00000200 // UART Break Error Interrupt Mask
#define UART_IM_PEIM 0x00000100 // UART Parity Error Interrupt Mask
#define UART_IM_FEIM                                                           \
  0x00000080 // UART Framing Error Interrupt
             // Mask
#define UART_IM_RTIM                                                           \
  0x00000040                    // UART Receive Time-Out Interrupt
                                // Mask
#define UART_IM_TXIM 0x00000020 // UART Transmit Interrupt Mask
#define UART_IM_RXIM 0x00000010 // UART Receive Interrupt Mask
#define UART_IM_CTSMIM                                                         \
  0x00000002 // UART Clear to Send Modem
             // Interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_RIS register.
//
//*****************************************************************************
#define UART_RIS_9BITRIS 0x00001000 // 9-Bit Mode Raw Interrupt Status
#define UART_RIS_OERIS                                                         \
  0x00000400 // UART Overrun Error Raw Interrupt
             // Status
#define UART_RIS_BERIS                                                         \
  0x00000200 // UART Break Error Raw Interrupt
             // Status
#define UART_RIS_PERIS                                                         \
  0x00000100 // UART Parity Error Raw Interrupt
             // Status
#define UART_RIS_FERIS                                                         \
  0x00000080 // UART Framing Error Raw Interrupt
             // Status
#define UART_RIS_RTRIS                                                         \
  0x00000040 // UART Receive Time-Out Raw
             // Interrupt Status
#define UART_RIS_TXRIS                                                         \
  0x00000020 // UART Transmit Raw Interrupt
             // Status
#define UART_RIS_RXRIS                                                         \
  0x00000010 // UART Receive Raw Interrupt
             // Status
#define UART_RIS_CTSRIS                                                        \
  0x00000002 // UART Clear to Send Modem Raw
             // Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_MIS register.
//
//*****************************************************************************
#define UART_MIS_9BITMIS                                                       \
  0x00001000 // 9-Bit Mode Masked Interrupt
             // Status
#define UART_MIS_OEMIS                                                         \
  0x00000400 // UART Overrun Error Masked
             // Interrupt Status
#define UART_MIS_BEMIS                                                         \
  0x00000200 // UART Break Error Masked
             // Interrupt Status
#define UART_MIS_PEMIS                                                         \
  0x00000100 // UART Parity Error Masked
             // Interrupt Status
#define UART_MIS_FEMIS                                                         \
  0x00000080 // UART Framing Error Masked
             // Interrupt Status
#define UART_MIS_RTMIS                                                         \
  0x00000040 // UART Receive Time-Out Masked
             // Interrupt Status
#define UART_MIS_TXMIS                                                         \
  0x00000020 // UART Transmit Masked Interrupt
             // Status
#define UART_MIS_RXMIS                                                         \
  0x00000010 // UART Receive Masked Interrupt
             // Status
#define UART_MIS_CTSMIS                                                        \
  0x00000002 // UART Clear to Send Modem Masked
             // Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_ICR register.
//
//*****************************************************************************
#define UART_ICR_9BITIC 0x00001000 // 9-Bit Mode Interrupt Clear
#define UART_ICR_OEIC 0x00000400   // Overrun Error Interrupt Clear
#define UART_ICR_BEIC 0x00000200   // Break Error Interrupt Clear
#define UART_ICR_PEIC 0x00000100   // Parity Error Interrupt Clear
#define UART_ICR_FEIC 0x00000080   // Framing Error Interrupt Clear
#define UART_ICR_RTIC 0x00000040   // Receive Time-Out Interrupt Clear
#define UART_ICR_TXIC 0x00000020   // Transmit Interrupt Clear
#define UART_ICR_RXIC 0x00000010   // Receive Interrupt Clear
#define UART_ICR_CTSMIC                                                        \
  0x00000002 // UART Clear to Send Modem
             // Interrupt Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_DMACTL register.
//
//*****************************************************************************
#define UART_DMACTL_DMAERR 0x00000004 // DMA on Error
#define UART_DMACTL_TXDMAE 0x00000002 // Transmit DMA Enable
#define UART_DMACTL_RXDMAE 0x00000001 // Receive DMA Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_9BITADDR
// register.
//
//*****************************************************************************
#define UART_9BITADDR_9BITEN 0x00008000 // Enable 9-Bit Mode
#define UART_9BITADDR_ADDR_M 0x000000FF // Self Address for 9-Bit Mode
#define UART_9BITADDR_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_9BITAMASK
// register.
//
//*****************************************************************************
#define UART_9BITAMASK_MASK_M 0x000000FF // Self Address Mask for 9-Bit Mode
#define UART_9BITAMASK_MASK_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_PP register.
//
//*****************************************************************************
#define UART_PP_NB 0x00000002 // 9-Bit Support
#define UART_PP_SC 0x00000001 // Smart Card Support

//*****************************************************************************
//
// The following are defines for the bit fields in the UART_O_CC register.
//
//*****************************************************************************
#define UART_CC_CS_M 0x0000000F      // UART Baud Clock Source
#define UART_CC_CS_SYSCLK 0x00000000 // The system clock (default)
#define UART_CC_CS_PIOSC 0x00000005  // PIOSC

//*****************************************************************************
//
// The following are defines for the bit fields in the I2C_O_MSA register.
//
//*****************************************************************************
#define I2C_MSA_SA_M 0x000000FE // I2C Slave Address
#define I2C_MSA_RS 0x00000001   // Receive not send
#define I2C_MSA_SA_S 1

