sethbrad/CprE288-Lab9/REF_tm4c123gh6pm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_GENB register.
//
//*****************************************************************************
#define PWM_3_GENB_ACTCMPBD_M 0x00000C00    // Action for Comparator B Down
#define PWM_3_GENB_ACTCMPBD_NONE 0x00000000 // Do nothing
#define PWM_3_GENB_ACTCMPBD_INV 0x00000400  // Invert the output signal
#define PWM_3_GENB_ACTCMPBD_ZERO 0x00000800 // Set the output signal to 0
#define PWM_3_GENB_ACTCMPBD_ONE 0x00000C00  // Set the output signal to 1
#define PWM_3_GENB_ACTCMPBU_M 0x00000300    // Action for Comparator B Up
#define PWM_3_GENB_ACTCMPBU_NONE 0x00000000 // Do nothing
#define PWM_3_GENB_ACTCMPBU_INV 0x00000100  // Invert the output signal
#define PWM_3_GENB_ACTCMPBU_ZERO 0x00000200 // Set the output signal to 0
#define PWM_3_GENB_ACTCMPBU_ONE 0x00000300  // Set the output signal to 1
#define PWM_3_GENB_ACTCMPAD_M 0x000000C0    // Action for Comparator A Down
#define PWM_3_GENB_ACTCMPAD_NONE 0x00000000 // Do nothing
#define PWM_3_GENB_ACTCMPAD_INV 0x00000040  // Invert the output signal
#define PWM_3_GENB_ACTCMPAD_ZERO 0x00000080 // Set the output signal to 0
#define PWM_3_GENB_ACTCMPAD_ONE 0x000000C0  // Set the output signal to 1
#define PWM_3_GENB_ACTCMPAU_M 0x00000030    // Action for Comparator A Up
#define PWM_3_GENB_ACTCMPAU_NONE 0x00000000 // Do nothing
#define PWM_3_GENB_ACTCMPAU_INV 0x00000010  // Invert the output signal
#define PWM_3_GENB_ACTCMPAU_ZERO 0x00000020 // Set the output signal to 0
#define PWM_3_GENB_ACTCMPAU_ONE 0x00000030  // Set the output signal to 1
#define PWM_3_GENB_ACTLOAD_M 0x0000000C     // Action for Counter=Load
#define PWM_3_GENB_ACTLOAD_NONE 0x00000000  // Do nothing
#define PWM_3_GENB_ACTLOAD_INV 0x00000004   // Invert the output signal
#define PWM_3_GENB_ACTLOAD_ZERO 0x00000008  // Set the output signal to 0
#define PWM_3_GENB_ACTLOAD_ONE 0x0000000C   // Set the output signal to 1
#define PWM_3_GENB_ACTZERO_M 0x00000003     // Action for Counter=0
#define PWM_3_GENB_ACTZERO_NONE 0x00000000  // Do nothing
#define PWM_3_GENB_ACTZERO_INV 0x00000001   // Invert the output signal
#define PWM_3_GENB_ACTZERO_ZERO 0x00000002  // Set the output signal to 0
#define PWM_3_GENB_ACTZERO_ONE 0x00000003   // Set the output signal to 1

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_DBCTL register.
//
//*****************************************************************************
#define PWM_3_DBCTL_ENABLE 0x00000001 // Dead-Band Generator Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_DBRISE register.
//
//*****************************************************************************
#define PWM_3_DBRISE_RISEDELAY_M 0x00000FFF // Dead-Band Rise Delay
#define PWM_3_DBRISE_RISEDELAY_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_DBFALL register.
//
//*****************************************************************************
#define PWM_3_DBFALL_FALLDELAY_M 0x00000FFF // Dead-Band Fall Delay
#define PWM_3_DBFALL_FALLDELAY_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_FLTSRC0
// register.
//
//*****************************************************************************
#define PWM_3_FLTSRC0_FAULT1 0x00000002 // Fault1
#define PWM_3_FLTSRC0_FAULT0 0x00000001 // Fault0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_FLTSRC1
// register.
//
//*****************************************************************************
#define PWM_3_FLTSRC1_DCMP7 0x00000080 // Digital Comparator 7
#define PWM_3_FLTSRC1_DCMP6 0x00000040 // Digital Comparator 6
#define PWM_3_FLTSRC1_DCMP5 0x00000020 // Digital Comparator 5
#define PWM_3_FLTSRC1_DCMP4 0x00000010 // Digital Comparator 4
#define PWM_3_FLTSRC1_DCMP3 0x00000008 // Digital Comparator 3
#define PWM_3_FLTSRC1_DCMP2 0x00000004 // Digital Comparator 2
#define PWM_3_FLTSRC1_DCMP1 0x00000002 // Digital Comparator 1
#define PWM_3_FLTSRC1_DCMP0 0x00000001 // Digital Comparator 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_MINFLTPER
// register.
//
//*****************************************************************************
#define PWM_3_MINFLTPER_MFP_M 0x0000FFFF // Minimum Fault Period
#define PWM_3_MINFLTPER_MFP_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_0_FLTSEN register.
//
//*****************************************************************************
#define PWM_0_FLTSEN_FAULT1 0x00000002 // Fault1 Sense
#define PWM_0_FLTSEN_FAULT0 0x00000001 // Fault0 Sense

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_0_FLTSTAT0
// register.
//
//*****************************************************************************
#define PWM_0_FLTSTAT0_FAULT1 0x00000002 // Fault Input 1
#define PWM_0_FLTSTAT0_FAULT0 0x00000001 // Fault Input 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_0_FLTSTAT1
// register.
//
//*****************************************************************************
#define PWM_0_FLTSTAT1_DCMP7 0x00000080 // Digital Comparator 7 Trigger
#define PWM_0_FLTSTAT1_DCMP6 0x00000040 // Digital Comparator 6 Trigger
#define PWM_0_FLTSTAT1_DCMP5 0x00000020 // Digital Comparator 5 Trigger
#define PWM_0_FLTSTAT1_DCMP4 0x00000010 // Digital Comparator 4 Trigger
#define PWM_0_FLTSTAT1_DCMP3 0x00000008 // Digital Comparator 3 Trigger
#define PWM_0_FLTSTAT1_DCMP2 0x00000004 // Digital Comparator 2 Trigger
#define PWM_0_FLTSTAT1_DCMP1 0x00000002 // Digital Comparator 1 Trigger
#define PWM_0_FLTSTAT1_DCMP0 0x00000001 // Digital Comparator 0 Trigger

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_1_FLTSEN register.
//
//*****************************************************************************
#define PWM_1_FLTSEN_FAULT1 0x00000002 // Fault1 Sense
#define PWM_1_FLTSEN_FAULT0 0x00000001 // Fault0 Sense

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_1_FLTSTAT0
// register.
//
//*****************************************************************************
#define PWM_1_FLTSTAT0_FAULT1 0x00000002 // Fault Input 1
#define PWM_1_FLTSTAT0_FAULT0 0x00000001 // Fault Input 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_1_FLTSTAT1
// register.
//
//*****************************************************************************
#define PWM_1_FLTSTAT1_DCMP7 0x00000080 // Digital Comparator 7 Trigger
#define PWM_1_FLTSTAT1_DCMP6 0x00000040 // Digital Comparator 6 Trigger
#define PWM_1_FLTSTAT1_DCMP5 0x00000020 // Digital Comparator 5 Trigger
#define PWM_1_FLTSTAT1_DCMP4 0x00000010 // Digital Comparator 4 Trigger
#define PWM_1_FLTSTAT1_DCMP3 0x00000008 // Digital Comparator 3 Trigger
#define PWM_1_FLTSTAT1_DCMP2 0x00000004 // Digital Comparator 2 Trigger
#define PWM_1_FLTSTAT1_DCMP1 0x00000002 // Digital Comparator 1 Trigger
#define PWM_1_FLTSTAT1_DCMP0 0x00000001 // Digital Comparator 0 Trigger

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_2_FLTSTAT0
// register.
//
//*****************************************************************************
#define PWM_2_FLTSTAT0_FAULT1 0x00000002 // Fault Input 1
#define PWM_2_FLTSTAT0_FAULT0 0x00000001 // Fault Input 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_2_FLTSTAT1
// register.
//
//*****************************************************************************
#define PWM_2_FLTSTAT1_DCMP7 0x00000080 // Digital Comparator 7 Trigger
#define PWM_2_FLTSTAT1_DCMP6 0x00000040 // Digital Comparator 6 Trigger
#define PWM_2_FLTSTAT1_DCMP5 0x00000020 // Digital Comparator 5 Trigger
#define PWM_2_FLTSTAT1_DCMP4 0x00000010 // Digital Comparator 4 Trigger
#define PWM_2_FLTSTAT1_DCMP3 0x00000008 // Digital Comparator 3 Trigger
#define PWM_2_FLTSTAT1_DCMP2 0x00000004 // Digital Comparator 2 Trigger
#define PWM_2_FLTSTAT1_DCMP1 0x00000002 // Digital Comparator 1 Trigger
#define PWM_2_FLTSTAT1_DCMP0 0x00000001 // Digital Comparator 0 Trigger

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_FLTSTAT0
// register.
//
//*****************************************************************************
#define PWM_3_FLTSTAT0_FAULT1 0x00000002 // Fault Input 1
#define PWM_3_FLTSTAT0_FAULT0 0x00000001 // Fault Input 0

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_3_FLTSTAT1
// register.
//
//*****************************************************************************
#define PWM_3_FLTSTAT1_DCMP7 0x00000080 // Digital Comparator 7 Trigger
#define PWM_3_FLTSTAT1_DCMP6 0x00000040 // Digital Comparator 6 Trigger
#define PWM_3_FLTSTAT1_DCMP5 0x00000020 // Digital Comparator 5 Trigger
#define PWM_3_FLTSTAT1_DCMP4 0x00000010 // Digital Comparator 4 Trigger
#define PWM_3_FLTSTAT1_DCMP3 0x00000008 // Digital Comparator 3 Trigger
#define PWM_3_FLTSTAT1_DCMP2 0x00000004 // Digital Comparator 2 Trigger
#define PWM_3_FLTSTAT1_DCMP1 0x00000002 // Digital Comparator 1 Trigger
#define PWM_3_FLTSTAT1_DCMP0 0x00000001 // Digital Comparator 0 Trigger

//*****************************************************************************
//
// The following are defines for the bit fields in the PWM_O_PP register.
//
//*****************************************************************************
#define PWM_PP_ONE 0x00000400    // One-Shot Mode
#define PWM_PP_EFAULT 0x00000200 // Extended Fault
#define PWM_PP_ESYNC 0x00000100  // Extended Synchronization
#define PWM_PP_FCNT_M 0x000000F0 // Fault Inputs
#define PWM_PP_GCNT_M 0x0000000F // Generators
#define PWM_PP_FCNT_S 4
#define PWM_PP_GCNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the QEI_O_CTL register.
//
//*****************************************************************************
#define QEI_CTL_FILTCNT_M 0x000F0000  // Input Filter Prescale Count
#define QEI_CTL_FILTEN 0x00002000     // Enable Input Filter
#define QEI_CTL_STALLEN 0x00001000    // Stall QEI
#define QEI_CTL_INVI 0x00000800       // Invert Index Pulse
#define QEI_CTL_INVB 0x00000400       // Invert PhB
#define QEI_CTL_INVA 0x00000200       // Invert PhA
#define QEI_CTL_VELDIV_M 0x000001C0   // Predivide Velocity
#define QEI_CTL_VELDIV_1 0x00000000   // QEI clock /1
#define QEI_CTL_VELDIV_2 0x00000040   // QEI clock /2
#define QEI_CTL_VELDIV_4 0x00000080   // QEI clock /4
#define QEI_CTL_VELDIV_8 0x000000C0   // QEI clock /8
#define QEI_CTL_VELDIV_16 0x00000100  // QEI clock /16
#define QEI_CTL_VELDIV_32 0x00000140  // QEI clock /32
#define QEI_CTL_VELDIV_64 0x00000180  // QEI clock /64
#define QEI_CTL_VELDIV_128 0x000001C0 // QEI clock /128
#define QEI_CTL_VELEN 0x00000020      // Capture Velocity
#define QEI_CTL_RESMODE 0x00000010    // Reset Mode
#define QEI_CTL_CAPMODE 0x00000008    // Capture Mode
#define QEI_CTL_SIGMODE 0x00000004    // Signal Mode
#define QEI_CTL_SWAP 0x00000002       // Swap Signals
#define QEI_CTL_ENABLE 0x00000001     // Enable QEI
#define QEI_CTL_FILTCNT_S 16

//*****************************************************************************
//
// The following are defines for the bit fields in the QEI_O_STAT register.
//
//*****************************************************************************
#define QEI_STAT_DIRECTION 0x00000002 // Direction of Rotation
#define QEI_STAT_ERROR 0x00000001     // Error Detected

//*****************************************************************************
//
// The following are defines for the bit fields in the QEI_O_POS register.
//
//*****************************************************************************
#define QEI_POS_M                                                              \
  0xFFFFFFFF // Current Position Integrator
             // Value
#define QEI_POS_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the QEI_O_MAXPOS register.
//
//*****************************************************************************
#define QEI_MAXPOS_M                                                           \
  0xFFFFFFFF // Maximum Position Integrator
             // Value
#define QEI_MAXPOS_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the QEI_O_LOAD register.
//
//*****************************************************************************
#define QEI_LOAD_M 0xFFFFFFFF // Velocity Timer Load Value
#define QEI_LOAD_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the QEI_O_TIME register.
//
//*****************************************************************************
#define QEI_TIME_M 0xFFFFFFFF // Velocity Timer Current Value
#define QEI_TIME_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the QEI_O_COUNT register.
//
//*****************************************************************************
#define QEI_COUNT_M 0xFFFFFFFF // Velocity Pulse Count
#define QEI_COUNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the QEI_O_SPEED register.
//
//*****************************************************************************
#define QEI_SPEED_M 0xFFFFFFFF // Velocity
#define QEI_SPEED_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the QEI_O_INTEN register.
//
//*****************************************************************************
#define QEI_INTEN_ERROR 0x00000008 // Phase Error Interrupt Enable
#define QEI_INTEN_DIR                                                          \
  0x00000004                       // Direction Change Interrupt
                                   // Enable
#define QEI_INTEN_TIMER 0x00000002 // Timer Expires Interrupt Enable
#define QEI_INTEN_INDEX                                                        \
  0x00000001 // Index Pulse Detected Interrupt
             // Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the QEI_O_RIS register.
//
//*****************************************************************************
#define QEI_RIS_ERROR 0x00000008 // Phase Error Detected
#define QEI_RIS_DIR 0x00000004   // Direction Change Detected
#define QEI_RIS_TIMER 0x00000002 // Velocity Timer Expired
#define QEI_RIS_INDEX 0x00000001 // Index Pulse Asserted

//*****************************************************************************
//
// The following are defines for the bit fields in the QEI_O_ISC register.
//
//*****************************************************************************
#define QEI_ISC_ERROR 0x00000008 // Phase Error Interrupt
#define QEI_ISC_DIR 0x00000004   // Direction Change Interrupt
#define QEI_ISC_TIMER 0x00000002 // Velocity Timer Expired Interrupt
#define QEI_ISC_INDEX 0x00000001 // Index Pulse Interrupt

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_CFG register.
//
//*****************************************************************************
#define TIMER_CFG_M 0x00000007            // GPTM Configuration
#define TIMER_CFG_32_BIT_TIMER 0x00000000 // 32-bit timer configuration
#define TIMER_CFG_32_BIT_RTC                                                   \
  0x00000001 // 32-bit real-time clock (RTC)
             // counter configuration
#define TIMER_CFG_16_BIT                                                       \
  0x00000004 // 16-bit timer configuration. The
             // function is controlled by bits
             // 1:0 of GPTMTAMR and GPTMTBMR

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TAMR register.
//
//*****************************************************************************
#define TIMER_TAMR_TAPLO                                                       \
  0x00000800 // GPTM Timer A PWM Legacy
             // Operation
#define TIMER_TAMR_TAMRSU                                                      \
  0x00000400 // GPTM Timer A Match Register
             // Update
#define TIMER_TAMR_TAPWMIE                                                     \
  0x00000200                          // GPTM Timer A PWM Interrupt
                                      // Enable
#define TIMER_TAMR_TAILD 0x00000100   // GPTM Timer A Interval Load Write
#define TIMER_TAMR_TASNAPS 0x00000080 // GPTM Timer A Snap-Shot Mode
#define TIMER_TAMR_TAWOT 0x00000040   // GPTM Timer A Wait-on-Trigger
#define TIMER_TAMR_TAMIE                                                       \
  0x00000020                         // GPTM Timer A Match Interrupt
                                     // Enable
#define TIMER_TAMR_TACDIR 0x00000010 // GPTM Timer A Count Direction
#define TIMER_TAMR_TAAMS                                                       \
  0x00000008                              // GPTM Timer A Alternate Mode
                                          // Select
#define TIMER_TAMR_TACMR 0x00000004       // GPTM Timer A Capture Mode
#define TIMER_TAMR_TAMR_M 0x00000003      // GPTM Timer A Mode
#define TIMER_TAMR_TAMR_1_SHOT 0x00000001 // One-Shot Timer mode
#define TIMER_TAMR_TAMR_PERIOD 0x00000002 // Periodic Timer mode
#define TIMER_TAMR_TAMR_CAP 0x00000003    // Capture mode

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TBMR register.
//
//*****************************************************************************
#define TIMER_TBMR_TBPLO                                                       \
  0x00000800 // GPTM Timer B PWM Legacy
             // Operation
#define TIMER_TBMR_TBMRSU                                                      \
  0x00000400 // GPTM Timer B Match Register
             // Update
#define TIMER_TBMR_TBPWMIE                                                     \
  0x00000200                          // GPTM Timer B PWM Interrupt
                                      // Enable
#define TIMER_TBMR_TBILD 0x00000100   // GPTM Timer B Interval Load Write
#define TIMER_TBMR_TBSNAPS 0x00000080 // GPTM Timer B Snap-Shot Mode
#define TIMER_TBMR_TBWOT 0x00000040   // GPTM Timer B Wait-on-Trigger
#define TIMER_TBMR_TBMIE                                                       \
  0x00000020                         // GPTM Timer B Match Interrupt
                                     // Enable
#define TIMER_TBMR_TBCDIR 0x00000010 // GPTM Timer B Count Direction
#define TIMER_TBMR_TBAMS                                                       \
  0x00000008                              // GPTM Timer B Alternate Mode
                                          // Select
#define TIMER_TBMR_TBCMR 0x00000004       // GPTM Timer B Capture Mode
#define TIMER_TBMR_TBMR_M 0x00000003      // GPTM Timer B Mode
#define TIMER_TBMR_TBMR_1_SHOT 0x00000001 // One-Shot Timer mode
#define TIMER_TBMR_TBMR_PERIOD 0x00000002 // Periodic Timer mode
#define TIMER_TBMR_TBMR_CAP 0x00000003    // Capture mode

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_CTL register.
//
//*****************************************************************************
#define TIMER_CTL_TBPWML 0x00004000 // GPTM Timer B PWM Output Level
#define TIMER_CTL_TBOTE                                                        \
  0x00002000                              // GPTM Timer B Output Trigger
                                          // Enable
#define TIMER_CTL_TBEVENT_M 0x00000C00    // GPTM Timer B Event Mode
#define TIMER_CTL_TBEVENT_POS 0x00000000  // Positive edge
#define TIMER_CTL_TBEVENT_NEG 0x00000400  // Negative edge
#define TIMER_CTL_TBEVENT_BOTH 0x00000C00 // Both edges
#define TIMER_CTL_TBSTALL 0x00000200      // GPTM Timer B Stall Enable
#define TIMER_CTL_TBEN 0x00000100         // GPTM Timer B Enable
#define TIMER_CTL_TAPWML 0x00000040       // GPTM Timer A PWM Output Level
#define TIMER_CTL_TAOTE                                                        \
  0x00000020                              // GPTM Timer A Output Trigger
                                          // Enable
#define TIMER_CTL_RTCEN 0x00000010        // GPTM RTC Stall Enable
#define TIMER_CTL_TAEVENT_M 0x0000000C    // GPTM Timer A Event Mode
#define TIMER_CTL_TAEVENT_POS 0x00000000  // Positive edge
#define TIMER_CTL_TAEVENT_NEG 0x00000004  // Negative edge
#define TIMER_CTL_TAEVENT_BOTH 0x0000000C // Both edges
#define TIMER_CTL_TASTALL 0x00000002      // GPTM Timer A Stall Enable
#define TIMER_CTL_TAEN 0x00000001         // GPTM Timer A Enable

