sethbrad/CprE288-Lab9/REF_tm4c123gh6pm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_SYNC register.
//
//*****************************************************************************
#define TIMER_SYNC_SYNCWT5_M                                                   \
  0x00C00000 // Synchronize GPTM 32/64-Bit Timer
             // 5
#define TIMER_SYNC_SYNCWT5_NONE                                                \
  0x00000000 // GPTM 32/64-Bit Timer 5 is not
             // affected
#define TIMER_SYNC_SYNCWT5_TA                                                  \
  0x00400000 // A timeout event for Timer A of
             // GPTM 32/64-Bit Timer 5 is
             // triggered
#define TIMER_SYNC_SYNCWT5_TB                                                  \
  0x00800000 // A timeout event for Timer B of
             // GPTM 32/64-Bit Timer 5 is
             // triggered
#define TIMER_SYNC_SYNCWT5_TATB                                                \
  0x00C00000 // A timeout event for both Timer A
             // and Timer B of GPTM 32/64-Bit
             // Timer 5 is triggered
#define TIMER_SYNC_SYNCWT4_M                                                   \
  0x00300000 // Synchronize GPTM 32/64-Bit Timer
             // 4
#define TIMER_SYNC_SYNCWT4_NONE                                                \
  0x00000000 // GPTM 32/64-Bit Timer 4 is not
             // affected
#define TIMER_SYNC_SYNCWT4_TA                                                  \
  0x00100000 // A timeout event for Timer A of
             // GPTM 32/64-Bit Timer 4 is
             // triggered
#define TIMER_SYNC_SYNCWT4_TB                                                  \
  0x00200000 // A timeout event for Timer B of
             // GPTM 32/64-Bit Timer 4 is
             // triggered
#define TIMER_SYNC_SYNCWT4_TATB                                                \
  0x00300000 // A timeout event for both Timer A
             // and Timer B of GPTM 32/64-Bit
             // Timer 4 is triggered
#define TIMER_SYNC_SYNCWT3_M                                                   \
  0x000C0000 // Synchronize GPTM 32/64-Bit Timer
             // 3
#define TIMER_SYNC_SYNCWT3_NONE                                                \
  0x00000000 // GPTM 32/64-Bit Timer 3 is not
             // affected
#define TIMER_SYNC_SYNCWT3_TA                                                  \
  0x00040000 // A timeout event for Timer A of
             // GPTM 32/64-Bit Timer 3 is
             // triggered
#define TIMER_SYNC_SYNCWT3_TB                                                  \
  0x00080000 // A timeout event for Timer B of
             // GPTM 32/64-Bit Timer 3 is
             // triggered
#define TIMER_SYNC_SYNCWT3_TATB                                                \
  0x000C0000 // A timeout event for both Timer A
             // and Timer B of GPTM 32/64-Bit
             // Timer 3 is triggered
#define TIMER_SYNC_SYNCWT2_M                                                   \
  0x00030000 // Synchronize GPTM 32/64-Bit Timer
             // 2
#define TIMER_SYNC_SYNCWT2_NONE                                                \
  0x00000000 // GPTM 32/64-Bit Timer 2 is not
             // affected
#define TIMER_SYNC_SYNCWT2_TA                                                  \
  0x00010000 // A timeout event for Timer A of
             // GPTM 32/64-Bit Timer 2 is
             // triggered
#define TIMER_SYNC_SYNCWT2_TB                                                  \
  0x00020000 // A timeout event for Timer B of
             // GPTM 32/64-Bit Timer 2 is
             // triggered
#define TIMER_SYNC_SYNCWT2_TATB                                                \
  0x00030000 // A timeout event for both Timer A
             // and Timer B of GPTM 32/64-Bit
             // Timer 2 is triggered
#define TIMER_SYNC_SYNCWT1_M                                                   \
  0x0000C000 // Synchronize GPTM 32/64-Bit Timer
             // 1
#define TIMER_SYNC_SYNCWT1_NONE                                                \
  0x00000000 // GPTM 32/64-Bit Timer 1 is not
             // affected
#define TIMER_SYNC_SYNCWT1_TA                                                  \
  0x00004000 // A timeout event for Timer A of
             // GPTM 32/64-Bit Timer 1 is
             // triggered
#define TIMER_SYNC_SYNCWT1_TB                                                  \
  0x00008000 // A timeout event for Timer B of
             // GPTM 32/64-Bit Timer 1 is
             // triggered
#define TIMER_SYNC_SYNCWT1_TATB                                                \
  0x0000C000 // A timeout event for both Timer A
             // and Timer B of GPTM 32/64-Bit
             // Timer 1 is triggered
#define TIMER_SYNC_SYNCWT0_M                                                   \
  0x00003000 // Synchronize GPTM 32/64-Bit Timer
             // 0
#define TIMER_SYNC_SYNCWT0_NONE                                                \
  0x00000000 // GPTM 32/64-Bit Timer 0 is not
             // affected
#define TIMER_SYNC_SYNCWT0_TA                                                  \
  0x00001000 // A timeout event for Timer A of
             // GPTM 32/64-Bit Timer 0 is
             // triggered
#define TIMER_SYNC_SYNCWT0_TB                                                  \
  0x00002000 // A timeout event for Timer B of
             // GPTM 32/64-Bit Timer 0 is
             // triggered
#define TIMER_SYNC_SYNCWT0_TATB                                                \
  0x00003000 // A timeout event for both Timer A
             // and Timer B of GPTM 32/64-Bit
             // Timer 0 is triggered
#define TIMER_SYNC_SYNCT5_M                                                    \
  0x00000C00 // Synchronize GPTM 16/32-Bit Timer
             // 5
#define TIMER_SYNC_SYNCT5_NONE                                                 \
  0x00000000 // GPTM 16/32-Bit Timer 5 is not
             // affected
#define TIMER_SYNC_SYNCT5_TA                                                   \
  0x00000400 // A timeout event for Timer A of
             // GPTM 16/32-Bit Timer 5 is
             // triggered
#define TIMER_SYNC_SYNCT5_TB                                                   \
  0x00000800 // A timeout event for Timer B of
             // GPTM 16/32-Bit Timer 5 is
             // triggered
#define TIMER_SYNC_SYNCT5_TATB                                                 \
  0x00000C00 // A timeout event for both Timer A
             // and Timer B of GPTM 16/32-Bit
             // Timer 5 is triggered
#define TIMER_SYNC_SYNCT4_M                                                    \
  0x00000300 // Synchronize GPTM 16/32-Bit Timer
             // 4
#define TIMER_SYNC_SYNCT4_NONE                                                 \
  0x00000000 // GPTM 16/32-Bit Timer 4 is not
             // affected
#define TIMER_SYNC_SYNCT4_TA                                                   \
  0x00000100 // A timeout event for Timer A of
             // GPTM 16/32-Bit Timer 4 is
             // triggered
#define TIMER_SYNC_SYNCT4_TB                                                   \
  0x00000200 // A timeout event for Timer B of
             // GPTM 16/32-Bit Timer 4 is
             // triggered
#define TIMER_SYNC_SYNCT4_TATB                                                 \
  0x00000300 // A timeout event for both Timer A
             // and Timer B of GPTM 16/32-Bit
             // Timer 4 is triggered
#define TIMER_SYNC_SYNCT3_M                                                    \
  0x000000C0 // Synchronize GPTM 16/32-Bit Timer
             // 3
#define TIMER_SYNC_SYNCT3_NONE                                                 \
  0x00000000 // GPTM 16/32-Bit Timer 3 is not
             // affected
#define TIMER_SYNC_SYNCT3_TA                                                   \
  0x00000040 // A timeout event for Timer A of
             // GPTM 16/32-Bit Timer 3 is
             // triggered
#define TIMER_SYNC_SYNCT3_TB                                                   \
  0x00000080 // A timeout event for Timer B of
             // GPTM 16/32-Bit Timer 3 is
             // triggered
#define TIMER_SYNC_SYNCT3_TATB                                                 \
  0x000000C0 // A timeout event for both Timer A
             // and Timer B of GPTM 16/32-Bit
             // Timer 3 is triggered
#define TIMER_SYNC_SYNCT2_M                                                    \
  0x00000030 // Synchronize GPTM 16/32-Bit Timer
             // 2
#define TIMER_SYNC_SYNCT2_NONE                                                 \
  0x00000000 // GPTM 16/32-Bit Timer 2 is not
             // affected
#define TIMER_SYNC_SYNCT2_TA                                                   \
  0x00000010 // A timeout event for Timer A of
             // GPTM 16/32-Bit Timer 2 is
             // triggered
#define TIMER_SYNC_SYNCT2_TB                                                   \
  0x00000020 // A timeout event for Timer B of
             // GPTM 16/32-Bit Timer 2 is
             // triggered
#define TIMER_SYNC_SYNCT2_TATB                                                 \
  0x00000030 // A timeout event for both Timer A
             // and Timer B of GPTM 16/32-Bit
             // Timer 2 is triggered
#define TIMER_SYNC_SYNCT1_M                                                    \
  0x0000000C // Synchronize GPTM 16/32-Bit Timer
             // 1
#define TIMER_SYNC_SYNCT1_NONE                                                 \
  0x00000000 // GPTM 16/32-Bit Timer 1 is not
             // affected
#define TIMER_SYNC_SYNCT1_TA                                                   \
  0x00000004 // A timeout event for Timer A of
             // GPTM 16/32-Bit Timer 1 is
             // triggered
#define TIMER_SYNC_SYNCT1_TB                                                   \
  0x00000008 // A timeout event for Timer B of
             // GPTM 16/32-Bit Timer 1 is
             // triggered
#define TIMER_SYNC_SYNCT1_TATB                                                 \
  0x0000000C // A timeout event for both Timer A
             // and Timer B of GPTM 16/32-Bit
             // Timer 1 is triggered
#define TIMER_SYNC_SYNCT0_M                                                    \
  0x00000003 // Synchronize GPTM 16/32-Bit Timer
             // 0
#define TIMER_SYNC_SYNCT0_NONE                                                 \
  0x00000000 // GPTM 16/32-Bit Timer 0 is not
             // affected
#define TIMER_SYNC_SYNCT0_TA                                                   \
  0x00000001 // A timeout event for Timer A of
             // GPTM 16/32-Bit Timer 0 is
             // triggered
#define TIMER_SYNC_SYNCT0_TB                                                   \
  0x00000002 // A timeout event for Timer B of
             // GPTM 16/32-Bit Timer 0 is
             // triggered
#define TIMER_SYNC_SYNCT0_TATB                                                 \
  0x00000003 // A timeout event for both Timer A
             // and Timer B of GPTM 16/32-Bit
             // Timer 0 is triggered

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_IMR register.
//
//*****************************************************************************
#define TIMER_IMR_WUEIM                                                        \
  0x00010000 // GPTM Write Update Error
             // Interrupt Mask
#define TIMER_IMR_TBMIM                                                        \
  0x00000800 // GPTM Timer B Match Interrupt
             // Mask
#define TIMER_IMR_CBEIM                                                        \
  0x00000400 // GPTM Timer B Capture Mode Event
             // Interrupt Mask
#define TIMER_IMR_CBMIM                                                        \
  0x00000200 // GPTM Timer B Capture Mode Match
             // Interrupt Mask
#define TIMER_IMR_TBTOIM                                                       \
  0x00000100 // GPTM Timer B Time-Out Interrupt
             // Mask
#define TIMER_IMR_TAMIM                                                        \
  0x00000010                       // GPTM Timer A Match Interrupt
                                   // Mask
#define TIMER_IMR_RTCIM 0x00000008 // GPTM RTC Interrupt Mask
#define TIMER_IMR_CAEIM                                                        \
  0x00000004 // GPTM Timer A Capture Mode Event
             // Interrupt Mask
#define TIMER_IMR_CAMIM                                                        \
  0x00000002 // GPTM Timer A Capture Mode Match
             // Interrupt Mask
#define TIMER_IMR_TATOIM                                                       \
  0x00000001 // GPTM Timer A Time-Out Interrupt
             // Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_RIS register.
//
//*****************************************************************************
#define TIMER_RIS_WUERIS                                                       \
  0x00010000                        // GPTM Write Update Error Raw
                                    // Interrupt
#define TIMER_RIS_TBMRIS 0x00000800 // GPTM Timer B Match Raw Interrupt
#define TIMER_RIS_CBERIS                                                       \
  0x00000400 // GPTM Timer B Capture Mode Event
             // Raw Interrupt
#define TIMER_RIS_CBMRIS                                                       \
  0x00000200 // GPTM Timer B Capture Mode Match
             // Raw Interrupt
#define TIMER_RIS_TBTORIS                                                      \
  0x00000100                        // GPTM Timer B Time-Out Raw
                                    // Interrupt
#define TIMER_RIS_TAMRIS 0x00000010 // GPTM Timer A Match Raw Interrupt
#define TIMER_RIS_RTCRIS 0x00000008 // GPTM RTC Raw Interrupt
#define TIMER_RIS_CAERIS                                                       \
  0x00000004 // GPTM Timer A Capture Mode Event
             // Raw Interrupt
#define TIMER_RIS_CAMRIS                                                       \
  0x00000002 // GPTM Timer A Capture Mode Match
             // Raw Interrupt
#define TIMER_RIS_TATORIS                                                      \
  0x00000001 // GPTM Timer A Time-Out Raw
             // Interrupt

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_MIS register.
//
//*****************************************************************************
#define TIMER_MIS_WUEMIS                                                       \
  0x00010000 // GPTM Write Update Error Masked
             // Interrupt
#define TIMER_MIS_TBMMIS                                                       \
  0x00000800 // GPTM Timer B Match Masked
             // Interrupt
#define TIMER_MIS_CBEMIS                                                       \
  0x00000400 // GPTM Timer B Capture Mode Event
             // Masked Interrupt
#define TIMER_MIS_CBMMIS                                                       \
  0x00000200 // GPTM Timer B Capture Mode Match
             // Masked Interrupt
#define TIMER_MIS_TBTOMIS                                                      \
  0x00000100 // GPTM Timer B Time-Out Masked
             // Interrupt
#define TIMER_MIS_TAMMIS                                                       \
  0x00000010                        // GPTM Timer A Match Masked
                                    // Interrupt
#define TIMER_MIS_RTCMIS 0x00000008 // GPTM RTC Masked Interrupt
#define TIMER_MIS_CAEMIS                                                       \
  0x00000004 // GPTM Timer A Capture Mode Event
             // Masked Interrupt
#define TIMER_MIS_CAMMIS                                                       \
  0x00000002 // GPTM Timer A Capture Mode Match
             // Masked Interrupt
#define TIMER_MIS_TATOMIS                                                      \
  0x00000001 // GPTM Timer A Time-Out Masked
             // Interrupt

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_ICR register.
//
//*****************************************************************************
#define TIMER_ICR_WUECINT                                                      \
  0x00010000 // 32/64-Bit GPTM Write Update
             // Error Interrupt Clear
#define TIMER_ICR_TBMCINT                                                      \
  0x00000800 // GPTM Timer B Match Interrupt
             // Clear
#define TIMER_ICR_CBECINT                                                      \
  0x00000400 // GPTM Timer B Capture Mode Event
             // Interrupt Clear
#define TIMER_ICR_CBMCINT                                                      \
  0x00000200 // GPTM Timer B Capture Mode Match
             // Interrupt Clear
#define TIMER_ICR_TBTOCINT                                                     \
  0x00000100 // GPTM Timer B Time-Out Interrupt
             // Clear
#define TIMER_ICR_TAMCINT                                                      \
  0x00000010                         // GPTM Timer A Match Interrupt
                                     // Clear
#define TIMER_ICR_RTCCINT 0x00000008 // GPTM RTC Interrupt Clear
#define TIMER_ICR_CAECINT                                                      \
  0x00000004 // GPTM Timer A Capture Mode Event
             // Interrupt Clear
#define TIMER_ICR_CAMCINT                                                      \
  0x00000002 // GPTM Timer A Capture Mode Match
             // Interrupt Clear
#define TIMER_ICR_TATOCINT                                                     \
  0x00000001 // GPTM Timer A Time-Out Raw
             // Interrupt

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TAILR register.
//
//*****************************************************************************
#define TIMER_TAILR_M                                                          \
  0xFFFFFFFF // GPTM Timer A Interval Load
             // Register
#define TIMER_TAILR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TBILR register.
//
//*****************************************************************************
#define TIMER_TBILR_M                                                          \
  0xFFFFFFFF // GPTM Timer B Interval Load
             // Register
#define TIMER_TBILR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TAMATCHR
// register.
//
//*****************************************************************************
#define TIMER_TAMATCHR_TAMR_M 0xFFFFFFFF // GPTM Timer A Match Register
#define TIMER_TAMATCHR_TAMR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TBMATCHR
// register.
//
//*****************************************************************************
#define TIMER_TBMATCHR_TBMR_M 0xFFFFFFFF // GPTM Timer B Match Register
#define TIMER_TBMATCHR_TBMR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TAPR register.
//
//*****************************************************************************
#define TIMER_TAPR_TAPSRH_M 0x0000FF00 // GPTM Timer A Prescale High Byte
#define TIMER_TAPR_TAPSR_M 0x000000FF  // GPTM Timer A Prescale
#define TIMER_TAPR_TAPSRH_S 8
#define TIMER_TAPR_TAPSR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TBPR register.
//
//*****************************************************************************
#define TIMER_TBPR_TBPSRH_M 0x0000FF00 // GPTM Timer B Prescale High Byte
#define TIMER_TBPR_TBPSR_M 0x000000FF  // GPTM Timer B Prescale
#define TIMER_TBPR_TBPSRH_S 8
#define TIMER_TBPR_TBPSR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TAPMR register.
//
//*****************************************************************************
#define TIMER_TAPMR_TAPSMRH_M                                                  \
  0x0000FF00                            // GPTM Timer A Prescale Match High
                                        // Byte
#define TIMER_TAPMR_TAPSMR_M 0x000000FF // GPTM TimerA Prescale Match
#define TIMER_TAPMR_TAPSMRH_S 8
#define TIMER_TAPMR_TAPSMR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TBPMR register.
//
//*****************************************************************************
#define TIMER_TBPMR_TBPSMRH_M                                                  \
  0x0000FF00                            // GPTM Timer B Prescale Match High
                                        // Byte
#define TIMER_TBPMR_TBPSMR_M 0x000000FF // GPTM TimerB Prescale Match
#define TIMER_TBPMR_TBPSMRH_S 8
#define TIMER_TBPMR_TBPSMR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TAR register.
//
//*****************************************************************************
#define TIMER_TAR_M 0xFFFFFFFF // GPTM Timer A Register
#define TIMER_TAR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TBR register.
//
//*****************************************************************************
#define TIMER_TBR_M 0xFFFFFFFF // GPTM Timer B Register
#define TIMER_TBR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TAV register.
//
//*****************************************************************************
#define TIMER_TAV_M 0xFFFFFFFF // GPTM Timer A Value
#define TIMER_TAV_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TBV register.
//
//*****************************************************************************
#define TIMER_TBV_M 0xFFFFFFFF // GPTM Timer B Value
#define TIMER_TBV_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_RTCPD register.
//
//*****************************************************************************
#define TIMER_RTCPD_RTCPD_M 0x0000FFFF // RTC Predivide Counter Value
#define TIMER_RTCPD_RTCPD_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TAPS register.
//
//*****************************************************************************
#define TIMER_TAPS_PSS_M 0x0000FFFF // GPTM Timer A Prescaler Snapshot
#define TIMER_TAPS_PSS_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TBPS register.
//
//*****************************************************************************
#define TIMER_TBPS_PSS_M 0x0000FFFF // GPTM Timer A Prescaler Value
#define TIMER_TBPS_PSS_S 0

