sethbrad/CprE288-Lab9/REF_tm4c123gh6pm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TAPV register.
//
//*****************************************************************************
#define TIMER_TAPV_PSV_M 0x0000FFFF // GPTM Timer A Prescaler Value
#define TIMER_TAPV_PSV_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_TBPV register.
//
//*****************************************************************************
#define TIMER_TBPV_PSV_M 0x0000FFFF // GPTM Timer B Prescaler Value
#define TIMER_TBPV_PSV_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the TIMER_O_PP register.
//
//*****************************************************************************
#define TIMER_PP_SIZE_M 0x0000000F // Count Size
#define TIMER_PP_SIZE_16                                                       \
  0x00000000 // Timer A and Timer B counters are
             // 16 bits each with an 8-bit
             // prescale counter
#define TIMER_PP_SIZE_32                                                       \
  0x00000001 // Timer A and Timer B counters are
             // 32 bits each with a 16-bit
             // prescale counter

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_ACTSS register.
//
//*****************************************************************************
#define ADC_ACTSS_BUSY 0x00010000  // ADC Busy
#define ADC_ACTSS_ASEN3 0x00000008 // ADC SS3 Enable
#define ADC_ACTSS_ASEN2 0x00000004 // ADC SS2 Enable
#define ADC_ACTSS_ASEN1 0x00000002 // ADC SS1 Enable
#define ADC_ACTSS_ASEN0 0x00000001 // ADC SS0 Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_RIS register.
//
//*****************************************************************************
#define ADC_RIS_INRDC                                                          \
  0x00010000                    // Digital Comparator Raw Interrupt
                                // Status
#define ADC_RIS_INR3 0x00000008 // SS3 Raw Interrupt Status
#define ADC_RIS_INR2 0x00000004 // SS2 Raw Interrupt Status
#define ADC_RIS_INR1 0x00000002 // SS1 Raw Interrupt Status
#define ADC_RIS_INR0 0x00000001 // SS0 Raw Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_IM register.
//
//*****************************************************************************
#define ADC_IM_DCONSS3                                                         \
  0x00080000 // Digital Comparator Interrupt on
             // SS3
#define ADC_IM_DCONSS2                                                         \
  0x00040000 // Digital Comparator Interrupt on
             // SS2
#define ADC_IM_DCONSS1                                                         \
  0x00020000 // Digital Comparator Interrupt on
             // SS1
#define ADC_IM_DCONSS0                                                         \
  0x00010000                    // Digital Comparator Interrupt on
                                // SS0
#define ADC_IM_MASK3 0x00000008 // SS3 Interrupt Mask
#define ADC_IM_MASK2 0x00000004 // SS2 Interrupt Mask
#define ADC_IM_MASK1 0x00000002 // SS1 Interrupt Mask
#define ADC_IM_MASK0 0x00000001 // SS0 Interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_ISC register.
//
//*****************************************************************************
#define ADC_ISC_DCINSS3                                                        \
  0x00080000 // Digital Comparator Interrupt
             // Status on SS3
#define ADC_ISC_DCINSS2                                                        \
  0x00040000 // Digital Comparator Interrupt
             // Status on SS2
#define ADC_ISC_DCINSS1                                                        \
  0x00020000 // Digital Comparator Interrupt
             // Status on SS1
#define ADC_ISC_DCINSS0                                                        \
  0x00010000                   // Digital Comparator Interrupt
                               // Status on SS0
#define ADC_ISC_IN3 0x00000008 // SS3 Interrupt Status and Clear
#define ADC_ISC_IN2 0x00000004 // SS2 Interrupt Status and Clear
#define ADC_ISC_IN1 0x00000002 // SS1 Interrupt Status and Clear
#define ADC_ISC_IN0 0x00000001 // SS0 Interrupt Status and Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_OSTAT register.
//
//*****************************************************************************
#define ADC_OSTAT_OV3 0x00000008 // SS3 FIFO Overflow
#define ADC_OSTAT_OV2 0x00000004 // SS2 FIFO Overflow
#define ADC_OSTAT_OV1 0x00000002 // SS1 FIFO Overflow
#define ADC_OSTAT_OV0 0x00000001 // SS0 FIFO Overflow

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_EMUX register.
//
//*****************************************************************************
#define ADC_EMUX_EM3_M 0x0000F000         // SS3 Trigger Select
#define ADC_EMUX_EM3_PROCESSOR 0x00000000 // Processor (default)
#define ADC_EMUX_EM3_COMP0 0x00001000     // Analog Comparator 0
#define ADC_EMUX_EM3_COMP1 0x00002000     // Analog Comparator 1
#define ADC_EMUX_EM3_EXTERNAL 0x00004000  // External (GPIO PB4)
#define ADC_EMUX_EM3_TIMER 0x00005000     // Timer
#define ADC_EMUX_EM3_PWM0 0x00006000      // PWM0
#define ADC_EMUX_EM3_PWM1 0x00007000      // PWM1
#define ADC_EMUX_EM3_PWM2 0x00008000      // PWM2
#define ADC_EMUX_EM3_PWM3 0x00009000      // PWM3
#define ADC_EMUX_EM3_ALWAYS 0x0000F000    // Always (continuously sample)
#define ADC_EMUX_EM2_M 0x00000F00         // SS2 Trigger Select
#define ADC_EMUX_EM2_PROCESSOR 0x00000000 // Processor (default)
#define ADC_EMUX_EM2_COMP0 0x00000100     // Analog Comparator 0
#define ADC_EMUX_EM2_COMP1 0x00000200     // Analog Comparator 1
#define ADC_EMUX_EM2_EXTERNAL 0x00000400  // External (GPIO PB4)
#define ADC_EMUX_EM2_TIMER 0x00000500     // Timer
#define ADC_EMUX_EM2_PWM0 0x00000600      // PWM0
#define ADC_EMUX_EM2_PWM1 0x00000700      // PWM1
#define ADC_EMUX_EM2_PWM2 0x00000800      // PWM2
#define ADC_EMUX_EM2_PWM3 0x00000900      // PWM3
#define ADC_EMUX_EM2_ALWAYS 0x00000F00    // Always (continuously sample)
#define ADC_EMUX_EM1_M 0x000000F0         // SS1 Trigger Select
#define ADC_EMUX_EM1_PROCESSOR 0x00000000 // Processor (default)
#define ADC_EMUX_EM1_COMP0 0x00000010     // Analog Comparator 0
#define ADC_EMUX_EM1_COMP1 0x00000020     // Analog Comparator 1
#define ADC_EMUX_EM1_EXTERNAL 0x00000040  // External (GPIO PB4)
#define ADC_EMUX_EM1_TIMER 0x00000050     // Timer
#define ADC_EMUX_EM1_PWM0 0x00000060      // PWM0
#define ADC_EMUX_EM1_PWM1 0x00000070      // PWM1
#define ADC_EMUX_EM1_PWM2 0x00000080      // PWM2
#define ADC_EMUX_EM1_PWM3 0x00000090      // PWM3
#define ADC_EMUX_EM1_ALWAYS 0x000000F0    // Always (continuously sample)
#define ADC_EMUX_EM0_M 0x0000000F         // SS0 Trigger Select
#define ADC_EMUX_EM0_PROCESSOR 0x00000000 // Processor (default)
#define ADC_EMUX_EM0_COMP0 0x00000001     // Analog Comparator 0
#define ADC_EMUX_EM0_COMP1 0x00000002     // Analog Comparator 1
#define ADC_EMUX_EM0_EXTERNAL 0x00000004  // External (GPIO PB4)
#define ADC_EMUX_EM0_TIMER 0x00000005     // Timer
#define ADC_EMUX_EM0_PWM0 0x00000006      // PWM0
#define ADC_EMUX_EM0_PWM1 0x00000007      // PWM1
#define ADC_EMUX_EM0_PWM2 0x00000008      // PWM2
#define ADC_EMUX_EM0_PWM3 0x00000009      // PWM3
#define ADC_EMUX_EM0_ALWAYS 0x0000000F    // Always (continuously sample)

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_USTAT register.
//
//*****************************************************************************
#define ADC_USTAT_UV3 0x00000008 // SS3 FIFO Underflow
#define ADC_USTAT_UV2 0x00000004 // SS2 FIFO Underflow
#define ADC_USTAT_UV1 0x00000002 // SS1 FIFO Underflow
#define ADC_USTAT_UV0 0x00000001 // SS0 FIFO Underflow

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_TSSEL register.
//
//*****************************************************************************
#define ADC_TSSEL_PS3_M 0x30000000 // PWM Unit Select
#define ADC_TSSEL_PS3_0 0x00000000 // PWM Unit 0
#define ADC_TSSEL_PS3_1 0x10000000 // PWM Unit 1
#define ADC_TSSEL_PS2_M 0x00300000 // PWM Unit Select
#define ADC_TSSEL_PS2_0 0x00000000 // PWM Unit 0
#define ADC_TSSEL_PS2_1 0x00100000 // PWM Unit 1
#define ADC_TSSEL_PS1_M 0x00003000 // PWM Unit Select
#define ADC_TSSEL_PS1_0 0x00000000 // PWM Unit 0
#define ADC_TSSEL_PS1_1 0x00001000 // PWM Unit 1
#define ADC_TSSEL_PS0_M 0x00000030 // PWM Unit Select
#define ADC_TSSEL_PS0_0 0x00000000 // PWM Unit 0
#define ADC_TSSEL_PS0_1 0x00000010 // PWM Unit 1

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSPRI register.
//
//*****************************************************************************
#define ADC_SSPRI_SS3_M 0x00003000 // SS3 Priority
#define ADC_SSPRI_SS2_M 0x00000300 // SS2 Priority
#define ADC_SSPRI_SS1_M 0x00000030 // SS1 Priority
#define ADC_SSPRI_SS0_M 0x00000003 // SS0 Priority

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SPC register.
//
//*****************************************************************************
#define ADC_SPC_PHASE_M 0x0000000F     // Phase Difference
#define ADC_SPC_PHASE_0 0x00000000     // ADC sample lags by 0.0
#define ADC_SPC_PHASE_22_5 0x00000001  // ADC sample lags by 22.5
#define ADC_SPC_PHASE_45 0x00000002    // ADC sample lags by 45.0
#define ADC_SPC_PHASE_67_5 0x00000003  // ADC sample lags by 67.5
#define ADC_SPC_PHASE_90 0x00000004    // ADC sample lags by 90.0
#define ADC_SPC_PHASE_112_5 0x00000005 // ADC sample lags by 112.5
#define ADC_SPC_PHASE_135 0x00000006   // ADC sample lags by 135.0
#define ADC_SPC_PHASE_157_5 0x00000007 // ADC sample lags by 157.5
#define ADC_SPC_PHASE_180 0x00000008   // ADC sample lags by 180.0
#define ADC_SPC_PHASE_202_5 0x00000009 // ADC sample lags by 202.5
#define ADC_SPC_PHASE_225 0x0000000A   // ADC sample lags by 225.0
#define ADC_SPC_PHASE_247_5 0x0000000B // ADC sample lags by 247.5
#define ADC_SPC_PHASE_270 0x0000000C   // ADC sample lags by 270.0
#define ADC_SPC_PHASE_292_5 0x0000000D // ADC sample lags by 292.5
#define ADC_SPC_PHASE_315 0x0000000E   // ADC sample lags by 315.0
#define ADC_SPC_PHASE_337_5 0x0000000F // ADC sample lags by 337.5

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_PSSI register.
//
//*****************************************************************************
#define ADC_PSSI_GSYNC 0x80000000    // Global Synchronize
#define ADC_PSSI_SYNCWAIT 0x08000000 // Synchronize Wait
#define ADC_PSSI_SS3 0x00000008      // SS3 Initiate
#define ADC_PSSI_SS2 0x00000004      // SS2 Initiate
#define ADC_PSSI_SS1 0x00000002      // SS1 Initiate
#define ADC_PSSI_SS0 0x00000001      // SS0 Initiate

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SAC register.
//
//*****************************************************************************
#define ADC_SAC_AVG_M 0x00000007   // Hardware Averaging Control
#define ADC_SAC_AVG_OFF 0x00000000 // No hardware oversampling
#define ADC_SAC_AVG_2X 0x00000001  // 2x hardware oversampling
#define ADC_SAC_AVG_4X 0x00000002  // 4x hardware oversampling
#define ADC_SAC_AVG_8X 0x00000003  // 8x hardware oversampling
#define ADC_SAC_AVG_16X 0x00000004 // 16x hardware oversampling
#define ADC_SAC_AVG_32X 0x00000005 // 32x hardware oversampling
#define ADC_SAC_AVG_64X 0x00000006 // 64x hardware oversampling

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_DCISC register.
//
//*****************************************************************************
#define ADC_DCISC_DCINT7                                                       \
  0x00000080 // Digital Comparator 7 Interrupt
             // Status and Clear
#define ADC_DCISC_DCINT6                                                       \
  0x00000040 // Digital Comparator 6 Interrupt
             // Status and Clear
#define ADC_DCISC_DCINT5                                                       \
  0x00000020 // Digital Comparator 5 Interrupt
             // Status and Clear
#define ADC_DCISC_DCINT4                                                       \
  0x00000010 // Digital Comparator 4 Interrupt
             // Status and Clear
#define ADC_DCISC_DCINT3                                                       \
  0x00000008 // Digital Comparator 3 Interrupt
             // Status and Clear
#define ADC_DCISC_DCINT2                                                       \
  0x00000004 // Digital Comparator 2 Interrupt
             // Status and Clear
#define ADC_DCISC_DCINT1                                                       \
  0x00000002 // Digital Comparator 1 Interrupt
             // Status and Clear
#define ADC_DCISC_DCINT0                                                       \
  0x00000001 // Digital Comparator 0 Interrupt
             // Status and Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_CTL register.
//
//*****************************************************************************
#define ADC_CTL_DITHER 0x00000040 // Dither Mode Enable
#define ADC_CTL_VREF_M 0x00000003 // Voltage Reference Select
#define ADC_CTL_VREF_INTERNAL                                                  \
  0x00000000 // The internal reference as the
             // voltage reference

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSMUX0 register.
//
//*****************************************************************************
#define ADC_SSMUX0_MUX7_M 0xF0000000 // 8th Sample Input Select
#define ADC_SSMUX0_MUX6_M 0x0F000000 // 7th Sample Input Select
#define ADC_SSMUX0_MUX5_M 0x00F00000 // 6th Sample Input Select
#define ADC_SSMUX0_MUX4_M 0x000F0000 // 5th Sample Input Select
#define ADC_SSMUX0_MUX3_M 0x0000F000 // 4th Sample Input Select
#define ADC_SSMUX0_MUX2_M 0x00000F00 // 3rd Sample Input Select
#define ADC_SSMUX0_MUX1_M 0x000000F0 // 2nd Sample Input Select
#define ADC_SSMUX0_MUX0_M 0x0000000F // 1st Sample Input Select
#define ADC_SSMUX0_MUX7_S 28
#define ADC_SSMUX0_MUX6_S 24
#define ADC_SSMUX0_MUX5_S 20
#define ADC_SSMUX0_MUX4_S 16
#define ADC_SSMUX0_MUX3_S 12
#define ADC_SSMUX0_MUX2_S 8
#define ADC_SSMUX0_MUX1_S 4
#define ADC_SSMUX0_MUX0_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSCTL0 register.
//
//*****************************************************************************
#define ADC_SSCTL0_TS7 0x80000000  // 8th Sample Temp Sensor Select
#define ADC_SSCTL0_IE7 0x40000000  // 8th Sample Interrupt Enable
#define ADC_SSCTL0_END7 0x20000000 // 8th Sample is End of Sequence
#define ADC_SSCTL0_D7 0x10000000   // 8th Sample Diff Input Select
#define ADC_SSCTL0_TS6 0x08000000  // 7th Sample Temp Sensor Select
#define ADC_SSCTL0_IE6 0x04000000  // 7th Sample Interrupt Enable
#define ADC_SSCTL0_END6 0x02000000 // 7th Sample is End of Sequence
#define ADC_SSCTL0_D6 0x01000000   // 7th Sample Diff Input Select
#define ADC_SSCTL0_TS5 0x00800000  // 6th Sample Temp Sensor Select
#define ADC_SSCTL0_IE5 0x00400000  // 6th Sample Interrupt Enable
#define ADC_SSCTL0_END5 0x00200000 // 6th Sample is End of Sequence
#define ADC_SSCTL0_D5 0x00100000   // 6th Sample Diff Input Select
#define ADC_SSCTL0_TS4 0x00080000  // 5th Sample Temp Sensor Select
#define ADC_SSCTL0_IE4 0x00040000  // 5th Sample Interrupt Enable
#define ADC_SSCTL0_END4 0x00020000 // 5th Sample is End of Sequence
#define ADC_SSCTL0_D4 0x00010000   // 5th Sample Diff Input Select
#define ADC_SSCTL0_TS3 0x00008000  // 4th Sample Temp Sensor Select
#define ADC_SSCTL0_IE3 0x00004000  // 4th Sample Interrupt Enable
#define ADC_SSCTL0_END3 0x00002000 // 4th Sample is End of Sequence
#define ADC_SSCTL0_D3 0x00001000   // 4th Sample Diff Input Select
#define ADC_SSCTL0_TS2 0x00000800  // 3rd Sample Temp Sensor Select
#define ADC_SSCTL0_IE2 0x00000400  // 3rd Sample Interrupt Enable
#define ADC_SSCTL0_END2 0x00000200 // 3rd Sample is End of Sequence
#define ADC_SSCTL0_D2 0x00000100   // 3rd Sample Diff Input Select
#define ADC_SSCTL0_TS1 0x00000080  // 2nd Sample Temp Sensor Select
#define ADC_SSCTL0_IE1 0x00000040  // 2nd Sample Interrupt Enable
#define ADC_SSCTL0_END1 0x00000020 // 2nd Sample is End of Sequence
#define ADC_SSCTL0_D1 0x00000010   // 2nd Sample Diff Input Select
#define ADC_SSCTL0_TS0 0x00000008  // 1st Sample Temp Sensor Select
#define ADC_SSCTL0_IE0 0x00000004  // 1st Sample Interrupt Enable
#define ADC_SSCTL0_END0 0x00000002 // 1st Sample is End of Sequence
#define ADC_SSCTL0_D0 0x00000001   // 1st Sample Diff Input Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSFIFO0 register.
//
//*****************************************************************************
#define ADC_SSFIFO0_DATA_M 0x00000FFF // Conversion Result Data
#define ADC_SSFIFO0_DATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSFSTAT0 register.
//
//*****************************************************************************
#define ADC_SSFSTAT0_FULL 0x00001000   // FIFO Full
#define ADC_SSFSTAT0_EMPTY 0x00000100  // FIFO Empty
#define ADC_SSFSTAT0_HPTR_M 0x000000F0 // FIFO Head Pointer
#define ADC_SSFSTAT0_TPTR_M 0x0000000F // FIFO Tail Pointer
#define ADC_SSFSTAT0_HPTR_S 4
#define ADC_SSFSTAT0_TPTR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSOP0 register.
//
//*****************************************************************************
#define ADC_SSOP0_S7DCOP                                                       \
  0x10000000 // Sample 7 Digital Comparator
             // Operation
#define ADC_SSOP0_S6DCOP                                                       \
  0x01000000 // Sample 6 Digital Comparator
             // Operation
#define ADC_SSOP0_S5DCOP                                                       \
  0x00100000 // Sample 5 Digital Comparator
             // Operation
#define ADC_SSOP0_S4DCOP                                                       \
  0x00010000 // Sample 4 Digital Comparator
             // Operation
#define ADC_SSOP0_S3DCOP                                                       \
  0x00001000 // Sample 3 Digital Comparator
             // Operation
#define ADC_SSOP0_S2DCOP                                                       \
  0x00000100 // Sample 2 Digital Comparator
             // Operation
#define ADC_SSOP0_S1DCOP                                                       \
  0x00000010 // Sample 1 Digital Comparator
             // Operation
#define ADC_SSOP0_S0DCOP                                                       \
  0x00000001 // Sample 0 Digital Comparator
             // Operation

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSDC0 register.
//
//*****************************************************************************
#define ADC_SSDC0_S7DCSEL_M                                                    \
  0xF0000000 // Sample 7 Digital Comparator
             // Select
#define ADC_SSDC0_S6DCSEL_M                                                    \
  0x0F000000 // Sample 6 Digital Comparator
             // Select
#define ADC_SSDC0_S5DCSEL_M                                                    \
  0x00F00000 // Sample 5 Digital Comparator
             // Select
#define ADC_SSDC0_S4DCSEL_M                                                    \
  0x000F0000 // Sample 4 Digital Comparator
             // Select
#define ADC_SSDC0_S3DCSEL_M                                                    \
  0x0000F000 // Sample 3 Digital Comparator
             // Select
#define ADC_SSDC0_S2DCSEL_M                                                    \
  0x00000F00 // Sample 2 Digital Comparator
             // Select
#define ADC_SSDC0_S1DCSEL_M                                                    \
  0x000000F0 // Sample 1 Digital Comparator
             // Select
#define ADC_SSDC0_S0DCSEL_M                                                    \
  0x0000000F // Sample 0 Digital Comparator
             // Select
#define ADC_SSDC0_S6DCSEL_S 24
#define ADC_SSDC0_S5DCSEL_S 20
#define ADC_SSDC0_S4DCSEL_S 16
#define ADC_SSDC0_S3DCSEL_S 12
#define ADC_SSDC0_S2DCSEL_S 8
#define ADC_SSDC0_S1DCSEL_S 4
#define ADC_SSDC0_S0DCSEL_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSMUX1 register.
//
//*****************************************************************************
#define ADC_SSMUX1_MUX3_M 0x0000F000 // 4th Sample Input Select
#define ADC_SSMUX1_MUX2_M 0x00000F00 // 3rd Sample Input Select
#define ADC_SSMUX1_MUX1_M 0x000000F0 // 2nd Sample Input Select
#define ADC_SSMUX1_MUX0_M 0x0000000F // 1st Sample Input Select
#define ADC_SSMUX1_MUX3_S 12
#define ADC_SSMUX1_MUX2_S 8
#define ADC_SSMUX1_MUX1_S 4
#define ADC_SSMUX1_MUX0_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_SSCTL1 register.
//
//*****************************************************************************
#define ADC_SSCTL1_TS3 0x00008000  // 4th Sample Temp Sensor Select
#define ADC_SSCTL1_IE3 0x00004000  // 4th Sample Interrupt Enable
#define ADC_SSCTL1_END3 0x00002000 // 4th Sample is End of Sequence
#define ADC_SSCTL1_D3 0x00001000   // 4th Sample Diff Input Select
#define ADC_SSCTL1_TS2 0x00000800  // 3rd Sample Temp Sensor Select
#define ADC_SSCTL1_IE2 0x00000400  // 3rd Sample Interrupt Enable
#define ADC_SSCTL1_END2 0x00000200 // 3rd Sample is End of Sequence
#define ADC_SSCTL1_D2 0x00000100   // 3rd Sample Diff Input Select
#define ADC_SSCTL1_TS1 0x00000080  // 2nd Sample Temp Sensor Select
#define ADC_SSCTL1_IE1 0x00000040  // 2nd Sample Interrupt Enable
#define ADC_SSCTL1_END1 0x00000020 // 2nd Sample is End of Sequence
#define ADC_SSCTL1_D1 0x00000010   // 2nd Sample Diff Input Select
#define ADC_SSCTL1_TS0 0x00000008  // 1st Sample Temp Sensor Select
#define ADC_SSCTL1_IE0 0x00000004  // 1st Sample Interrupt Enable
#define ADC_SSCTL1_END0 0x00000002 // 1st Sample is End of Sequence
#define ADC_SSCTL1_D0 0x00000001   // 1st Sample Diff Input Select

