sethbrad/CprE288-Lab9/REF_tm4c123gh6pm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_DCCMP3 register.
//
//*****************************************************************************
#define ADC_DCCMP3_COMP1_M 0x0FFF0000 // Compare 1
#define ADC_DCCMP3_COMP0_M 0x00000FFF // Compare 0
#define ADC_DCCMP3_COMP1_S 16
#define ADC_DCCMP3_COMP0_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_DCCMP4 register.
//
//*****************************************************************************
#define ADC_DCCMP4_COMP1_M 0x0FFF0000 // Compare 1
#define ADC_DCCMP4_COMP0_M 0x00000FFF // Compare 0
#define ADC_DCCMP4_COMP1_S 16
#define ADC_DCCMP4_COMP0_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_DCCMP5 register.
//
//*****************************************************************************
#define ADC_DCCMP5_COMP1_M 0x0FFF0000 // Compare 1
#define ADC_DCCMP5_COMP0_M 0x00000FFF // Compare 0
#define ADC_DCCMP5_COMP1_S 16
#define ADC_DCCMP5_COMP0_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_DCCMP6 register.
//
//*****************************************************************************
#define ADC_DCCMP6_COMP1_M 0x0FFF0000 // Compare 1
#define ADC_DCCMP6_COMP0_M 0x00000FFF // Compare 0
#define ADC_DCCMP6_COMP1_S 16
#define ADC_DCCMP6_COMP0_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_DCCMP7 register.
//
//*****************************************************************************
#define ADC_DCCMP7_COMP1_M 0x0FFF0000 // Compare 1
#define ADC_DCCMP7_COMP0_M 0x00000FFF // Compare 0
#define ADC_DCCMP7_COMP1_S 16
#define ADC_DCCMP7_COMP0_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_PP register.
//
//*****************************************************************************
#define ADC_PP_TS 0x00800000       // Temperature Sensor
#define ADC_PP_RSL_M 0x007C0000    // Resolution
#define ADC_PP_TYPE_M 0x00030000   // ADC Architecture
#define ADC_PP_TYPE_SAR 0x00000000 // SAR
#define ADC_PP_DC_M 0x0000FC00     // Digital Comparator Count
#define ADC_PP_CH_M 0x000003F0     // ADC Channel Count
#define ADC_PP_MSR_M 0x0000000F    // Maximum ADC Sample Rate
#define ADC_PP_MSR_125K 0x00000001 // 125 ksps
#define ADC_PP_MSR_250K 0x00000003 // 250 ksps
#define ADC_PP_MSR_500K 0x00000005 // 500 ksps
#define ADC_PP_MSR_1M 0x00000007   // 1 Msps
#define ADC_PP_RSL_S 18
#define ADC_PP_DC_S 10
#define ADC_PP_CH_S 4

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_PC register.
//
//*****************************************************************************
#define ADC_PC_SR_M 0x0000000F    // ADC Sample Rate
#define ADC_PC_SR_125K 0x00000001 // 125 ksps
#define ADC_PC_SR_250K 0x00000003 // 250 ksps
#define ADC_PC_SR_500K 0x00000005 // 500 ksps
#define ADC_PC_SR_1M 0x00000007   // 1 Msps

//*****************************************************************************
//
// The following are defines for the bit fields in the ADC_O_CC register.
//
//*****************************************************************************
#define ADC_CC_CS_M 0x0000000F // ADC Clock Source
#define ADC_CC_CS_SYSPLL                                                       \
  0x00000000                       // Either the system clock (if the
                                   // PLL bypass is in effect) or the
                                   // 16 MHz clock derived from PLL /
                                   // 25 (default)
#define ADC_CC_CS_PIOSC 0x00000001 // PIOSC

//*****************************************************************************
//
// The following are defines for the bit fields in the COMP_O_ACMIS register.
//
//*****************************************************************************
#define COMP_ACMIS_IN1                                                         \
  0x00000002 // Comparator 1 Masked Interrupt
             // Status
#define COMP_ACMIS_IN0                                                         \
  0x00000001 // Comparator 0 Masked Interrupt
             // Status

//*****************************************************************************
//
// The following are defines for the bit fields in the COMP_O_ACRIS register.
//
//*****************************************************************************
#define COMP_ACRIS_IN1 0x00000002 // Comparator 1 Interrupt Status
#define COMP_ACRIS_IN0 0x00000001 // Comparator 0 Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the COMP_O_ACINTEN register.
//
//*****************************************************************************
#define COMP_ACINTEN_IN1 0x00000002 // Comparator 1 Interrupt Enable
#define COMP_ACINTEN_IN0 0x00000001 // Comparator 0 Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the COMP_O_ACREFCTL
// register.
//
//*****************************************************************************
#define COMP_ACREFCTL_EN 0x00000200     // Resistor Ladder Enable
#define COMP_ACREFCTL_RNG 0x00000100    // Resistor Ladder Range
#define COMP_ACREFCTL_VREF_M 0x0000000F // Resistor Ladder Voltage Ref
#define COMP_ACREFCTL_VREF_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the COMP_O_ACSTAT0 register.
//
//*****************************************************************************
#define COMP_ACSTAT0_OVAL 0x00000002 // Comparator Output Value

//*****************************************************************************
//
// The following are defines for the bit fields in the COMP_O_ACCTL0 register.
//
//*****************************************************************************
#define COMP_ACCTL0_TOEN 0x00000800       // Trigger Output Enable
#define COMP_ACCTL0_ASRCP_M 0x00000600    // Analog Source Positive
#define COMP_ACCTL0_ASRCP_PIN 0x00000000  // Pin value of Cn+
#define COMP_ACCTL0_ASRCP_PIN0 0x00000200 // Pin value of C0+
#define COMP_ACCTL0_ASRCP_REF 0x00000400  // Internal voltage reference
#define COMP_ACCTL0_TSLVAL 0x00000080     // Trigger Sense Level Value
#define COMP_ACCTL0_TSEN_M 0x00000060     // Trigger Sense
#define COMP_ACCTL0_TSEN_LEVEL 0x00000000 // Level sense, see TSLVAL
#define COMP_ACCTL0_TSEN_FALL 0x00000020  // Falling edge
#define COMP_ACCTL0_TSEN_RISE 0x00000040  // Rising edge
#define COMP_ACCTL0_TSEN_BOTH 0x00000060  // Either edge
#define COMP_ACCTL0_ISLVAL 0x00000010     // Interrupt Sense Level Value
#define COMP_ACCTL0_ISEN_M 0x0000000C     // Interrupt Sense
#define COMP_ACCTL0_ISEN_LEVEL 0x00000000 // Level sense, see ISLVAL
#define COMP_ACCTL0_ISEN_FALL 0x00000004  // Falling edge
#define COMP_ACCTL0_ISEN_RISE 0x00000008  // Rising edge
#define COMP_ACCTL0_ISEN_BOTH 0x0000000C  // Either edge
#define COMP_ACCTL0_CINV 0x00000002       // Comparator Output Invert

//*****************************************************************************
//
// The following are defines for the bit fields in the COMP_O_ACSTAT1 register.
//
//*****************************************************************************
#define COMP_ACSTAT1_OVAL 0x00000002 // Comparator Output Value

//*****************************************************************************
//
// The following are defines for the bit fields in the COMP_O_ACCTL1 register.
//
//*****************************************************************************
#define COMP_ACCTL1_TOEN 0x00000800       // Trigger Output Enable
#define COMP_ACCTL1_ASRCP_M 0x00000600    // Analog Source Positive
#define COMP_ACCTL1_ASRCP_PIN 0x00000000  // Pin value of Cn+
#define COMP_ACCTL1_ASRCP_PIN0 0x00000200 // Pin value of C0+
#define COMP_ACCTL1_ASRCP_REF                                                  \
  0x00000400                              // Internal voltage reference
                                          // (VIREF)
#define COMP_ACCTL1_TSLVAL 0x00000080     // Trigger Sense Level Value
#define COMP_ACCTL1_TSEN_M 0x00000060     // Trigger Sense
#define COMP_ACCTL1_TSEN_LEVEL 0x00000000 // Level sense, see TSLVAL
#define COMP_ACCTL1_TSEN_FALL 0x00000020  // Falling edge
#define COMP_ACCTL1_TSEN_RISE 0x00000040  // Rising edge
#define COMP_ACCTL1_TSEN_BOTH 0x00000060  // Either edge
#define COMP_ACCTL1_ISLVAL 0x00000010     // Interrupt Sense Level Value
#define COMP_ACCTL1_ISEN_M 0x0000000C     // Interrupt Sense
#define COMP_ACCTL1_ISEN_LEVEL 0x00000000 // Level sense, see ISLVAL
#define COMP_ACCTL1_ISEN_FALL 0x00000004  // Falling edge
#define COMP_ACCTL1_ISEN_RISE 0x00000008  // Rising edge
#define COMP_ACCTL1_ISEN_BOTH 0x0000000C  // Either edge
#define COMP_ACCTL1_CINV 0x00000002       // Comparator Output Invert

//*****************************************************************************
//
// The following are defines for the bit fields in the COMP_O_PP register.
//
//*****************************************************************************
#define COMP_PP_C1O 0x00020000  // Comparator Output 1 Present
#define COMP_PP_C0O 0x00010000  // Comparator Output 0 Present
#define COMP_PP_CMP1 0x00000002 // Comparator 1 Present
#define COMP_PP_CMP0 0x00000001 // Comparator 0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_CTL register.
//
//*****************************************************************************
#define CAN_CTL_TEST 0x00000080 // Test Mode Enable
#define CAN_CTL_CCE 0x00000040  // Configuration Change Enable
#define CAN_CTL_DAR 0x00000020  // Disable Automatic-Retransmission
#define CAN_CTL_EIE 0x00000008  // Error Interrupt Enable
#define CAN_CTL_SIE 0x00000004  // Status Interrupt Enable
#define CAN_CTL_IE 0x00000002   // CAN Interrupt Enable
#define CAN_CTL_INIT 0x00000001 // Initialization

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_STS register.
//
//*****************************************************************************
#define CAN_STS_BOFF 0x00000080  // Bus-Off Status
#define CAN_STS_EWARN 0x00000040 // Warning Status
#define CAN_STS_EPASS 0x00000020 // Error Passive
#define CAN_STS_RXOK 0x00000010  // Received a Message Successfully
#define CAN_STS_TXOK                                                           \
  0x00000008                           // Transmitted a Message
                                       // Successfully
#define CAN_STS_LEC_M 0x00000007       // Last Error Code
#define CAN_STS_LEC_NONE 0x00000000    // No Error
#define CAN_STS_LEC_STUFF 0x00000001   // Stuff Error
#define CAN_STS_LEC_FORM 0x00000002    // Format Error
#define CAN_STS_LEC_ACK 0x00000003     // ACK Error
#define CAN_STS_LEC_BIT1 0x00000004    // Bit 1 Error
#define CAN_STS_LEC_BIT0 0x00000005    // Bit 0 Error
#define CAN_STS_LEC_CRC 0x00000006     // CRC Error
#define CAN_STS_LEC_NOEVENT 0x00000007 // No Event

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_ERR register.
//
//*****************************************************************************
#define CAN_ERR_RP 0x00008000    // Received Error Passive
#define CAN_ERR_REC_M 0x00007F00 // Receive Error Counter
#define CAN_ERR_TEC_M 0x000000FF // Transmit Error Counter
#define CAN_ERR_REC_S 8
#define CAN_ERR_TEC_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_BIT register.
//
//*****************************************************************************
#define CAN_BIT_TSEG2_M 0x00007000 // Time Segment after Sample Point
#define CAN_BIT_TSEG1_M 0x00000F00 // Time Segment Before Sample Point
#define CAN_BIT_SJW_M 0x000000C0   // (Re)Synchronization Jump Width
#define CAN_BIT_BRP_M 0x0000003F   // Baud Rate Prescaler
#define CAN_BIT_TSEG2_S 12
#define CAN_BIT_TSEG1_S 8
#define CAN_BIT_SJW_S 6
#define CAN_BIT_BRP_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_INT register.
//
//*****************************************************************************
#define CAN_INT_INTID_M 0x0000FFFF      // Interrupt Identifier
#define CAN_INT_INTID_NONE 0x00000000   // No interrupt pending
#define CAN_INT_INTID_STATUS 0x00008000 // Status Interrupt

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_TST register.
//
//*****************************************************************************
#define CAN_TST_RX 0x00000080           // Receive Observation
#define CAN_TST_TX_M 0x00000060         // Transmit Control
#define CAN_TST_TX_CANCTL 0x00000000    // CAN Module Control
#define CAN_TST_TX_SAMPLE 0x00000020    // Sample Point
#define CAN_TST_TX_DOMINANT 0x00000040  // Driven Low
#define CAN_TST_TX_RECESSIVE 0x00000060 // Driven High
#define CAN_TST_LBACK 0x00000010        // Loopback Mode
#define CAN_TST_SILENT 0x00000008       // Silent Mode
#define CAN_TST_BASIC 0x00000004        // Basic Mode

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_BRPE register.
//
//*****************************************************************************
#define CAN_BRPE_BRPE_M 0x0000000F // Baud Rate Prescaler Extension
#define CAN_BRPE_BRPE_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_IF1CRQ register.
//
//*****************************************************************************
#define CAN_IF1CRQ_BUSY 0x00008000   // Busy Flag
#define CAN_IF1CRQ_MNUM_M 0x0000003F // Message Number
#define CAN_IF1CRQ_MNUM_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_IF1CMSK register.
//
//*****************************************************************************
#define CAN_IF1CMSK_WRNRD 0x00000080     // Write, Not Read
#define CAN_IF1CMSK_MASK 0x00000040      // Access Mask Bits
#define CAN_IF1CMSK_ARB 0x00000020       // Access Arbitration Bits
#define CAN_IF1CMSK_CONTROL 0x00000010   // Access Control Bits
#define CAN_IF1CMSK_CLRINTPND 0x00000008 // Clear Interrupt Pending Bit
#define CAN_IF1CMSK_NEWDAT 0x00000004    // Access New Data
#define CAN_IF1CMSK_TXRQST 0x00000004    // Access Transmission Request
#define CAN_IF1CMSK_DATAA 0x00000002     // Access Data Byte 0 to 3
#define CAN_IF1CMSK_DATAB 0x00000001     // Access Data Byte 4 to 7

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_IF1MSK1 register.
//
//*****************************************************************************
#define CAN_IF1MSK1_IDMSK_M 0x0000FFFF // Identifier Mask
#define CAN_IF1MSK1_IDMSK_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_IF1MSK2 register.
//
//*****************************************************************************
#define CAN_IF1MSK2_MXTD 0x00008000    // Mask Extended Identifier
#define CAN_IF1MSK2_MDIR 0x00004000    // Mask Message Direction
#define CAN_IF1MSK2_IDMSK_M 0x00001FFF // Identifier Mask
#define CAN_IF1MSK2_IDMSK_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_IF1ARB1 register.
//
//*****************************************************************************
#define CAN_IF1ARB1_ID_M 0x0000FFFF // Message Identifier
#define CAN_IF1ARB1_ID_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_IF1ARB2 register.
//
//*****************************************************************************
#define CAN_IF1ARB2_MSGVAL 0x00008000 // Message Valid
#define CAN_IF1ARB2_XTD 0x00004000    // Extended Identifier
#define CAN_IF1ARB2_DIR 0x00002000    // Message Direction
#define CAN_IF1ARB2_ID_M 0x00001FFF   // Message Identifier
#define CAN_IF1ARB2_ID_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_IF1MCTL register.
//
//*****************************************************************************
#define CAN_IF1MCTL_NEWDAT 0x00008000 // New Data
#define CAN_IF1MCTL_MSGLST 0x00004000 // Message Lost
#define CAN_IF1MCTL_INTPND 0x00002000 // Interrupt Pending
#define CAN_IF1MCTL_UMASK 0x00001000  // Use Acceptance Mask
#define CAN_IF1MCTL_TXIE 0x00000800   // Transmit Interrupt Enable
#define CAN_IF1MCTL_RXIE 0x00000400   // Receive Interrupt Enable
#define CAN_IF1MCTL_RMTEN 0x00000200  // Remote Enable
#define CAN_IF1MCTL_TXRQST 0x00000100 // Transmit Request
#define CAN_IF1MCTL_EOB 0x00000080    // End of Buffer
#define CAN_IF1MCTL_DLC_M 0x0000000F  // Data Length Code
#define CAN_IF1MCTL_DLC_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_IF1DA1 register.
//
//*****************************************************************************
#define CAN_IF1DA1_DATA_M 0x0000FFFF // Data
#define CAN_IF1DA1_DATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_IF1DA2 register.
//
//*****************************************************************************
#define CAN_IF1DA2_DATA_M 0x0000FFFF // Data
#define CAN_IF1DA2_DATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_IF1DB1 register.
//
//*****************************************************************************
#define CAN_IF1DB1_DATA_M 0x0000FFFF // Data
#define CAN_IF1DB1_DATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_IF1DB2 register.
//
//*****************************************************************************
#define CAN_IF1DB2_DATA_M 0x0000FFFF // Data
#define CAN_IF1DB2_DATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_IF2CRQ register.
//
//*****************************************************************************
#define CAN_IF2CRQ_BUSY 0x00008000   // Busy Flag
#define CAN_IF2CRQ_MNUM_M 0x0000003F // Message Number
#define CAN_IF2CRQ_MNUM_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_IF2CMSK register.
//
//*****************************************************************************
#define CAN_IF2CMSK_WRNRD 0x00000080     // Write, Not Read
#define CAN_IF2CMSK_MASK 0x00000040      // Access Mask Bits
#define CAN_IF2CMSK_ARB 0x00000020       // Access Arbitration Bits
#define CAN_IF2CMSK_CONTROL 0x00000010   // Access Control Bits
#define CAN_IF2CMSK_CLRINTPND 0x00000008 // Clear Interrupt Pending Bit
#define CAN_IF2CMSK_NEWDAT 0x00000004    // Access New Data
#define CAN_IF2CMSK_TXRQST 0x00000004    // Access Transmission Request
#define CAN_IF2CMSK_DATAA 0x00000002     // Access Data Byte 0 to 3
#define CAN_IF2CMSK_DATAB 0x00000001     // Access Data Byte 4 to 7

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_IF2MSK1 register.
//
//*****************************************************************************
#define CAN_IF2MSK1_IDMSK_M 0x0000FFFF // Identifier Mask
#define CAN_IF2MSK1_IDMSK_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_IF2MSK2 register.
//
//*****************************************************************************
#define CAN_IF2MSK2_MXTD 0x00008000    // Mask Extended Identifier
#define CAN_IF2MSK2_MDIR 0x00004000    // Mask Message Direction
#define CAN_IF2MSK2_IDMSK_M 0x00001FFF // Identifier Mask
#define CAN_IF2MSK2_IDMSK_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_IF2ARB1 register.
//
//*****************************************************************************
#define CAN_IF2ARB1_ID_M 0x0000FFFF // Message Identifier
#define CAN_IF2ARB1_ID_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_IF2ARB2 register.
//
//*****************************************************************************
#define CAN_IF2ARB2_MSGVAL 0x00008000 // Message Valid
#define CAN_IF2ARB2_XTD 0x00004000    // Extended Identifier
#define CAN_IF2ARB2_DIR 0x00002000    // Message Direction
#define CAN_IF2ARB2_ID_M 0x00001FFF   // Message Identifier
#define CAN_IF2ARB2_ID_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_IF2MCTL register.
//
//*****************************************************************************
#define CAN_IF2MCTL_NEWDAT 0x00008000 // New Data
#define CAN_IF2MCTL_MSGLST 0x00004000 // Message Lost
#define CAN_IF2MCTL_INTPND 0x00002000 // Interrupt Pending
#define CAN_IF2MCTL_UMASK 0x00001000  // Use Acceptance Mask
#define CAN_IF2MCTL_TXIE 0x00000800   // Transmit Interrupt Enable
#define CAN_IF2MCTL_RXIE 0x00000400   // Receive Interrupt Enable
#define CAN_IF2MCTL_RMTEN 0x00000200  // Remote Enable
#define CAN_IF2MCTL_TXRQST 0x00000100 // Transmit Request
#define CAN_IF2MCTL_EOB 0x00000080    // End of Buffer
#define CAN_IF2MCTL_DLC_M 0x0000000F  // Data Length Code
#define CAN_IF2MCTL_DLC_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_IF2DA1 register.
//
//*****************************************************************************
#define CAN_IF2DA1_DATA_M 0x0000FFFF // Data
#define CAN_IF2DA1_DATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_IF2DA2 register.
//
//*****************************************************************************
#define CAN_IF2DA2_DATA_M 0x0000FFFF // Data
#define CAN_IF2DA2_DATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the CAN_O_IF2DB1 register.
//
//*****************************************************************************
#define CAN_IF2DB1_DATA_M 0x0000FFFF // Data
#define CAN_IF2DB1_DATA_S 0

