sethbrad/CprE288-Lab9/REF_tm4c123gh6pm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCOUNT6 register.
//
//*****************************************************************************
#define USB_RXCOUNT6_COUNT_M 0x00001FFF // Receive Packet Count
#define USB_RXCOUNT6_COUNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXTYPE6 register.
//
//*****************************************************************************
#define USB_TXTYPE6_SPEED_M 0x000000C0    // Operating Speed
#define USB_TXTYPE6_SPEED_DFLT 0x00000000 // Default
#define USB_TXTYPE6_SPEED_FULL 0x00000080 // Full
#define USB_TXTYPE6_SPEED_LOW 0x000000C0  // Low
#define USB_TXTYPE6_PROTO_M 0x00000030    // Protocol
#define USB_TXTYPE6_PROTO_CTRL 0x00000000 // Control
#define USB_TXTYPE6_PROTO_ISOC 0x00000010 // Isochronous
#define USB_TXTYPE6_PROTO_BULK 0x00000020 // Bulk
#define USB_TXTYPE6_PROTO_INT 0x00000030  // Interrupt
#define USB_TXTYPE6_TEP_M 0x0000000F      // Target Endpoint Number
#define USB_TXTYPE6_TEP_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXINTERVAL6
// register.
//
//*****************************************************************************
#define USB_TXINTERVAL6_TXPOLL_M 0x000000FF // TX Polling
#define USB_TXINTERVAL6_NAKLMT_M 0x000000FF // NAK Limit
#define USB_TXINTERVAL6_TXPOLL_S 0
#define USB_TXINTERVAL6_NAKLMT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXTYPE6 register.
//
//*****************************************************************************
#define USB_RXTYPE6_SPEED_M 0x000000C0    // Operating Speed
#define USB_RXTYPE6_SPEED_DFLT 0x00000000 // Default
#define USB_RXTYPE6_SPEED_FULL 0x00000080 // Full
#define USB_RXTYPE6_SPEED_LOW 0x000000C0  // Low
#define USB_RXTYPE6_PROTO_M 0x00000030    // Protocol
#define USB_RXTYPE6_PROTO_CTRL 0x00000000 // Control
#define USB_RXTYPE6_PROTO_ISOC 0x00000010 // Isochronous
#define USB_RXTYPE6_PROTO_BULK 0x00000020 // Bulk
#define USB_RXTYPE6_PROTO_INT 0x00000030  // Interrupt
#define USB_RXTYPE6_TEP_M 0x0000000F      // Target Endpoint Number
#define USB_RXTYPE6_TEP_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXINTERVAL6
// register.
//
//*****************************************************************************
#define USB_RXINTERVAL6_TXPOLL_M 0x000000FF // RX Polling
#define USB_RXINTERVAL6_NAKLMT_M 0x000000FF // NAK Limit
#define USB_RXINTERVAL6_NAKLMT_S 0
#define USB_RXINTERVAL6_TXPOLL_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXMAXP7 register.
//
//*****************************************************************************
#define USB_TXMAXP7_MAXLOAD_M 0x000007FF // Maximum Payload
#define USB_TXMAXP7_MAXLOAD_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRL7 register.
//
//*****************************************************************************
#define USB_TXCSRL7_NAKTO 0x00000080   // NAK Timeout
#define USB_TXCSRL7_CLRDT 0x00000040   // Clear Data Toggle
#define USB_TXCSRL7_STALLED 0x00000020 // Endpoint Stalled
#define USB_TXCSRL7_STALL 0x00000010   // Send STALL
#define USB_TXCSRL7_SETUP 0x00000010   // Setup Packet
#define USB_TXCSRL7_FLUSH 0x00000008   // Flush FIFO
#define USB_TXCSRL7_ERROR 0x00000004   // Error
#define USB_TXCSRL7_UNDRN 0x00000004   // Underrun
#define USB_TXCSRL7_FIFONE 0x00000002  // FIFO Not Empty
#define USB_TXCSRL7_TXRDY 0x00000001   // Transmit Packet Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRH7 register.
//
//*****************************************************************************
#define USB_TXCSRH7_AUTOSET 0x00000080 // Auto Set
#define USB_TXCSRH7_ISO 0x00000040     // Isochronous Transfers
#define USB_TXCSRH7_MODE 0x00000020    // Mode
#define USB_TXCSRH7_DMAEN 0x00000010   // DMA Request Enable
#define USB_TXCSRH7_FDT 0x00000008     // Force Data Toggle
#define USB_TXCSRH7_DMAMOD 0x00000004  // DMA Request Mode
#define USB_TXCSRH7_DTWE 0x00000002    // Data Toggle Write Enable
#define USB_TXCSRH7_DT 0x00000001      // Data Toggle

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXMAXP7 register.
//
//*****************************************************************************
#define USB_RXMAXP7_MAXLOAD_M 0x000007FF // Maximum Payload
#define USB_RXMAXP7_MAXLOAD_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRL7 register.
//
//*****************************************************************************
#define USB_RXCSRL7_CLRDT 0x00000080   // Clear Data Toggle
#define USB_RXCSRL7_STALLED 0x00000040 // Endpoint Stalled
#define USB_RXCSRL7_REQPKT 0x00000020  // Request Packet
#define USB_RXCSRL7_STALL 0x00000020   // Send STALL
#define USB_RXCSRL7_FLUSH 0x00000010   // Flush FIFO
#define USB_RXCSRL7_DATAERR 0x00000008 // Data Error
#define USB_RXCSRL7_NAKTO 0x00000008   // NAK Timeout
#define USB_RXCSRL7_ERROR 0x00000004   // Error
#define USB_RXCSRL7_OVER 0x00000004    // Overrun
#define USB_RXCSRL7_FULL 0x00000002    // FIFO Full
#define USB_RXCSRL7_RXRDY 0x00000001   // Receive Packet Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRH7 register.
//
//*****************************************************************************
#define USB_RXCSRH7_AUTOCL 0x00000080  // Auto Clear
#define USB_RXCSRH7_ISO 0x00000040     // Isochronous Transfers
#define USB_RXCSRH7_AUTORQ 0x00000040  // Auto Request
#define USB_RXCSRH7_DMAEN 0x00000020   // DMA Request Enable
#define USB_RXCSRH7_PIDERR 0x00000010  // PID Error
#define USB_RXCSRH7_DISNYET 0x00000010 // Disable NYET
#define USB_RXCSRH7_DMAMOD 0x00000008  // DMA Request Mode
#define USB_RXCSRH7_DTWE 0x00000004    // Data Toggle Write Enable
#define USB_RXCSRH7_DT 0x00000002      // Data Toggle

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCOUNT7 register.
//
//*****************************************************************************
#define USB_RXCOUNT7_COUNT_M 0x00001FFF // Receive Packet Count
#define USB_RXCOUNT7_COUNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXTYPE7 register.
//
//*****************************************************************************
#define USB_TXTYPE7_SPEED_M 0x000000C0    // Operating Speed
#define USB_TXTYPE7_SPEED_DFLT 0x00000000 // Default
#define USB_TXTYPE7_SPEED_FULL 0x00000080 // Full
#define USB_TXTYPE7_SPEED_LOW 0x000000C0  // Low
#define USB_TXTYPE7_PROTO_M 0x00000030    // Protocol
#define USB_TXTYPE7_PROTO_CTRL 0x00000000 // Control
#define USB_TXTYPE7_PROTO_ISOC 0x00000010 // Isochronous
#define USB_TXTYPE7_PROTO_BULK 0x00000020 // Bulk
#define USB_TXTYPE7_PROTO_INT 0x00000030  // Interrupt
#define USB_TXTYPE7_TEP_M 0x0000000F      // Target Endpoint Number
#define USB_TXTYPE7_TEP_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXINTERVAL7
// register.
//
//*****************************************************************************
#define USB_TXINTERVAL7_TXPOLL_M 0x000000FF // TX Polling
#define USB_TXINTERVAL7_NAKLMT_M 0x000000FF // NAK Limit
#define USB_TXINTERVAL7_NAKLMT_S 0
#define USB_TXINTERVAL7_TXPOLL_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXTYPE7 register.
//
//*****************************************************************************
#define USB_RXTYPE7_SPEED_M 0x000000C0    // Operating Speed
#define USB_RXTYPE7_SPEED_DFLT 0x00000000 // Default
#define USB_RXTYPE7_SPEED_FULL 0x00000080 // Full
#define USB_RXTYPE7_SPEED_LOW 0x000000C0  // Low
#define USB_RXTYPE7_PROTO_M 0x00000030    // Protocol
#define USB_RXTYPE7_PROTO_CTRL 0x00000000 // Control
#define USB_RXTYPE7_PROTO_ISOC 0x00000010 // Isochronous
#define USB_RXTYPE7_PROTO_BULK 0x00000020 // Bulk
#define USB_RXTYPE7_PROTO_INT 0x00000030  // Interrupt
#define USB_RXTYPE7_TEP_M 0x0000000F      // Target Endpoint Number
#define USB_RXTYPE7_TEP_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXINTERVAL7
// register.
//
//*****************************************************************************
#define USB_RXINTERVAL7_TXPOLL_M 0x000000FF // RX Polling
#define USB_RXINTERVAL7_NAKLMT_M 0x000000FF // NAK Limit
#define USB_RXINTERVAL7_NAKLMT_S 0
#define USB_RXINTERVAL7_TXPOLL_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT1
// register.
//
//*****************************************************************************
#define USB_RQPKTCOUNT1_M 0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT1_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT2
// register.
//
//*****************************************************************************
#define USB_RQPKTCOUNT2_M 0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT2_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT3
// register.
//
//*****************************************************************************
#define USB_RQPKTCOUNT3_M 0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT3_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT4
// register.
//
//*****************************************************************************
#define USB_RQPKTCOUNT4_COUNT_M 0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT4_COUNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT5
// register.
//
//*****************************************************************************
#define USB_RQPKTCOUNT5_COUNT_M 0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT5_COUNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT6
// register.
//
//*****************************************************************************
#define USB_RQPKTCOUNT6_COUNT_M 0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT6_COUNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RQPKTCOUNT7
// register.
//
//*****************************************************************************
#define USB_RQPKTCOUNT7_COUNT_M 0x0000FFFF // Block Transfer Packet Count
#define USB_RQPKTCOUNT7_COUNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXDPKTBUFDIS
// register.
//
//*****************************************************************************
#define USB_RXDPKTBUFDIS_EP7                                                   \
  0x00000080 // EP7 RX Double-Packet Buffer
             // Disable
#define USB_RXDPKTBUFDIS_EP6                                                   \
  0x00000040 // EP6 RX Double-Packet Buffer
             // Disable
#define USB_RXDPKTBUFDIS_EP5                                                   \
  0x00000020 // EP5 RX Double-Packet Buffer
             // Disable
#define USB_RXDPKTBUFDIS_EP4                                                   \
  0x00000010 // EP4 RX Double-Packet Buffer
             // Disable
#define USB_RXDPKTBUFDIS_EP3                                                   \
  0x00000008 // EP3 RX Double-Packet Buffer
             // Disable
#define USB_RXDPKTBUFDIS_EP2                                                   \
  0x00000004 // EP2 RX Double-Packet Buffer
             // Disable
#define USB_RXDPKTBUFDIS_EP1                                                   \
  0x00000002 // EP1 RX Double-Packet Buffer
             // Disable

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXDPKTBUFDIS
// register.
//
//*****************************************************************************
#define USB_TXDPKTBUFDIS_EP7                                                   \
  0x00000080 // EP7 TX Double-Packet Buffer
             // Disable
#define USB_TXDPKTBUFDIS_EP6                                                   \
  0x00000040 // EP6 TX Double-Packet Buffer
             // Disable
#define USB_TXDPKTBUFDIS_EP5                                                   \
  0x00000020 // EP5 TX Double-Packet Buffer
             // Disable
#define USB_TXDPKTBUFDIS_EP4                                                   \
  0x00000010 // EP4 TX Double-Packet Buffer
             // Disable
#define USB_TXDPKTBUFDIS_EP3                                                   \
  0x00000008 // EP3 TX Double-Packet Buffer
             // Disable
#define USB_TXDPKTBUFDIS_EP2                                                   \
  0x00000004 // EP2 TX Double-Packet Buffer
             // Disable
#define USB_TXDPKTBUFDIS_EP1                                                   \
  0x00000002 // EP1 TX Double-Packet Buffer
             // Disable

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_EPC register.
//
//*****************************************************************************
#define USB_EPC_PFLTACT_M 0x00000300     // Power Fault Action
#define USB_EPC_PFLTACT_UNCHG 0x00000000 // Unchanged
#define USB_EPC_PFLTACT_TRIS 0x00000100  // Tristate
#define USB_EPC_PFLTACT_LOW 0x00000200   // Low
#define USB_EPC_PFLTACT_HIGH 0x00000300  // High
#define USB_EPC_PFLTAEN 0x00000040       // Power Fault Action Enable
#define USB_EPC_PFLTSEN_HIGH 0x00000020  // Power Fault Sense
#define USB_EPC_PFLTEN 0x00000010        // Power Fault Input Enable
#define USB_EPC_EPENDE 0x00000004        // EPEN Drive Enable
#define USB_EPC_EPEN_M                                                         \
  0x00000003                           // External Power Supply Enable
                                       // Configuration
#define USB_EPC_EPEN_LOW 0x00000000    // Power Enable Active Low
#define USB_EPC_EPEN_HIGH 0x00000001   // Power Enable Active High
#define USB_EPC_EPEN_VBLOW 0x00000002  // Power Enable High if VBUS Low
#define USB_EPC_EPEN_VBHIGH 0x00000003 // Power Enable High if VBUS High

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_EPCRIS register.
//
//*****************************************************************************
#define USB_EPCRIS_PF 0x00000001 // USB Power Fault Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_EPCIM register.
//
//*****************************************************************************
#define USB_EPCIM_PF 0x00000001 // USB Power Fault Interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_EPCISC register.
//
//*****************************************************************************
#define USB_EPCISC_PF                                                          \
  0x00000001 // USB Power Fault Interrupt Status
             // and Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DRRIS register.
//
//*****************************************************************************
#define USB_DRRIS_RESUME 0x00000001 // RESUME Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DRIM register.
//
//*****************************************************************************
#define USB_DRIM_RESUME 0x00000001 // RESUME Interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DRISC register.
//
//*****************************************************************************
#define USB_DRISC_RESUME                                                       \
  0x00000001 // RESUME Interrupt Status and
             // Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_GPCS register.
//
//*****************************************************************************
#define USB_GPCS_DEVMODOTG 0x00000002 // Enable Device Mode
#define USB_GPCS_DEVMOD 0x00000001    // Device Mode

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_VDC register.
//
//*****************************************************************************
#define USB_VDC_VBDEN 0x00000001 // VBUS Droop Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_VDCRIS register.
//
//*****************************************************************************
#define USB_VDCRIS_VD 0x00000001 // VBUS Droop Raw Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_VDCIM register.
//
//*****************************************************************************
#define USB_VDCIM_VD 0x00000001 // VBUS Droop Interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_VDCISC register.
//
//*****************************************************************************
#define USB_VDCISC_VD                                                          \
  0x00000001 // VBUS Droop Interrupt Status and
             // Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_IDVRIS register.
//
//*****************************************************************************
#define USB_IDVRIS_ID                                                          \
  0x00000001 // ID Valid Detect Raw Interrupt
             // Status

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_IDVIM register.
//
//*****************************************************************************
#define USB_IDVIM_ID 0x00000001 // ID Valid Detect Interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_IDVISC register.
//
//*****************************************************************************
#define USB_IDVISC_ID                                                          \
  0x00000001 // ID Valid Detect Interrupt Status
             // and Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_DMASEL register.
//
//*****************************************************************************
#define USB_DMASEL_DMACTX_M 0x00F00000 // DMA C TX Select
#define USB_DMASEL_DMACRX_M 0x000F0000 // DMA C RX Select
#define USB_DMASEL_DMABTX_M 0x0000F000 // DMA B TX Select
#define USB_DMASEL_DMABRX_M 0x00000F00 // DMA B RX Select
#define USB_DMASEL_DMAATX_M 0x000000F0 // DMA A TX Select
#define USB_DMASEL_DMAARX_M 0x0000000F // DMA A RX Select
#define USB_DMASEL_DMACTX_S 20
#define USB_DMASEL_DMACRX_S 16
#define USB_DMASEL_DMABTX_S 12
#define USB_DMASEL_DMABRX_S 8
#define USB_DMASEL_DMAATX_S 4
#define USB_DMASEL_DMAARX_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_PP register.
//
//*****************************************************************************
#define USB_PP_ECNT_M 0x0000FF00         // Endpoint Count
#define USB_PP_USB_M 0x000000C0          // USB Capability
#define USB_PP_USB_DEVICE 0x00000040     // DEVICE
#define USB_PP_USB_HOSTDEVICE 0x00000080 // HOST
#define USB_PP_USB_OTG 0x000000C0        // OTG
#define USB_PP_PHY 0x00000010            // PHY Present
#define USB_PP_TYPE_M 0x0000000F         // Controller Type
#define USB_PP_TYPE_0                                                          \
  0x00000000 // The first-generation USB
             // controller
#define USB_PP_ECNT_S 8

//*****************************************************************************
//
// The following are defines for the bit fields in the EEPROM_EESIZE register.
//
//*****************************************************************************
#define EEPROM_EESIZE_BLKCNT_M 0x07FF0000  // Number of 16-Word Blocks
#define EEPROM_EESIZE_WORDCNT_M 0x0000FFFF // Number of 32-Bit Words
#define EEPROM_EESIZE_BLKCNT_S 16
#define EEPROM_EESIZE_WORDCNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EEPROM_EEBLOCK register.
//
//*****************************************************************************
#define EEPROM_EEBLOCK_BLOCK_M 0x0000FFFF // Current Block
#define EEPROM_EEBLOCK_BLOCK_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EEPROM_EEOFFSET
// register.
//
//*****************************************************************************
#define EEPROM_EEOFFSET_OFFSET_M 0x0000000F // Current Address Offset
#define EEPROM_EEOFFSET_OFFSET_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EEPROM_EERDWR register.
//
//*****************************************************************************
#define EEPROM_EERDWR_VALUE_M 0xFFFFFFFF // EEPROM Read or Write Data
#define EEPROM_EERDWR_VALUE_S 0

