sethbrad/CprE288-Lab9/REF_tm4c123gh6pm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the EEPROM_EERDWRINC
// register.
//
//*****************************************************************************
#define EEPROM_EERDWRINC_VALUE_M                                               \
  0xFFFFFFFF // EEPROM Read or Write Data with
             // Increment
#define EEPROM_EERDWRINC_VALUE_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EEPROM_EEDONE register.
//
//*****************************************************************************
#define EEPROM_EEDONE_INVPL 0x00000100   // Invalid Program Voltage Level
#define EEPROM_EEDONE_WRBUSY 0x00000020  // Write Busy
#define EEPROM_EEDONE_NOPERM 0x00000010  // Write Without Permission
#define EEPROM_EEDONE_WKCOPY 0x00000008  // Working on a Copy
#define EEPROM_EEDONE_WKERASE 0x00000004 // Working on an Erase
#define EEPROM_EEDONE_WORKING 0x00000001 // EEPROM Working

//*****************************************************************************
//
// The following are defines for the bit fields in the EEPROM_EESUPP register.
//
//*****************************************************************************
#define EEPROM_EESUPP_PRETRY 0x00000008 // Programming Must Be Retried
#define EEPROM_EESUPP_ERETRY 0x00000004 // Erase Must Be Retried
#define EEPROM_EESUPP_EREQ 0x00000002   // Erase Required
#define EEPROM_EESUPP_START 0x00000001  // Start Erase

//*****************************************************************************
//
// The following are defines for the bit fields in the EEPROM_EEUNLOCK
// register.
//
//*****************************************************************************
#define EEPROM_EEUNLOCK_UNLOCK_M 0xFFFFFFFF // EEPROM Unlock

//*****************************************************************************
//
// The following are defines for the bit fields in the EEPROM_EEPROT register.
//
//*****************************************************************************
#define EEPROM_EEPROT_ACC 0x00000008    // Access Control
#define EEPROM_EEPROT_PROT_M 0x00000007 // Protection Control
#define EEPROM_EEPROT_PROT_RWNPW                                               \
  0x00000000 // This setting is the default. If
             // there is no password, the block
             // is not protected and is readable
             // and writable
#define EEPROM_EEPROT_PROT_RWPW                                                \
  0x00000001 // If there is a password, the
             // block is readable or writable
             // only when unlocked
#define EEPROM_EEPROT_PROT_RONPW                                               \
  0x00000002 // If there is no password, the
             // block is readable, not writable

//*****************************************************************************
//
// The following are defines for the bit fields in the EEPROM_EEPASS0 register.
//
//*****************************************************************************
#define EEPROM_EEPASS0_PASS_M 0xFFFFFFFF // Password
#define EEPROM_EEPASS0_PASS_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EEPROM_EEPASS1 register.
//
//*****************************************************************************
#define EEPROM_EEPASS1_PASS_M 0xFFFFFFFF // Password
#define EEPROM_EEPASS1_PASS_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EEPROM_EEPASS2 register.
//
//*****************************************************************************
#define EEPROM_EEPASS2_PASS_M 0xFFFFFFFF // Password
#define EEPROM_EEPASS2_PASS_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EEPROM_EEINT register.
//
//*****************************************************************************
#define EEPROM_EEINT_INT 0x00000001 // Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the EEPROM_EEHIDE register.
//
//*****************************************************************************
#define EEPROM_EEHIDE_HN_M 0xFFFFFFFE // Hide Block

//*****************************************************************************
//
// The following are defines for the bit fields in the EEPROM_EEDBGME register.
//
//*****************************************************************************
#define EEPROM_EEDBGME_KEY_M 0xFFFF0000 // Erase Key
#define EEPROM_EEDBGME_ME 0x00000001    // Mass Erase
#define EEPROM_EEDBGME_KEY_S 16

//*****************************************************************************
//
// The following are defines for the bit fields in the EEPROM_PP register.
//
//*****************************************************************************
#define EEPROM_PP_SIZE_M 0x0000001F // EEPROM Size
#define EEPROM_PP_SIZE_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSEXC_RIS register.
//
//*****************************************************************************
#define SYSEXC_RIS_FPIXCRIS                                                    \
  0x00000020 // Floating-Point Inexact Exception
             // Raw Interrupt Status
#define SYSEXC_RIS_FPOFCRIS                                                    \
  0x00000010 // Floating-Point Overflow
             // Exception Raw Interrupt Status
#define SYSEXC_RIS_FPUFCRIS                                                    \
  0x00000008 // Floating-Point Underflow
             // Exception Raw Interrupt Status
#define SYSEXC_RIS_FPIOCRIS                                                    \
  0x00000004 // Floating-Point Invalid Operation
             // Raw Interrupt Status
#define SYSEXC_RIS_FPDZCRIS                                                    \
  0x00000002 // Floating-Point Divide By 0
             // Exception Raw Interrupt Status
#define SYSEXC_RIS_FPIDCRIS                                                    \
  0x00000001 // Floating-Point Input Denormal
             // Exception Raw Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSEXC_IM register.
//
//*****************************************************************************
#define SYSEXC_IM_FPIXCIM                                                      \
  0x00000020 // Floating-Point Inexact Exception
             // Interrupt Mask
#define SYSEXC_IM_FPOFCIM                                                      \
  0x00000010 // Floating-Point Overflow
             // Exception Interrupt Mask
#define SYSEXC_IM_FPUFCIM                                                      \
  0x00000008 // Floating-Point Underflow
             // Exception Interrupt Mask
#define SYSEXC_IM_FPIOCIM                                                      \
  0x00000004 // Floating-Point Invalid Operation
             // Interrupt Mask
#define SYSEXC_IM_FPDZCIM                                                      \
  0x00000002 // Floating-Point Divide By 0
             // Exception Interrupt Mask
#define SYSEXC_IM_FPIDCIM                                                      \
  0x00000001 // Floating-Point Input Denormal
             // Exception Interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSEXC_MIS register.
//
//*****************************************************************************
#define SYSEXC_MIS_FPIXCMIS                                                    \
  0x00000020 // Floating-Point Inexact Exception
             // Masked Interrupt Status
#define SYSEXC_MIS_FPOFCMIS                                                    \
  0x00000010 // Floating-Point Overflow
             // Exception Masked Interrupt
             // Status
#define SYSEXC_MIS_FPUFCMIS                                                    \
  0x00000008 // Floating-Point Underflow
             // Exception Masked Interrupt
             // Status
#define SYSEXC_MIS_FPIOCMIS                                                    \
  0x00000004 // Floating-Point Invalid Operation
             // Masked Interrupt Status
#define SYSEXC_MIS_FPDZCMIS                                                    \
  0x00000002 // Floating-Point Divide By 0
             // Exception Masked Interrupt
             // Status
#define SYSEXC_MIS_FPIDCMIS                                                    \
  0x00000001 // Floating-Point Input Denormal
             // Exception Masked Interrupt
             // Status

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSEXC_IC register.
//
//*****************************************************************************
#define SYSEXC_IC_FPIXCIC                                                      \
  0x00000020 // Floating-Point Inexact Exception
             // Interrupt Clear
#define SYSEXC_IC_FPOFCIC                                                      \
  0x00000010 // Floating-Point Overflow
             // Exception Interrupt Clear
#define SYSEXC_IC_FPUFCIC                                                      \
  0x00000008 // Floating-Point Underflow
             // Exception Interrupt Clear
#define SYSEXC_IC_FPIOCIC                                                      \
  0x00000004 // Floating-Point Invalid Operation
             // Interrupt Clear
#define SYSEXC_IC_FPDZCIC                                                      \
  0x00000002 // Floating-Point Divide By 0
             // Exception Interrupt Clear
#define SYSEXC_IC_FPIDCIC                                                      \
  0x00000001 // Floating-Point Input Denormal
             // Exception Interrupt Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the HIB_RTCC register.
//
//*****************************************************************************
#define HIB_RTCC_M 0xFFFFFFFF // RTC Counter
#define HIB_RTCC_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the HIB_RTCM0 register.
//
//*****************************************************************************
#define HIB_RTCM0_M 0xFFFFFFFF // RTC Match 0
#define HIB_RTCM0_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the HIB_RTCLD register.
//
//*****************************************************************************
#define HIB_RTCLD_M 0xFFFFFFFF // RTC Load
#define HIB_RTCLD_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the HIB_CTL register.
//
//*****************************************************************************
#define HIB_CTL_WRC 0x80000000    // Write Complete/Capable
#define HIB_CTL_OSCDRV 0x00020000 // Oscillator Drive Capability
#define HIB_CTL_OSCBYP 0x00010000 // Oscillator Bypass
#define HIB_CTL_VBATSEL_M                                                      \
  0x00006000                            // Select for Low-Battery
                                        // Comparator
#define HIB_CTL_VBATSEL_1_9V 0x00000000 // 1.9 Volts
#define HIB_CTL_VBATSEL_2_1V 0x00002000 // 2.1 Volts (default)
#define HIB_CTL_VBATSEL_2_3V 0x00004000 // 2.3 Volts
#define HIB_CTL_VBATSEL_2_5V 0x00006000 // 2.5 Volts
#define HIB_CTL_BATCHK 0x00000400       // Check Battery Status
#define HIB_CTL_BATWKEN 0x00000200      // Wake on Low Battery
#define HIB_CTL_VDD3ON 0x00000100       // VDD Powered
#define HIB_CTL_VABORT 0x00000080       // Power Cut Abort Enable
#define HIB_CTL_CLK32EN 0x00000040      // Clocking Enable
#define HIB_CTL_PINWEN 0x00000010       // External WAKE Pin Enable
#define HIB_CTL_RTCWEN 0x00000008       // RTC Wake-up Enable
#define HIB_CTL_HIBREQ 0x00000002       // Hibernation Request
#define HIB_CTL_RTCEN 0x00000001        // RTC Timer Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the HIB_IM register.
//
//*****************************************************************************
#define HIB_IM_WC                                                              \
  0x00000010                   // External Write Complete/Capable
                               // Interrupt Mask
#define HIB_IM_EXTW 0x00000008 // External Wake-Up Interrupt Mask
#define HIB_IM_LOWBAT                                                          \
  0x00000004                      // Low Battery Voltage Interrupt
                                  // Mask
#define HIB_IM_RTCALT0 0x00000001 // RTC Alert 0 Interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the HIB_RIS register.
//
//*****************************************************************************
#define HIB_RIS_WC                                                             \
  0x00000010 // Write Complete/Capable Raw
             // Interrupt Status
#define HIB_RIS_EXTW                                                           \
  0x00000008 // External Wake-Up Raw Interrupt
             // Status
#define HIB_RIS_LOWBAT                                                         \
  0x00000004                       // Low Battery Voltage Raw
                                   // Interrupt Status
#define HIB_RIS_RTCALT0 0x00000001 // RTC Alert 0 Raw Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the HIB_MIS register.
//
//*****************************************************************************
#define HIB_MIS_WC                                                             \
  0x00000010 // Write Complete/Capable Masked
             // Interrupt Status
#define HIB_MIS_EXTW                                                           \
  0x00000008 // External Wake-Up Masked
             // Interrupt Status
#define HIB_MIS_LOWBAT                                                         \
  0x00000004 // Low Battery Voltage Masked
             // Interrupt Status
#define HIB_MIS_RTCALT0                                                        \
  0x00000001 // RTC Alert 0 Masked Interrupt
             // Status

//*****************************************************************************
//
// The following are defines for the bit fields in the HIB_IC register.
//
//*****************************************************************************
#define HIB_IC_WC                                                              \
  0x00000010 // Write Complete/Capable Masked
             // Interrupt Clear
#define HIB_IC_EXTW                                                            \
  0x00000008 // External Wake-Up Masked
             // Interrupt Clear
#define HIB_IC_LOWBAT                                                          \
  0x00000004 // Low Battery Voltage Masked
             // Interrupt Clear
#define HIB_IC_RTCALT0                                                         \
  0x00000001 // RTC Alert0 Masked Interrupt
             // Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the HIB_RTCT register.
//
//*****************************************************************************
#define HIB_RTCT_TRIM_M 0x0000FFFF // RTC Trim Value
#define HIB_RTCT_TRIM_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the HIB_RTCSS register.
//
//*****************************************************************************
#define HIB_RTCSS_RTCSSM_M 0x7FFF0000 // RTC Sub Seconds Match
#define HIB_RTCSS_RTCSSC_M 0x00007FFF // RTC Sub Seconds Count
#define HIB_RTCSS_RTCSSM_S 16
#define HIB_RTCSS_RTCSSC_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the HIB_DATA register.
//
//*****************************************************************************
#define HIB_DATA_RTD_M 0xFFFFFFFF // Hibernation Module NV Data
#define HIB_DATA_RTD_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the FLASH_FMA register.
//
//*****************************************************************************
#define FLASH_FMA_OFFSET_M 0x0003FFFF // Address Offset
#define FLASH_FMA_OFFSET_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the FLASH_FMD register.
//
//*****************************************************************************
#define FLASH_FMD_DATA_M 0xFFFFFFFF // Data Value
#define FLASH_FMD_DATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the FLASH_FMC register.
//
//*****************************************************************************
#define FLASH_FMC_WRKEY 0xA4420000  // FLASH write key
#define FLASH_FMC_COMT 0x00000008   // Commit Register Value
#define FLASH_FMC_MERASE 0x00000004 // Mass Erase Flash Memory
#define FLASH_FMC_ERASE 0x00000002  // Erase a Page of Flash Memory
#define FLASH_FMC_WRITE 0x00000001  // Write a Word into Flash Memory

//*****************************************************************************
//
// The following are defines for the bit fields in the FLASH_FCRIS register.
//
//*****************************************************************************
#define FLASH_FCRIS_PROGRIS 0x00002000 // PROGVER Raw Interrupt Status
#define FLASH_FCRIS_ERRIS 0x00000800   // ERVER Raw Interrupt Status
#define FLASH_FCRIS_INVDRIS                                                    \
  0x00000400                           // Invalid Data Raw Interrupt
                                       // Status
#define FLASH_FCRIS_VOLTRIS 0x00000200 // VOLTSTAT Raw Interrupt Status
#define FLASH_FCRIS_ERIS 0x00000004    // EEPROM Raw Interrupt Status
#define FLASH_FCRIS_PRIS 0x00000002    // Programming Raw Interrupt Status
#define FLASH_FCRIS_ARIS 0x00000001    // Access Raw Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the FLASH_FCIM register.
//
//*****************************************************************************
#define FLASH_FCIM_PROGMASK 0x00002000 // PROGVER Interrupt Mask
#define FLASH_FCIM_ERMASK 0x00000800   // ERVER Interrupt Mask
#define FLASH_FCIM_INVDMASK 0x00000400 // Invalid Data Interrupt Mask
#define FLASH_FCIM_VOLTMASK 0x00000200 // VOLT Interrupt Mask
#define FLASH_FCIM_EMASK 0x00000004    // EEPROM Interrupt Mask
#define FLASH_FCIM_PMASK 0x00000002    // Programming Interrupt Mask
#define FLASH_FCIM_AMASK 0x00000001    // Access Interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the FLASH_FCMISC register.
//
//*****************************************************************************
#define FLASH_FCMISC_PROGMISC                                                  \
  0x00002000 // PROGVER Masked Interrupt Status
             // and Clear
#define FLASH_FCMISC_ERMISC                                                    \
  0x00000800 // ERVER Masked Interrupt Status
             // and Clear
#define FLASH_FCMISC_INVDMISC                                                  \
  0x00000400 // Invalid Data Masked Interrupt
             // Status and Clear
#define FLASH_FCMISC_VOLTMISC                                                  \
  0x00000200 // VOLT Masked Interrupt Status and
             // Clear
#define FLASH_FCMISC_EMISC                                                     \
  0x00000004 // EEPROM Masked Interrupt Status
             // and Clear
#define FLASH_FCMISC_PMISC                                                     \
  0x00000002 // Programming Masked Interrupt
             // Status and Clear
#define FLASH_FCMISC_AMISC                                                     \
  0x00000001 // Access Masked Interrupt Status
             // and Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the FLASH_FMC2 register.
//
//*****************************************************************************
#define FLASH_FMC2_WRBUF 0x00000001 // Buffered Flash Memory Write

//*****************************************************************************
//
// The following are defines for the bit fields in the FLASH_FWBVAL register.
//
//*****************************************************************************
#define FLASH_FWBVAL_FWB_M 0xFFFFFFFF // Flash Memory Write Buffer

//*****************************************************************************
//
// The following are defines for the bit fields in the FLASH_FWBN register.
//
//*****************************************************************************
#define FLASH_FWBN_DATA_M 0xFFFFFFFF // Data

//*****************************************************************************
//
// The following are defines for the bit fields in the FLASH_FSIZE register.
//
//*****************************************************************************
#define FLASH_FSIZE_SIZE_M 0x0000FFFF     // Flash Size
#define FLASH_FSIZE_SIZE_8KB 0x00000003   // 8 KB of Flash
#define FLASH_FSIZE_SIZE_16KB 0x00000007  // 16 KB of Flash
#define FLASH_FSIZE_SIZE_32KB 0x0000000F  // 32 KB of Flash
#define FLASH_FSIZE_SIZE_64KB 0x0000001F  // 64 KB of Flash
#define FLASH_FSIZE_SIZE_96KB 0x0000002F  // 96 KB of Flash
#define FLASH_FSIZE_SIZE_128KB 0x0000003F // 128 KB of Flash
#define FLASH_FSIZE_SIZE_192KB 0x0000005F // 192 KB of Flash
#define FLASH_FSIZE_SIZE_256KB 0x0000007F // 256 KB of Flash

//*****************************************************************************
//
// The following are defines for the bit fields in the FLASH_SSIZE register.
//
//*****************************************************************************
#define FLASH_SSIZE_SIZE_M 0x0000FFFF    // SRAM Size
#define FLASH_SSIZE_SIZE_2KB 0x00000007  // 2 KB of SRAM
#define FLASH_SSIZE_SIZE_4KB 0x0000000F  // 4 KB of SRAM
#define FLASH_SSIZE_SIZE_6KB 0x00000017  // 6 KB of SRAM
#define FLASH_SSIZE_SIZE_8KB 0x0000001F  // 8 KB of SRAM
#define FLASH_SSIZE_SIZE_12KB 0x0000002F // 12 KB of SRAM
#define FLASH_SSIZE_SIZE_16KB 0x0000003F // 16 KB of SRAM
#define FLASH_SSIZE_SIZE_20KB 0x0000004F // 20 KB of SRAM
#define FLASH_SSIZE_SIZE_24KB 0x0000005F // 24 KB of SRAM
#define FLASH_SSIZE_SIZE_32KB 0x0000007F // 32 KB of SRAM

//*****************************************************************************
//
// The following are defines for the bit fields in the FLASH_ROMSWMAP register.
//
//*****************************************************************************
#define FLASH_ROMSWMAP_SAFERTOS 0x00000001 // SafeRTOS Present

