sethbrad/CprE288-Lab9/REF_tm4c123gh6pm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the FLASH_RMCTL register.
//
//*****************************************************************************
#define FLASH_RMCTL_BA 0x00000001 // Boot Alias

//*****************************************************************************
//
// The following are defines for the bit fields in the FLASH_BOOTCFG register.
//
//*****************************************************************************
#define FLASH_BOOTCFG_NW 0x80000000     // Not Written
#define FLASH_BOOTCFG_PORT_M 0x0000E000 // Boot GPIO Port
#define FLASH_BOOTCFG_PORT_A 0x00000000 // Port A
#define FLASH_BOOTCFG_PORT_B 0x00002000 // Port B
#define FLASH_BOOTCFG_PORT_C 0x00004000 // Port C
#define FLASH_BOOTCFG_PORT_D 0x00006000 // Port D
#define FLASH_BOOTCFG_PORT_E 0x00008000 // Port E
#define FLASH_BOOTCFG_PORT_F 0x0000A000 // Port F
#define FLASH_BOOTCFG_PORT_G 0x0000C000 // Port G
#define FLASH_BOOTCFG_PORT_H 0x0000E000 // Port H
#define FLASH_BOOTCFG_PIN_M 0x00001C00  // Boot GPIO Pin
#define FLASH_BOOTCFG_PIN_0 0x00000000  // Pin 0
#define FLASH_BOOTCFG_PIN_1 0x00000400  // Pin 1
#define FLASH_BOOTCFG_PIN_2 0x00000800  // Pin 2
#define FLASH_BOOTCFG_PIN_3 0x00000C00  // Pin 3
#define FLASH_BOOTCFG_PIN_4 0x00001000  // Pin 4
#define FLASH_BOOTCFG_PIN_5 0x00001400  // Pin 5
#define FLASH_BOOTCFG_PIN_6 0x00001800  // Pin 6
#define FLASH_BOOTCFG_PIN_7 0x00001C00  // Pin 7
#define FLASH_BOOTCFG_POL 0x00000200    // Boot GPIO Polarity
#define FLASH_BOOTCFG_EN 0x00000100     // Boot GPIO Enable
#define FLASH_BOOTCFG_KEY 0x00000010    // KEY Select
#define FLASH_BOOTCFG_DBG1 0x00000002   // Debug Control 1
#define FLASH_BOOTCFG_DBG0 0x00000001   // Debug Control 0

//*****************************************************************************
//
// The following are defines for the bit fields in the FLASH_USERREG0 register.
//
//*****************************************************************************
#define FLASH_USERREG0_DATA_M 0xFFFFFFFF // User Data
#define FLASH_USERREG0_DATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the FLASH_USERREG1 register.
//
//*****************************************************************************
#define FLASH_USERREG1_DATA_M 0xFFFFFFFF // User Data
#define FLASH_USERREG1_DATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the FLASH_USERREG2 register.
//
//*****************************************************************************
#define FLASH_USERREG2_DATA_M 0xFFFFFFFF // User Data
#define FLASH_USERREG2_DATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the FLASH_USERREG3 register.
//
//*****************************************************************************
#define FLASH_USERREG3_DATA_M 0xFFFFFFFF // User Data
#define FLASH_USERREG3_DATA_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DID0 register.
//
//*****************************************************************************
#define SYSCTL_DID0_VER_M 0x70000000 // DID0 Version
#define SYSCTL_DID0_VER_1                                                      \
  0x10000000                           // Second version of the DID0
                                       // register format
#define SYSCTL_DID0_CLASS_M 0x00FF0000 // Device Class
#define SYSCTL_DID0_CLASS_BLIZZARD                                             \
  0x00050000                            // Tiva(TM) C Series Blizzard-class
                                        // microcontrollers
#define SYSCTL_DID0_MAJ_M 0x0000FF00    // Major Revision
#define SYSCTL_DID0_MAJ_REVA 0x00000000 // Revision A (initial device)
#define SYSCTL_DID0_MAJ_REVB                                                   \
  0x00000100 // Revision B (first base layer
             // revision)
#define SYSCTL_DID0_MAJ_REVC                                                   \
  0x00000200                         // Revision C (second base layer
                                     // revision)
#define SYSCTL_DID0_MIN_M 0x000000FF // Minor Revision
#define SYSCTL_DID0_MIN_0                                                      \
  0x00000000                         // Initial device, or a major
                                     // revision update
#define SYSCTL_DID0_MIN_1 0x00000001 // First metal layer change
#define SYSCTL_DID0_MIN_2 0x00000002 // Second metal layer change

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DID1 register.
//
//*****************************************************************************
#define SYSCTL_DID1_VER_M 0xF0000000 // DID1 Version
#define SYSCTL_DID1_VER_1                                                      \
  0x10000000                            // Second version of the DID1
                                        // register format
#define SYSCTL_DID1_FAM_M 0x0F000000    // Family
#define SYSCTL_DID1_FAM_TIVA 0x00000000 // Tiva family of microcontollers
#define SYSCTL_DID1_PRTNO_M 0x00FF0000  // Part Number
#define SYSCTL_DID1_PRTNO_TM4C123GH6PM 0x00A10000 // TM4C123GH6PM
#define SYSCTL_DID1_PINCNT_M 0x0000E000           // Package Pin Count
#define SYSCTL_DID1_PINCNT_28 0x00000000          // 28-pin package
#define SYSCTL_DID1_PINCNT_48 0x00002000          // 48-pin package
#define SYSCTL_DID1_PINCNT_100 0x00004000         // 100-pin package
#define SYSCTL_DID1_PINCNT_64 0x00006000          // 64-pin package
#define SYSCTL_DID1_PINCNT_144 0x00008000         // 144-pin package
#define SYSCTL_DID1_PINCNT_157 0x0000A000         // 157-pin package
#define SYSCTL_DID1_TEMP_M 0x000000E0             // Temperature Range
#define SYSCTL_DID1_TEMP_C                                                     \
  0x00000000 // Commercial temperature range (0C
             // to 70C)
#define SYSCTL_DID1_TEMP_I                                                     \
  0x00000020 // Industrial temperature range
             // (-40C to 85C)
#define SYSCTL_DID1_TEMP_E                                                     \
  0x00000040                            // Extended temperature range (-40C
                                        // to 105C)
#define SYSCTL_DID1_PKG_M 0x00000018    // Package Type
#define SYSCTL_DID1_PKG_SOIC 0x00000000 // SOIC package
#define SYSCTL_DID1_PKG_QFP 0x00000008  // LQFP package
#define SYSCTL_DID1_PKG_BGA 0x00000010  // BGA package
#define SYSCTL_DID1_ROHS 0x00000004     // RoHS-Compliance
#define SYSCTL_DID1_QUAL_M 0x00000003   // Qualification Status
#define SYSCTL_DID1_QUAL_ES 0x00000000  // Engineering Sample (unqualified)
#define SYSCTL_DID1_QUAL_PP 0x00000001  // Pilot Production (unqualified)
#define SYSCTL_DID1_QUAL_FQ 0x00000002  // Fully Qualified

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DC0 register.
//
//*****************************************************************************
#define SYSCTL_DC0_SRAMSZ_M 0xFFFF0000     // SRAM Size
#define SYSCTL_DC0_SRAMSZ_2KB 0x00070000   // 2 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_4KB 0x000F0000   // 4 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_6KB 0x00170000   // 6 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_8KB 0x001F0000   // 8 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_12KB 0x002F0000  // 12 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_16KB 0x003F0000  // 16 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_20KB 0x004F0000  // 20 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_24KB 0x005F0000  // 24 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_32KB 0x007F0000  // 32 KB of SRAM
#define SYSCTL_DC0_FLASHSZ_M 0x0000FFFF    // Flash Size
#define SYSCTL_DC0_FLASHSZ_8KB 0x00000003  // 8 KB of Flash
#define SYSCTL_DC0_FLASHSZ_16KB 0x00000007 // 16 KB of Flash
#define SYSCTL_DC0_FLASHSZ_32KB 0x0000000F // 32 KB of Flash
#define SYSCTL_DC0_FLASHSZ_64KB 0x0000001F // 64 KB of Flash
#define SYSCTL_DC0_FLASHSZ_96KB 0x0000002F // 96 KB of Flash
#define SYSCTL_DC0_FLASHSZ_128K 0x0000003F // 128 KB of Flash
#define SYSCTL_DC0_FLASHSZ_192K 0x0000005F // 192 KB of Flash
#define SYSCTL_DC0_FLASHSZ_256K 0x0000007F // 256 KB of Flash

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DC1 register.
//
//*****************************************************************************
#define SYSCTL_DC1_WDT1 0x10000000          // Watchdog Timer1 Present
#define SYSCTL_DC1_CAN1 0x02000000          // CAN Module 1 Present
#define SYSCTL_DC1_CAN0 0x01000000          // CAN Module 0 Present
#define SYSCTL_DC1_PWM1 0x00200000          // PWM Module 1 Present
#define SYSCTL_DC1_PWM0 0x00100000          // PWM Module 0 Present
#define SYSCTL_DC1_ADC1 0x00020000          // ADC Module 1 Present
#define SYSCTL_DC1_ADC0 0x00010000          // ADC Module 0 Present
#define SYSCTL_DC1_MINSYSDIV_M 0x0000F000   // System Clock Divider
#define SYSCTL_DC1_MINSYSDIV_100 0x00001000 // Divide VCO (400MHZ) by 5 minimum
#define SYSCTL_DC1_MINSYSDIV_66                                                \
  0x00002000 // Divide VCO (400MHZ) by 2*2 + 2 =
             // 6 minimum
#define SYSCTL_DC1_MINSYSDIV_50                                                \
  0x00003000 // Specifies a 50-MHz CPU clock
             // with a PLL divider of 4
#define SYSCTL_DC1_MINSYSDIV_40                                                \
  0x00004000 // Specifies a 40-MHz CPU clock
             // with a PLL divider of 5
#define SYSCTL_DC1_MINSYSDIV_25                                                \
  0x00007000 // Specifies a 25-MHz clock with a
             // PLL divider of 8
#define SYSCTL_DC1_MINSYSDIV_20                                                \
  0x00009000                               // Specifies a 20-MHz clock with a
                                           // PLL divider of 10
#define SYSCTL_DC1_ADC1SPD_M 0x00000C00    // Max ADC1 Speed
#define SYSCTL_DC1_ADC1SPD_125K 0x00000000 // 125K samples/second
#define SYSCTL_DC1_ADC1SPD_250K 0x00000400 // 250K samples/second
#define SYSCTL_DC1_ADC1SPD_500K 0x00000800 // 500K samples/second
#define SYSCTL_DC1_ADC1SPD_1M 0x00000C00   // 1M samples/second
#define SYSCTL_DC1_ADC0SPD_M 0x00000300    // Max ADC0 Speed
#define SYSCTL_DC1_ADC0SPD_125K 0x00000000 // 125K samples/second
#define SYSCTL_DC1_ADC0SPD_250K 0x00000100 // 250K samples/second
#define SYSCTL_DC1_ADC0SPD_500K 0x00000200 // 500K samples/second
#define SYSCTL_DC1_ADC0SPD_1M 0x00000300   // 1M samples/second
#define SYSCTL_DC1_MPU 0x00000080          // MPU Present
#define SYSCTL_DC1_HIB 0x00000040          // Hibernation Module Present
#define SYSCTL_DC1_TEMP 0x00000020         // Temp Sensor Present
#define SYSCTL_DC1_PLL 0x00000010          // PLL Present
#define SYSCTL_DC1_WDT0 0x00000008         // Watchdog Timer 0 Present
#define SYSCTL_DC1_SWO 0x00000004          // SWO Trace Port Present
#define SYSCTL_DC1_SWD 0x00000002          // SWD Present
#define SYSCTL_DC1_JTAG 0x00000001         // JTAG Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DC2 register.
//
//*****************************************************************************
#define SYSCTL_DC2_EPI0 0x40000000   // EPI Module 0 Present
#define SYSCTL_DC2_I2S0 0x10000000   // I2S Module 0 Present
#define SYSCTL_DC2_COMP2 0x04000000  // Analog Comparator 2 Present
#define SYSCTL_DC2_COMP1 0x02000000  // Analog Comparator 1 Present
#define SYSCTL_DC2_COMP0 0x01000000  // Analog Comparator 0 Present
#define SYSCTL_DC2_TIMER3 0x00080000 // Timer Module 3 Present
#define SYSCTL_DC2_TIMER2 0x00040000 // Timer Module 2 Present
#define SYSCTL_DC2_TIMER1 0x00020000 // Timer Module 1 Present
#define SYSCTL_DC2_TIMER0 0x00010000 // Timer Module 0 Present
#define SYSCTL_DC2_I2C1HS 0x00008000 // I2C Module 1 Speed
#define SYSCTL_DC2_I2C1 0x00004000   // I2C Module 1 Present
#define SYSCTL_DC2_I2C0HS 0x00002000 // I2C Module 0 Speed
#define SYSCTL_DC2_I2C0 0x00001000   // I2C Module 0 Present
#define SYSCTL_DC2_QEI1 0x00000200   // QEI Module 1 Present
#define SYSCTL_DC2_QEI0 0x00000100   // QEI Module 0 Present
#define SYSCTL_DC2_SSI1 0x00000020   // SSI Module 1 Present
#define SYSCTL_DC2_SSI0 0x00000010   // SSI Module 0 Present
#define SYSCTL_DC2_UART2 0x00000004  // UART Module 2 Present
#define SYSCTL_DC2_UART1 0x00000002  // UART Module 1 Present
#define SYSCTL_DC2_UART0 0x00000001  // UART Module 0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DC3 register.
//
//*****************************************************************************
#define SYSCTL_DC3_32KHZ 0x80000000    // 32KHz Input Clock Available
#define SYSCTL_DC3_CCP5 0x20000000     // CCP5 Pin Present
#define SYSCTL_DC3_CCP4 0x10000000     // CCP4 Pin Present
#define SYSCTL_DC3_CCP3 0x08000000     // CCP3 Pin Present
#define SYSCTL_DC3_CCP2 0x04000000     // CCP2 Pin Present
#define SYSCTL_DC3_CCP1 0x02000000     // CCP1 Pin Present
#define SYSCTL_DC3_CCP0 0x01000000     // CCP0 Pin Present
#define SYSCTL_DC3_ADC0AIN7 0x00800000 // ADC Module 0 AIN7 Pin Present
#define SYSCTL_DC3_ADC0AIN6 0x00400000 // ADC Module 0 AIN6 Pin Present
#define SYSCTL_DC3_ADC0AIN5 0x00200000 // ADC Module 0 AIN5 Pin Present
#define SYSCTL_DC3_ADC0AIN4 0x00100000 // ADC Module 0 AIN4 Pin Present
#define SYSCTL_DC3_ADC0AIN3 0x00080000 // ADC Module 0 AIN3 Pin Present
#define SYSCTL_DC3_ADC0AIN2 0x00040000 // ADC Module 0 AIN2 Pin Present
#define SYSCTL_DC3_ADC0AIN1 0x00020000 // ADC Module 0 AIN1 Pin Present
#define SYSCTL_DC3_ADC0AIN0 0x00010000 // ADC Module 0 AIN0 Pin Present
#define SYSCTL_DC3_PWMFAULT 0x00008000 // PWM Fault Pin Present
#define SYSCTL_DC3_C2O 0x00004000      // C2o Pin Present
#define SYSCTL_DC3_C2PLUS 0x00002000   // C2+ Pin Present
#define SYSCTL_DC3_C2MINUS 0x00001000  // C2- Pin Present
#define SYSCTL_DC3_C1O 0x00000800      // C1o Pin Present
#define SYSCTL_DC3_C1PLUS 0x00000400   // C1+ Pin Present
#define SYSCTL_DC3_C1MINUS 0x00000200  // C1- Pin Present
#define SYSCTL_DC3_C0O 0x00000100      // C0o Pin Present
#define SYSCTL_DC3_C0PLUS 0x00000080   // C0+ Pin Present
#define SYSCTL_DC3_C0MINUS 0x00000040  // C0- Pin Present
#define SYSCTL_DC3_PWM5 0x00000020     // PWM5 Pin Present
#define SYSCTL_DC3_PWM4 0x00000010     // PWM4 Pin Present
#define SYSCTL_DC3_PWM3 0x00000008     // PWM3 Pin Present
#define SYSCTL_DC3_PWM2 0x00000004     // PWM2 Pin Present
#define SYSCTL_DC3_PWM1 0x00000002     // PWM1 Pin Present
#define SYSCTL_DC3_PWM0 0x00000001     // PWM0 Pin Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DC4 register.
//
//*****************************************************************************
#define SYSCTL_DC4_EPHY0 0x40000000 // Ethernet PHY Layer 0 Present
#define SYSCTL_DC4_EMAC0 0x10000000 // Ethernet MAC Layer 0 Present
#define SYSCTL_DC4_E1588 0x01000000 // 1588 Capable
#define SYSCTL_DC4_PICAL 0x00040000 // PIOSC Calibrate
#define SYSCTL_DC4_CCP7 0x00008000  // CCP7 Pin Present
#define SYSCTL_DC4_CCP6 0x00004000  // CCP6 Pin Present
#define SYSCTL_DC4_UDMA 0x00002000  // Micro-DMA Module Present
#define SYSCTL_DC4_ROM 0x00001000   // Internal Code ROM Present
#define SYSCTL_DC4_GPIOJ 0x00000100 // GPIO Port J Present
#define SYSCTL_DC4_GPIOH 0x00000080 // GPIO Port H Present
#define SYSCTL_DC4_GPIOG 0x00000040 // GPIO Port G Present
#define SYSCTL_DC4_GPIOF 0x00000020 // GPIO Port F Present
#define SYSCTL_DC4_GPIOE 0x00000010 // GPIO Port E Present
#define SYSCTL_DC4_GPIOD 0x00000008 // GPIO Port D Present
#define SYSCTL_DC4_GPIOC 0x00000004 // GPIO Port C Present
#define SYSCTL_DC4_GPIOB 0x00000002 // GPIO Port B Present
#define SYSCTL_DC4_GPIOA 0x00000001 // GPIO Port A Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DC5 register.
//
//*****************************************************************************
#define SYSCTL_DC5_PWMFAULT3 0x08000000 // PWM Fault 3 Pin Present
#define SYSCTL_DC5_PWMFAULT2 0x04000000 // PWM Fault 2 Pin Present
#define SYSCTL_DC5_PWMFAULT1 0x02000000 // PWM Fault 1 Pin Present
#define SYSCTL_DC5_PWMFAULT0 0x01000000 // PWM Fault 0 Pin Present
#define SYSCTL_DC5_PWMEFLT 0x00200000   // PWM Extended Fault Active
#define SYSCTL_DC5_PWMESYNC 0x00100000  // PWM Extended SYNC Active
#define SYSCTL_DC5_PWM7 0x00000080      // PWM7 Pin Present
#define SYSCTL_DC5_PWM6 0x00000040      // PWM6 Pin Present
#define SYSCTL_DC5_PWM5 0x00000020      // PWM5 Pin Present
#define SYSCTL_DC5_PWM4 0x00000010      // PWM4 Pin Present
#define SYSCTL_DC5_PWM3 0x00000008      // PWM3 Pin Present
#define SYSCTL_DC5_PWM2 0x00000004      // PWM2 Pin Present
#define SYSCTL_DC5_PWM1 0x00000002      // PWM1 Pin Present
#define SYSCTL_DC5_PWM0 0x00000001      // PWM0 Pin Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DC6 register.
//
//*****************************************************************************
#define SYSCTL_DC6_USB0PHY 0x00000010      // USB Module 0 PHY Present
#define SYSCTL_DC6_USB0_M 0x00000003       // USB Module 0 Present
#define SYSCTL_DC6_USB0_DEV 0x00000001     // USB0 is Device Only
#define SYSCTL_DC6_USB0_HOSTDEV 0x00000002 // USB is Device or Host
#define SYSCTL_DC6_USB0_OTG 0x00000003     // USB0 is OTG

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DC7 register.
//
//*****************************************************************************
#define SYSCTL_DC7_DMACH30 0x40000000 // SW
#define SYSCTL_DC7_DMACH29 0x20000000 // I2S0_TX / CAN1_TX
#define SYSCTL_DC7_DMACH28 0x10000000 // I2S0_RX / CAN1_RX
#define SYSCTL_DC7_DMACH27 0x08000000 // CAN1_TX / ADC1_SS3
#define SYSCTL_DC7_DMACH26 0x04000000 // CAN1_RX / ADC1_SS2
#define SYSCTL_DC7_DMACH25 0x02000000 // SSI1_TX / ADC1_SS1
#define SYSCTL_DC7_DMACH24 0x01000000 // SSI1_RX / ADC1_SS0
#define SYSCTL_DC7_DMACH23 0x00800000 // UART1_TX / CAN2_TX
#define SYSCTL_DC7_DMACH22 0x00400000 // UART1_RX / CAN2_RX
#define SYSCTL_DC7_DMACH21 0x00200000 // Timer1B / EPI0_WFIFO
#define SYSCTL_DC7_DMACH20 0x00100000 // Timer1A / EPI0_NBRFIFO
#define SYSCTL_DC7_DMACH19 0x00080000 // Timer0B / Timer1B
#define SYSCTL_DC7_DMACH18 0x00040000 // Timer0A / Timer1A
#define SYSCTL_DC7_DMACH17 0x00020000 // ADC0_SS3
#define SYSCTL_DC7_DMACH16 0x00010000 // ADC0_SS2
#define SYSCTL_DC7_DMACH15 0x00008000 // ADC0_SS1 / Timer2B
#define SYSCTL_DC7_DMACH14 0x00004000 // ADC0_SS0 / Timer2A
#define SYSCTL_DC7_DMACH13 0x00002000 // CAN0_TX / UART2_TX
#define SYSCTL_DC7_DMACH12 0x00001000 // CAN0_RX / UART2_RX
#define SYSCTL_DC7_DMACH11 0x00000800 // SSI0_TX / SSI1_TX
#define SYSCTL_DC7_DMACH10 0x00000400 // SSI0_RX / SSI1_RX
#define SYSCTL_DC7_DMACH9 0x00000200  // UART0_TX / UART1_TX
#define SYSCTL_DC7_DMACH8 0x00000100  // UART0_RX / UART1_RX
#define SYSCTL_DC7_DMACH7 0x00000080  // ETH_TX / Timer2B
#define SYSCTL_DC7_DMACH6 0x00000040  // ETH_RX / Timer2A
#define SYSCTL_DC7_DMACH5 0x00000020  // USB_EP3_TX / Timer2B
#define SYSCTL_DC7_DMACH4 0x00000010  // USB_EP3_RX / Timer2A
#define SYSCTL_DC7_DMACH3 0x00000008  // USB_EP2_TX / Timer3B
#define SYSCTL_DC7_DMACH2 0x00000004  // USB_EP2_RX / Timer3A
#define SYSCTL_DC7_DMACH1 0x00000002  // USB_EP1_TX / UART2_TX
#define SYSCTL_DC7_DMACH0 0x00000001  // USB_EP1_RX / UART2_RX

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DC8 register.
//
//*****************************************************************************
#define SYSCTL_DC8_ADC1AIN15 0x80000000 // ADC Module 1 AIN15 Pin Present
#define SYSCTL_DC8_ADC1AIN14 0x40000000 // ADC Module 1 AIN14 Pin Present
#define SYSCTL_DC8_ADC1AIN13 0x20000000 // ADC Module 1 AIN13 Pin Present
#define SYSCTL_DC8_ADC1AIN12 0x10000000 // ADC Module 1 AIN12 Pin Present
#define SYSCTL_DC8_ADC1AIN11 0x08000000 // ADC Module 1 AIN11 Pin Present
#define SYSCTL_DC8_ADC1AIN10 0x04000000 // ADC Module 1 AIN10 Pin Present
#define SYSCTL_DC8_ADC1AIN9 0x02000000  // ADC Module 1 AIN9 Pin Present
#define SYSCTL_DC8_ADC1AIN8 0x01000000  // ADC Module 1 AIN8 Pin Present
#define SYSCTL_DC8_ADC1AIN7 0x00800000  // ADC Module 1 AIN7 Pin Present
#define SYSCTL_DC8_ADC1AIN6 0x00400000  // ADC Module 1 AIN6 Pin Present
#define SYSCTL_DC8_ADC1AIN5 0x00200000  // ADC Module 1 AIN5 Pin Present
#define SYSCTL_DC8_ADC1AIN4 0x00100000  // ADC Module 1 AIN4 Pin Present
#define SYSCTL_DC8_ADC1AIN3 0x00080000  // ADC Module 1 AIN3 Pin Present
#define SYSCTL_DC8_ADC1AIN2 0x00040000  // ADC Module 1 AIN2 Pin Present
#define SYSCTL_DC8_ADC1AIN1 0x00020000  // ADC Module 1 AIN1 Pin Present
#define SYSCTL_DC8_ADC1AIN0 0x00010000  // ADC Module 1 AIN0 Pin Present
#define SYSCTL_DC8_ADC0AIN15 0x00008000 // ADC Module 0 AIN15 Pin Present
#define SYSCTL_DC8_ADC0AIN14 0x00004000 // ADC Module 0 AIN14 Pin Present
#define SYSCTL_DC8_ADC0AIN13 0x00002000 // ADC Module 0 AIN13 Pin Present
#define SYSCTL_DC8_ADC0AIN12 0x00001000 // ADC Module 0 AIN12 Pin Present
#define SYSCTL_DC8_ADC0AIN11 0x00000800 // ADC Module 0 AIN11 Pin Present
#define SYSCTL_DC8_ADC0AIN10 0x00000400 // ADC Module 0 AIN10 Pin Present
#define SYSCTL_DC8_ADC0AIN9 0x00000200  // ADC Module 0 AIN9 Pin Present
#define SYSCTL_DC8_ADC0AIN8 0x00000100  // ADC Module 0 AIN8 Pin Present
#define SYSCTL_DC8_ADC0AIN7 0x00000080  // ADC Module 0 AIN7 Pin Present
#define SYSCTL_DC8_ADC0AIN6 0x00000040  // ADC Module 0 AIN6 Pin Present
#define SYSCTL_DC8_ADC0AIN5 0x00000020  // ADC Module 0 AIN5 Pin Present
#define SYSCTL_DC8_ADC0AIN4 0x00000010  // ADC Module 0 AIN4 Pin Present
#define SYSCTL_DC8_ADC0AIN3 0x00000008  // ADC Module 0 AIN3 Pin Present
#define SYSCTL_DC8_ADC0AIN2 0x00000004  // ADC Module 0 AIN2 Pin Present
#define SYSCTL_DC8_ADC0AIN1 0x00000002  // ADC Module 0 AIN1 Pin Present
#define SYSCTL_DC8_ADC0AIN0 0x00000001  // ADC Module 0 AIN0 Pin Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PBORCTL register.
//
//*****************************************************************************
#define SYSCTL_PBORCTL_BOR0 0x00000004 // VDD under BOR0 Event Action
#define SYSCTL_PBORCTL_BOR1 0x00000002 // VDD under BOR1 Event Action

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRCR0 register.
//
//*****************************************************************************
#define SYSCTL_SRCR0_WDT1 0x10000000 // WDT1 Reset Control
#define SYSCTL_SRCR0_CAN1 0x02000000 // CAN1 Reset Control
#define SYSCTL_SRCR0_CAN0 0x01000000 // CAN0 Reset Control
#define SYSCTL_SRCR0_PWM0 0x00100000 // PWM Reset Control
#define SYSCTL_SRCR0_ADC1 0x00020000 // ADC1 Reset Control
#define SYSCTL_SRCR0_ADC0 0x00010000 // ADC0 Reset Control
#define SYSCTL_SRCR0_HIB 0x00000040  // HIB Reset Control
#define SYSCTL_SRCR0_WDT0 0x00000008 // WDT0 Reset Control

