sethbrad/CprE288-Lab9/REF_tm4c123gh6pm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRCR1 register.
//
//*****************************************************************************
#define SYSCTL_SRCR1_COMP1 0x02000000  // Analog Comp 1 Reset Control
#define SYSCTL_SRCR1_COMP0 0x01000000  // Analog Comp 0 Reset Control
#define SYSCTL_SRCR1_TIMER3 0x00080000 // Timer 3 Reset Control
#define SYSCTL_SRCR1_TIMER2 0x00040000 // Timer 2 Reset Control
#define SYSCTL_SRCR1_TIMER1 0x00020000 // Timer 1 Reset Control
#define SYSCTL_SRCR1_TIMER0 0x00010000 // Timer 0 Reset Control
#define SYSCTL_SRCR1_I2C1 0x00004000   // I2C1 Reset Control
#define SYSCTL_SRCR1_I2C0 0x00001000   // I2C0 Reset Control
#define SYSCTL_SRCR1_QEI1 0x00000200   // QEI1 Reset Control
#define SYSCTL_SRCR1_QEI0 0x00000100   // QEI0 Reset Control
#define SYSCTL_SRCR1_SSI1 0x00000020   // SSI1 Reset Control
#define SYSCTL_SRCR1_SSI0 0x00000010   // SSI0 Reset Control
#define SYSCTL_SRCR1_UART2 0x00000004  // UART2 Reset Control
#define SYSCTL_SRCR1_UART1 0x00000002  // UART1 Reset Control
#define SYSCTL_SRCR1_UART0 0x00000001  // UART0 Reset Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRCR2 register.
//
//*****************************************************************************
#define SYSCTL_SRCR2_USB0 0x00010000  // USB0 Reset Control
#define SYSCTL_SRCR2_UDMA 0x00002000  // Micro-DMA Reset Control
#define SYSCTL_SRCR2_GPIOF 0x00000020 // Port F Reset Control
#define SYSCTL_SRCR2_GPIOE 0x00000010 // Port E Reset Control
#define SYSCTL_SRCR2_GPIOD 0x00000008 // Port D Reset Control
#define SYSCTL_SRCR2_GPIOC 0x00000004 // Port C Reset Control
#define SYSCTL_SRCR2_GPIOB 0x00000002 // Port B Reset Control
#define SYSCTL_SRCR2_GPIOA 0x00000001 // Port A Reset Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RIS register.
//
//*****************************************************************************
#define SYSCTL_RIS_VDDARIS                                                     \
  0x00000400 // VDDA Power OK Event Raw
             // Interrupt Status
#define SYSCTL_RIS_MOSCPUPRIS                                                  \
  0x00000100 // MOSC Power Up Raw Interrupt
             // Status
#define SYSCTL_RIS_USBPLLLRIS                                                  \
  0x00000080                          // USB PLL Lock Raw Interrupt
                                      // Status
#define SYSCTL_RIS_PLLLRIS 0x00000040 // PLL Lock Raw Interrupt Status
#define SYSCTL_RIS_MOFRIS                                                      \
  0x00000008 // Main Oscillator Fault Raw
             // Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_IMC register.
//
//*****************************************************************************
#define SYSCTL_IMC_VDDAIM 0x00000400    // VDDA Power OK Interrupt Mask
#define SYSCTL_IMC_MOSCPUPIM 0x00000100 // MOSC Power Up Interrupt Mask
#define SYSCTL_IMC_USBPLLLIM 0x00000080 // USB PLL Lock Interrupt Mask
#define SYSCTL_IMC_PLLLIM 0x00000040    // PLL Lock Interrupt Mask
#define SYSCTL_IMC_MOFIM                                                       \
  0x00000008 // Main Oscillator Fault Interrupt
             // Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_MISC register.
//
//*****************************************************************************
#define SYSCTL_MISC_VDDAMIS                                                    \
  0x00000400 // VDDA Power OK Masked Interrupt
             // Status
#define SYSCTL_MISC_MOSCPUPMIS                                                 \
  0x00000100 // MOSC Power Up Masked Interrupt
             // Status
#define SYSCTL_MISC_USBPLLLMIS                                                 \
  0x00000080                           // USB PLL Lock Masked Interrupt
                                       // Status
#define SYSCTL_MISC_PLLLMIS 0x00000040 // PLL Lock Masked Interrupt Status
#define SYSCTL_MISC_MOFMIS                                                     \
  0x00000008 // Main Oscillator Fault Masked
             // Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RESC register.
//
//*****************************************************************************
#define SYSCTL_RESC_MOSCFAIL 0x00010000 // MOSC Failure Reset
#define SYSCTL_RESC_WDT1 0x00000020     // Watchdog Timer 1 Reset
#define SYSCTL_RESC_SW 0x00000010       // Software Reset
#define SYSCTL_RESC_WDT0 0x00000008     // Watchdog Timer 0 Reset
#define SYSCTL_RESC_BOR 0x00000004      // Brown-Out Reset
#define SYSCTL_RESC_POR 0x00000002      // Power-On Reset
#define SYSCTL_RESC_EXT 0x00000001      // External Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCC register.
//
//*****************************************************************************
#define SYSCTL_RCC_ACG 0x08000000          // Auto Clock Gating
#define SYSCTL_RCC_SYSDIV_M 0x07800000     // System Clock Divisor
#define SYSCTL_RCC_USESYSDIV 0x00400000    // Enable System Clock Divider
#define SYSCTL_RCC_USEPWMDIV 0x00100000    // Enable PWM Clock Divisor
#define SYSCTL_RCC_PWMDIV_M 0x000E0000     // PWM Unit Clock Divisor
#define SYSCTL_RCC_PWMDIV_2 0x00000000     // PWM clock /2
#define SYSCTL_RCC_PWMDIV_4 0x00020000     // PWM clock /4
#define SYSCTL_RCC_PWMDIV_8 0x00040000     // PWM clock /8
#define SYSCTL_RCC_PWMDIV_16 0x00060000    // PWM clock /16
#define SYSCTL_RCC_PWMDIV_32 0x00080000    // PWM clock /32
#define SYSCTL_RCC_PWMDIV_64 0x000A0000    // PWM clock /64
#define SYSCTL_RCC_PWRDN 0x00002000        // PLL Power Down
#define SYSCTL_RCC_BYPASS 0x00000800       // PLL Bypass
#define SYSCTL_RCC_XTAL_M 0x000007C0       // Crystal Value
#define SYSCTL_RCC_XTAL_4MHZ 0x00000180    // 4 MHz
#define SYSCTL_RCC_XTAL_4_09MHZ 0x000001C0 // 4.096 MHz
#define SYSCTL_RCC_XTAL_4_91MHZ 0x00000200 // 4.9152 MHz
#define SYSCTL_RCC_XTAL_5MHZ 0x00000240    // 5 MHz
#define SYSCTL_RCC_XTAL_5_12MHZ 0x00000280 // 5.12 MHz
#define SYSCTL_RCC_XTAL_6MHZ 0x000002C0    // 6 MHz
#define SYSCTL_RCC_XTAL_6_14MHZ 0x00000300 // 6.144 MHz
#define SYSCTL_RCC_XTAL_7_37MHZ 0x00000340 // 7.3728 MHz
#define SYSCTL_RCC_XTAL_8MHZ 0x00000380    // 8 MHz
#define SYSCTL_RCC_XTAL_8_19MHZ 0x000003C0 // 8.192 MHz
#define SYSCTL_RCC_XTAL_10MHZ 0x00000400   // 10 MHz
#define SYSCTL_RCC_XTAL_12MHZ 0x00000440   // 12 MHz
#define SYSCTL_RCC_XTAL_12_2MHZ 0x00000480 // 12.288 MHz
#define SYSCTL_RCC_XTAL_13_5MHZ 0x000004C0 // 13.56 MHz
#define SYSCTL_RCC_XTAL_14_3MHZ 0x00000500 // 14.31818 MHz
#define SYSCTL_RCC_XTAL_16MHZ 0x00000540   // 16 MHz
#define SYSCTL_RCC_XTAL_16_3MHZ 0x00000580 // 16.384 MHz
#define SYSCTL_RCC_XTAL_18MHZ 0x000005C0   // 18.0 MHz
#define SYSCTL_RCC_XTAL_20MHZ 0x00000600   // 20.0 MHz
#define SYSCTL_RCC_XTAL_24MHZ 0x00000640   // 24.0 MHz
#define SYSCTL_RCC_XTAL_25MHZ 0x00000680   // 25.0 MHz
#define SYSCTL_RCC_OSCSRC_M 0x00000030     // Oscillator Source
#define SYSCTL_RCC_OSCSRC_MAIN 0x00000000  // MOSC
#define SYSCTL_RCC_OSCSRC_INT 0x00000010   // IOSC
#define SYSCTL_RCC_OSCSRC_INT4 0x00000020  // IOSC/4
#define SYSCTL_RCC_OSCSRC_30 0x00000030    // 30 kHz
#define SYSCTL_RCC_MOSCDIS 0x00000001      // Main Oscillator Disable
#define SYSCTL_RCC_SYSDIV_S 23

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_GPIOHBCTL
// register.
//
//*****************************************************************************
#define SYSCTL_GPIOHBCTL_PORTF                                                 \
  0x00000020 // Port F Advanced High-Performance
             // Bus
#define SYSCTL_GPIOHBCTL_PORTE                                                 \
  0x00000010 // Port E Advanced High-Performance
             // Bus
#define SYSCTL_GPIOHBCTL_PORTD                                                 \
  0x00000008 // Port D Advanced High-Performance
             // Bus
#define SYSCTL_GPIOHBCTL_PORTC                                                 \
  0x00000004 // Port C Advanced High-Performance
             // Bus
#define SYSCTL_GPIOHBCTL_PORTB                                                 \
  0x00000002 // Port B Advanced High-Performance
             // Bus
#define SYSCTL_GPIOHBCTL_PORTA                                                 \
  0x00000001 // Port A Advanced High-Performance
             // Bus

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCC2 register.
//
//*****************************************************************************
#define SYSCTL_RCC2_USERCC2 0x80000000 // Use RCC2
#define SYSCTL_RCC2_DIV400                                                     \
  0x40000000                               // Divide PLL as 400 MHz vs. 200
                                           // MHz
#define SYSCTL_RCC2_SYSDIV2_M 0x1F800000   // System Clock Divisor 2
#define SYSCTL_RCC2_SYSDIV2LSB 0x00400000  // Additional LSB for SYSDIV2
#define SYSCTL_RCC2_USBPWRDN 0x00004000    // Power-Down USB PLL
#define SYSCTL_RCC2_PWRDN2 0x00002000      // Power-Down PLL 2
#define SYSCTL_RCC2_BYPASS2 0x00000800     // PLL Bypass 2
#define SYSCTL_RCC2_OSCSRC2_M 0x00000070   // Oscillator Source 2
#define SYSCTL_RCC2_OSCSRC2_MO 0x00000000  // MOSC
#define SYSCTL_RCC2_OSCSRC2_IO 0x00000010  // PIOSC
#define SYSCTL_RCC2_OSCSRC2_IO4 0x00000020 // PIOSC/4
#define SYSCTL_RCC2_OSCSRC2_30 0x00000030  // 30 kHz
#define SYSCTL_RCC2_OSCSRC2_32 0x00000070  // 32.768 kHz
#define SYSCTL_RCC2_SYSDIV2_S 23

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_MOSCCTL register.
//
//*****************************************************************************
#define SYSCTL_MOSCCTL_NOXTAL 0x00000004 // No Crystal Connected
#define SYSCTL_MOSCCTL_MOSCIM 0x00000002 // MOSC Failure Action
#define SYSCTL_MOSCCTL_CVAL 0x00000001   // Clock Validation for MOSC

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGC0 register.
//
//*****************************************************************************
#define SYSCTL_RCGC0_WDT1 0x10000000         // WDT1 Clock Gating Control
#define SYSCTL_RCGC0_CAN1 0x02000000         // CAN1 Clock Gating Control
#define SYSCTL_RCGC0_CAN0 0x01000000         // CAN0 Clock Gating Control
#define SYSCTL_RCGC0_PWM0 0x00100000         // PWM Clock Gating Control
#define SYSCTL_RCGC0_ADC1 0x00020000         // ADC1 Clock Gating Control
#define SYSCTL_RCGC0_ADC0 0x00010000         // ADC0 Clock Gating Control
#define SYSCTL_RCGC0_ADC1SPD_M 0x00000C00    // ADC1 Sample Speed
#define SYSCTL_RCGC0_ADC1SPD_125K 0x00000000 // 125K samples/second
#define SYSCTL_RCGC0_ADC1SPD_250K 0x00000400 // 250K samples/second
#define SYSCTL_RCGC0_ADC1SPD_500K 0x00000800 // 500K samples/second
#define SYSCTL_RCGC0_ADC1SPD_1M 0x00000C00   // 1M samples/second
#define SYSCTL_RCGC0_ADC0SPD_M 0x00000300    // ADC0 Sample Speed
#define SYSCTL_RCGC0_ADC0SPD_125K 0x00000000 // 125K samples/second
#define SYSCTL_RCGC0_ADC0SPD_250K 0x00000100 // 250K samples/second
#define SYSCTL_RCGC0_ADC0SPD_500K 0x00000200 // 500K samples/second
#define SYSCTL_RCGC0_ADC0SPD_1M 0x00000300   // 1M samples/second
#define SYSCTL_RCGC0_HIB 0x00000040          // HIB Clock Gating Control
#define SYSCTL_RCGC0_WDT0 0x00000008         // WDT0 Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGC1 register.
//
//*****************************************************************************
#define SYSCTL_RCGC1_COMP1 0x02000000  // Analog Comparator 1 Clock Gating
#define SYSCTL_RCGC1_COMP0 0x01000000  // Analog Comparator 0 Clock Gating
#define SYSCTL_RCGC1_TIMER3 0x00080000 // Timer 3 Clock Gating Control
#define SYSCTL_RCGC1_TIMER2 0x00040000 // Timer 2 Clock Gating Control
#define SYSCTL_RCGC1_TIMER1 0x00020000 // Timer 1 Clock Gating Control
#define SYSCTL_RCGC1_TIMER0 0x00010000 // Timer 0 Clock Gating Control
#define SYSCTL_RCGC1_I2C1 0x00004000   // I2C1 Clock Gating Control
#define SYSCTL_RCGC1_I2C0 0x00001000   // I2C0 Clock Gating Control
#define SYSCTL_RCGC1_QEI1 0x00000200   // QEI1 Clock Gating Control
#define SYSCTL_RCGC1_QEI0 0x00000100   // QEI0 Clock Gating Control
#define SYSCTL_RCGC1_SSI1 0x00000020   // SSI1 Clock Gating Control
#define SYSCTL_RCGC1_SSI0 0x00000010   // SSI0 Clock Gating Control
#define SYSCTL_RCGC1_UART2 0x00000004  // UART2 Clock Gating Control
#define SYSCTL_RCGC1_UART1 0x00000002  // UART1 Clock Gating Control
#define SYSCTL_RCGC1_UART0 0x00000001  // UART0 Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGC2 register.
//
//*****************************************************************************
#define SYSCTL_RCGC2_USB0 0x00010000  // USB0 Clock Gating Control
#define SYSCTL_RCGC2_UDMA 0x00002000  // Micro-DMA Clock Gating Control
#define SYSCTL_RCGC2_GPIOF 0x00000020 // Port F Clock Gating Control
#define SYSCTL_RCGC2_GPIOE 0x00000010 // Port E Clock Gating Control
#define SYSCTL_RCGC2_GPIOD 0x00000008 // Port D Clock Gating Control
#define SYSCTL_RCGC2_GPIOC 0x00000004 // Port C Clock Gating Control
#define SYSCTL_RCGC2_GPIOB 0x00000002 // Port B Clock Gating Control
#define SYSCTL_RCGC2_GPIOA 0x00000001 // Port A Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGC0 register.
//
//*****************************************************************************
#define SYSCTL_SCGC0_WDT1 0x10000000 // WDT1 Clock Gating Control
#define SYSCTL_SCGC0_CAN1 0x02000000 // CAN1 Clock Gating Control
#define SYSCTL_SCGC0_CAN0 0x01000000 // CAN0 Clock Gating Control
#define SYSCTL_SCGC0_PWM0 0x00100000 // PWM Clock Gating Control
#define SYSCTL_SCGC0_ADC1 0x00020000 // ADC1 Clock Gating Control
#define SYSCTL_SCGC0_ADC0 0x00010000 // ADC0 Clock Gating Control
#define SYSCTL_SCGC0_HIB 0x00000040  // HIB Clock Gating Control
#define SYSCTL_SCGC0_WDT0 0x00000008 // WDT0 Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGC1 register.
//
//*****************************************************************************
#define SYSCTL_SCGC1_COMP1 0x02000000  // Analog Comparator 1 Clock Gating
#define SYSCTL_SCGC1_COMP0 0x01000000  // Analog Comparator 0 Clock Gating
#define SYSCTL_SCGC1_TIMER3 0x00080000 // Timer 3 Clock Gating Control
#define SYSCTL_SCGC1_TIMER2 0x00040000 // Timer 2 Clock Gating Control
#define SYSCTL_SCGC1_TIMER1 0x00020000 // Timer 1 Clock Gating Control
#define SYSCTL_SCGC1_TIMER0 0x00010000 // Timer 0 Clock Gating Control
#define SYSCTL_SCGC1_I2C1 0x00004000   // I2C1 Clock Gating Control
#define SYSCTL_SCGC1_I2C0 0x00001000   // I2C0 Clock Gating Control
#define SYSCTL_SCGC1_QEI1 0x00000200   // QEI1 Clock Gating Control
#define SYSCTL_SCGC1_QEI0 0x00000100   // QEI0 Clock Gating Control
#define SYSCTL_SCGC1_SSI1 0x00000020   // SSI1 Clock Gating Control
#define SYSCTL_SCGC1_SSI0 0x00000010   // SSI0 Clock Gating Control
#define SYSCTL_SCGC1_UART2 0x00000004  // UART2 Clock Gating Control
#define SYSCTL_SCGC1_UART1 0x00000002  // UART1 Clock Gating Control
#define SYSCTL_SCGC1_UART0 0x00000001  // UART0 Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGC2 register.
//
//*****************************************************************************
#define SYSCTL_SCGC2_USB0 0x00010000  // USB0 Clock Gating Control
#define SYSCTL_SCGC2_UDMA 0x00002000  // Micro-DMA Clock Gating Control
#define SYSCTL_SCGC2_GPIOF 0x00000020 // Port F Clock Gating Control
#define SYSCTL_SCGC2_GPIOE 0x00000010 // Port E Clock Gating Control
#define SYSCTL_SCGC2_GPIOD 0x00000008 // Port D Clock Gating Control
#define SYSCTL_SCGC2_GPIOC 0x00000004 // Port C Clock Gating Control
#define SYSCTL_SCGC2_GPIOB 0x00000002 // Port B Clock Gating Control
#define SYSCTL_SCGC2_GPIOA 0x00000001 // Port A Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGC0 register.
//
//*****************************************************************************
#define SYSCTL_DCGC0_WDT1 0x10000000 // WDT1 Clock Gating Control
#define SYSCTL_DCGC0_CAN1 0x02000000 // CAN1 Clock Gating Control
#define SYSCTL_DCGC0_CAN0 0x01000000 // CAN0 Clock Gating Control
#define SYSCTL_DCGC0_PWM0 0x00100000 // PWM Clock Gating Control
#define SYSCTL_DCGC0_ADC1 0x00020000 // ADC1 Clock Gating Control
#define SYSCTL_DCGC0_ADC0 0x00010000 // ADC0 Clock Gating Control
#define SYSCTL_DCGC0_HIB 0x00000040  // HIB Clock Gating Control
#define SYSCTL_DCGC0_WDT0 0x00000008 // WDT0 Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGC1 register.
//
//*****************************************************************************
#define SYSCTL_DCGC1_COMP1 0x02000000  // Analog Comparator 1 Clock Gating
#define SYSCTL_DCGC1_COMP0 0x01000000  // Analog Comparator 0 Clock Gating
#define SYSCTL_DCGC1_TIMER3 0x00080000 // Timer 3 Clock Gating Control
#define SYSCTL_DCGC1_TIMER2 0x00040000 // Timer 2 Clock Gating Control
#define SYSCTL_DCGC1_TIMER1 0x00020000 // Timer 1 Clock Gating Control
#define SYSCTL_DCGC1_TIMER0 0x00010000 // Timer 0 Clock Gating Control
#define SYSCTL_DCGC1_I2C1 0x00004000   // I2C1 Clock Gating Control
#define SYSCTL_DCGC1_I2C0 0x00001000   // I2C0 Clock Gating Control
#define SYSCTL_DCGC1_QEI1 0x00000200   // QEI1 Clock Gating Control
#define SYSCTL_DCGC1_QEI0 0x00000100   // QEI0 Clock Gating Control
#define SYSCTL_DCGC1_SSI1 0x00000020   // SSI1 Clock Gating Control
#define SYSCTL_DCGC1_SSI0 0x00000010   // SSI0 Clock Gating Control
#define SYSCTL_DCGC1_UART2 0x00000004  // UART2 Clock Gating Control
#define SYSCTL_DCGC1_UART1 0x00000002  // UART1 Clock Gating Control
#define SYSCTL_DCGC1_UART0 0x00000001  // UART0 Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGC2 register.
//
//*****************************************************************************
#define SYSCTL_DCGC2_USB0 0x00010000  // USB0 Clock Gating Control
#define SYSCTL_DCGC2_UDMA 0x00002000  // Micro-DMA Clock Gating Control
#define SYSCTL_DCGC2_GPIOF 0x00000020 // Port F Clock Gating Control
#define SYSCTL_DCGC2_GPIOE 0x00000010 // Port E Clock Gating Control
#define SYSCTL_DCGC2_GPIOD 0x00000008 // Port D Clock Gating Control
#define SYSCTL_DCGC2_GPIOC 0x00000004 // Port C Clock Gating Control
#define SYSCTL_DCGC2_GPIOB 0x00000002 // Port B Clock Gating Control
#define SYSCTL_DCGC2_GPIOA 0x00000001 // Port A Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DSLPCLKCFG
// register.
//
//*****************************************************************************
#define SYSCTL_DSLPCLKCFG_D_M 0x1F800000   // Divider Field Override
#define SYSCTL_DSLPCLKCFG_O_M 0x00000070   // Clock Source
#define SYSCTL_DSLPCLKCFG_O_IGN 0x00000000 // MOSC
#define SYSCTL_DSLPCLKCFG_O_IO 0x00000010  // PIOSC
#define SYSCTL_DSLPCLKCFG_O_30 0x00000030  // 30 kHz
#define SYSCTL_DSLPCLKCFG_O_32 0x00000070  // 32.768 kHz
#define SYSCTL_DSLPCLKCFG_D_S 23

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SYSPROP register.
//
//*****************************************************************************
#define SYSCTL_SYSPROP_FPU 0x00000001 // FPU Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PIOSCCAL
// register.
//
//*****************************************************************************
#define SYSCTL_PIOSCCAL_UTEN 0x80000000   // Use User Trim Value
#define SYSCTL_PIOSCCAL_CAL 0x00000200    // Start Calibration
#define SYSCTL_PIOSCCAL_UPDATE 0x00000100 // Update Trim
#define SYSCTL_PIOSCCAL_UT_M 0x0000007F   // User Trim Value
#define SYSCTL_PIOSCCAL_UT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PIOSCSTAT
// register.
//
//*****************************************************************************
#define SYSCTL_PIOSCSTAT_DT_M 0x007F0000 // Default Trim Value
#define SYSCTL_PIOSCSTAT_CR_M 0x00000300 // Calibration Result
#define SYSCTL_PIOSCSTAT_CRNONE                                                \
  0x00000000 // Calibration has not been
             // attempted
#define SYSCTL_PIOSCSTAT_CRPASS                                                \
  0x00000100 // The last calibration operation
             // completed to meet 1% accuracy
#define SYSCTL_PIOSCSTAT_CRFAIL                                                \
  0x00000200                             // The last calibration operation
                                         // failed to meet 1% accuracy
#define SYSCTL_PIOSCSTAT_CT_M 0x0000007F // Calibration Trim Value
#define SYSCTL_PIOSCSTAT_DT_S 16
#define SYSCTL_PIOSCSTAT_CT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PLLFREQ0
// register.
//
//*****************************************************************************
#define SYSCTL_PLLFREQ0_MFRAC_M 0x000FFC00 // PLL M Fractional Value
#define SYSCTL_PLLFREQ0_MINT_M 0x000003FF  // PLL M Integer Value
#define SYSCTL_PLLFREQ0_MFRAC_S 10
#define SYSCTL_PLLFREQ0_MINT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PLLFREQ1
// register.
//
//*****************************************************************************
#define SYSCTL_PLLFREQ1_Q_M 0x00001F00 // PLL Q Value
#define SYSCTL_PLLFREQ1_N_M 0x0000001F // PLL N Value
#define SYSCTL_PLLFREQ1_Q_S 8
#define SYSCTL_PLLFREQ1_N_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PLLSTAT register.
//
//*****************************************************************************
#define SYSCTL_PLLSTAT_LOCK 0x00000001 // PLL Lock

