sethbrad/CprE288-Lab9/REF_tm4c123gh6pm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DC9 register.
//
//*****************************************************************************
#define SYSCTL_DC9_ADC1DC7 0x00800000 // ADC1 DC7 Present
#define SYSCTL_DC9_ADC1DC6 0x00400000 // ADC1 DC6 Present
#define SYSCTL_DC9_ADC1DC5 0x00200000 // ADC1 DC5 Present
#define SYSCTL_DC9_ADC1DC4 0x00100000 // ADC1 DC4 Present
#define SYSCTL_DC9_ADC1DC3 0x00080000 // ADC1 DC3 Present
#define SYSCTL_DC9_ADC1DC2 0x00040000 // ADC1 DC2 Present
#define SYSCTL_DC9_ADC1DC1 0x00020000 // ADC1 DC1 Present
#define SYSCTL_DC9_ADC1DC0 0x00010000 // ADC1 DC0 Present
#define SYSCTL_DC9_ADC0DC7 0x00000080 // ADC0 DC7 Present
#define SYSCTL_DC9_ADC0DC6 0x00000040 // ADC0 DC6 Present
#define SYSCTL_DC9_ADC0DC5 0x00000020 // ADC0 DC5 Present
#define SYSCTL_DC9_ADC0DC4 0x00000010 // ADC0 DC4 Present
#define SYSCTL_DC9_ADC0DC3 0x00000008 // ADC0 DC3 Present
#define SYSCTL_DC9_ADC0DC2 0x00000004 // ADC0 DC2 Present
#define SYSCTL_DC9_ADC0DC1 0x00000002 // ADC0 DC1 Present
#define SYSCTL_DC9_ADC0DC0 0x00000001 // ADC0 DC0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_NVMSTAT register.
//
//*****************************************************************************
#define SYSCTL_NVMSTAT_FWB                                                     \
  0x00000001 // 32 Word Flash Write Buffer
             // Active

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPWD register.
//
//*****************************************************************************
#define SYSCTL_PPWD_P1 0x00000002 // Watchdog Timer 1 Present
#define SYSCTL_PPWD_P0 0x00000001 // Watchdog Timer 0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPTIMER register.
//
//*****************************************************************************
#define SYSCTL_PPTIMER_P5 0x00000020 // Timer 5 Present
#define SYSCTL_PPTIMER_P4 0x00000010 // Timer 4 Present
#define SYSCTL_PPTIMER_P3 0x00000008 // Timer 3 Present
#define SYSCTL_PPTIMER_P2 0x00000004 // Timer 2 Present
#define SYSCTL_PPTIMER_P1 0x00000002 // Timer 1 Present
#define SYSCTL_PPTIMER_P0 0x00000001 // Timer 0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPGPIO register.
//
//*****************************************************************************
#define SYSCTL_PPGPIO_P14 0x00004000 // GPIO Port Q Present
#define SYSCTL_PPGPIO_P13 0x00002000 // GPIO Port P Present
#define SYSCTL_PPGPIO_P12 0x00001000 // GPIO Port N Present
#define SYSCTL_PPGPIO_P11 0x00000800 // GPIO Port M Present
#define SYSCTL_PPGPIO_P10 0x00000400 // GPIO Port L Present
#define SYSCTL_PPGPIO_P9 0x00000200  // GPIO Port K Present
#define SYSCTL_PPGPIO_P8 0x00000100  // GPIO Port J Present
#define SYSCTL_PPGPIO_P7 0x00000080  // GPIO Port H Present
#define SYSCTL_PPGPIO_P6 0x00000040  // GPIO Port G Present
#define SYSCTL_PPGPIO_P5 0x00000020  // GPIO Port F Present
#define SYSCTL_PPGPIO_P4 0x00000010  // GPIO Port E Present
#define SYSCTL_PPGPIO_P3 0x00000008  // GPIO Port D Present
#define SYSCTL_PPGPIO_P2 0x00000004  // GPIO Port C Present
#define SYSCTL_PPGPIO_P1 0x00000002  // GPIO Port B Present
#define SYSCTL_PPGPIO_P0 0x00000001  // GPIO Port A Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPDMA register.
//
//*****************************************************************************
#define SYSCTL_PPDMA_P0 0x00000001 // uDMA Module Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPHIB register.
//
//*****************************************************************************
#define SYSCTL_PPHIB_P0 0x00000001 // Hibernation Module Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPUART register.
//
//*****************************************************************************
#define SYSCTL_PPUART_P7 0x00000080 // UART Module 7 Present
#define SYSCTL_PPUART_P6 0x00000040 // UART Module 6 Present
#define SYSCTL_PPUART_P5 0x00000020 // UART Module 5 Present
#define SYSCTL_PPUART_P4 0x00000010 // UART Module 4 Present
#define SYSCTL_PPUART_P3 0x00000008 // UART Module 3 Present
#define SYSCTL_PPUART_P2 0x00000004 // UART Module 2 Present
#define SYSCTL_PPUART_P1 0x00000002 // UART Module 1 Present
#define SYSCTL_PPUART_P0 0x00000001 // UART Module 0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPSSI register.
//
//*****************************************************************************
#define SYSCTL_PPSSI_P3 0x00000008 // SSI Module 3 Present
#define SYSCTL_PPSSI_P2 0x00000004 // SSI Module 2 Present
#define SYSCTL_PPSSI_P1 0x00000002 // SSI Module 1 Present
#define SYSCTL_PPSSI_P0 0x00000001 // SSI Module 0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPI2C register.
//
//*****************************************************************************
#define SYSCTL_PPI2C_P5 0x00000020 // I2C Module 5 Present
#define SYSCTL_PPI2C_P4 0x00000010 // I2C Module 4 Present
#define SYSCTL_PPI2C_P3 0x00000008 // I2C Module 3 Present
#define SYSCTL_PPI2C_P2 0x00000004 // I2C Module 2 Present
#define SYSCTL_PPI2C_P1 0x00000002 // I2C Module 1 Present
#define SYSCTL_PPI2C_P0 0x00000001 // I2C Module 0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPUSB register.
//
//*****************************************************************************
#define SYSCTL_PPUSB_P0 0x00000001 // USB Module Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPCAN register.
//
//*****************************************************************************
#define SYSCTL_PPCAN_P1 0x00000002 // CAN Module 1 Present
#define SYSCTL_PPCAN_P0 0x00000001 // CAN Module 0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPADC register.
//
//*****************************************************************************
#define SYSCTL_PPADC_P1 0x00000002 // ADC Module 1 Present
#define SYSCTL_PPADC_P0 0x00000001 // ADC Module 0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPACMP register.
//
//*****************************************************************************
#define SYSCTL_PPACMP_P0 0x00000001 // Analog Comparator Module Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPPWM register.
//
//*****************************************************************************
#define SYSCTL_PPPWM_P1 0x00000002 // PWM Module 1 Present
#define SYSCTL_PPPWM_P0 0x00000001 // PWM Module 0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPQEI register.
//
//*****************************************************************************
#define SYSCTL_PPQEI_P1 0x00000002 // QEI Module 1 Present
#define SYSCTL_PPQEI_P0 0x00000001 // QEI Module 0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPEEPROM
// register.
//
//*****************************************************************************
#define SYSCTL_PPEEPROM_P0 0x00000001 // EEPROM Module Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPWTIMER
// register.
//
//*****************************************************************************
#define SYSCTL_PPWTIMER_P5 0x00000020 // Wide Timer 5 Present
#define SYSCTL_PPWTIMER_P4 0x00000010 // Wide Timer 4 Present
#define SYSCTL_PPWTIMER_P3 0x00000008 // Wide Timer 3 Present
#define SYSCTL_PPWTIMER_P2 0x00000004 // Wide Timer 2 Present
#define SYSCTL_PPWTIMER_P1 0x00000002 // Wide Timer 1 Present
#define SYSCTL_PPWTIMER_P0 0x00000001 // Wide Timer 0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRWD register.
//
//*****************************************************************************
#define SYSCTL_SRWD_R1 0x00000002 // Watchdog Timer 1 Software Reset
#define SYSCTL_SRWD_R0 0x00000001 // Watchdog Timer 0 Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRTIMER register.
//
//*****************************************************************************
#define SYSCTL_SRTIMER_R5 0x00000020 // Timer 5 Software Reset
#define SYSCTL_SRTIMER_R4 0x00000010 // Timer 4 Software Reset
#define SYSCTL_SRTIMER_R3 0x00000008 // Timer 3 Software Reset
#define SYSCTL_SRTIMER_R2 0x00000004 // Timer 2 Software Reset
#define SYSCTL_SRTIMER_R1 0x00000002 // Timer 1 Software Reset
#define SYSCTL_SRTIMER_R0 0x00000001 // Timer 0 Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRGPIO register.
//
//*****************************************************************************
#define SYSCTL_SRGPIO_R5 0x00000020 // GPIO Port F Software Reset
#define SYSCTL_SRGPIO_R4 0x00000010 // GPIO Port E Software Reset
#define SYSCTL_SRGPIO_R3 0x00000008 // GPIO Port D Software Reset
#define SYSCTL_SRGPIO_R2 0x00000004 // GPIO Port C Software Reset
#define SYSCTL_SRGPIO_R1 0x00000002 // GPIO Port B Software Reset
#define SYSCTL_SRGPIO_R0 0x00000001 // GPIO Port A Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRDMA register.
//
//*****************************************************************************
#define SYSCTL_SRDMA_R0 0x00000001 // uDMA Module Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRHIB register.
//
//*****************************************************************************
#define SYSCTL_SRHIB_R0                                                        \
  0x00000001 // Hibernation Module Software
             // Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRUART register.
//
//*****************************************************************************
#define SYSCTL_SRUART_R7 0x00000080 // UART Module 7 Software Reset
#define SYSCTL_SRUART_R6 0x00000040 // UART Module 6 Software Reset
#define SYSCTL_SRUART_R5 0x00000020 // UART Module 5 Software Reset
#define SYSCTL_SRUART_R4 0x00000010 // UART Module 4 Software Reset
#define SYSCTL_SRUART_R3 0x00000008 // UART Module 3 Software Reset
#define SYSCTL_SRUART_R2 0x00000004 // UART Module 2 Software Reset
#define SYSCTL_SRUART_R1 0x00000002 // UART Module 1 Software Reset
#define SYSCTL_SRUART_R0 0x00000001 // UART Module 0 Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRSSI register.
//
//*****************************************************************************
#define SYSCTL_SRSSI_R3 0x00000008 // SSI Module 3 Software Reset
#define SYSCTL_SRSSI_R2 0x00000004 // SSI Module 2 Software Reset
#define SYSCTL_SRSSI_R1 0x00000002 // SSI Module 1 Software Reset
#define SYSCTL_SRSSI_R0 0x00000001 // SSI Module 0 Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRI2C register.
//
//*****************************************************************************
#define SYSCTL_SRI2C_R3 0x00000008 // I2C Module 3 Software Reset
#define SYSCTL_SRI2C_R2 0x00000004 // I2C Module 2 Software Reset
#define SYSCTL_SRI2C_R1 0x00000002 // I2C Module 1 Software Reset
#define SYSCTL_SRI2C_R0 0x00000001 // I2C Module 0 Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRUSB register.
//
//*****************************************************************************
#define SYSCTL_SRUSB_R0 0x00000001 // USB Module Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRCAN register.
//
//*****************************************************************************
#define SYSCTL_SRCAN_R1 0x00000002 // CAN Module 1 Software Reset
#define SYSCTL_SRCAN_R0 0x00000001 // CAN Module 0 Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRADC register.
//
//*****************************************************************************
#define SYSCTL_SRADC_R1 0x00000002 // ADC Module 1 Software Reset
#define SYSCTL_SRADC_R0 0x00000001 // ADC Module 0 Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRACMP register.
//
//*****************************************************************************
#define SYSCTL_SRACMP_R0                                                       \
  0x00000001 // Analog Comparator Module 0
             // Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRPWM register.
//
//*****************************************************************************
#define SYSCTL_SRPWM_R1 0x00000002 // PWM Module 1 Software Reset
#define SYSCTL_SRPWM_R0 0x00000001 // PWM Module 0 Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRQEI register.
//
//*****************************************************************************
#define SYSCTL_SRQEI_R1 0x00000002 // QEI Module 1 Software Reset
#define SYSCTL_SRQEI_R0 0x00000001 // QEI Module 0 Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SREEPROM
// register.
//
//*****************************************************************************
#define SYSCTL_SREEPROM_R0 0x00000001 // EEPROM Module Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRWTIMER
// register.
//
//*****************************************************************************
#define SYSCTL_SRWTIMER_R5 0x00000020 // Wide Timer 5 Software Reset
#define SYSCTL_SRWTIMER_R4 0x00000010 // Wide Timer 4 Software Reset
#define SYSCTL_SRWTIMER_R3 0x00000008 // Wide Timer 3 Software Reset
#define SYSCTL_SRWTIMER_R2 0x00000004 // Wide Timer 2 Software Reset
#define SYSCTL_SRWTIMER_R1 0x00000002 // Wide Timer 1 Software Reset
#define SYSCTL_SRWTIMER_R0 0x00000001 // Wide Timer 0 Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCWD register.
//
//*****************************************************************************
#define SYSCTL_RCGCWD_R1                                                       \
  0x00000002 // Watchdog Timer 1 Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCWD_R0                                                       \
  0x00000001 // Watchdog Timer 0 Run Mode Clock
             // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCTIMER
// register.
//
//*****************************************************************************
#define SYSCTL_RCGCTIMER_R5                                                    \
  0x00000020 // Timer 5 Run Mode Clock Gating
             // Control
#define SYSCTL_RCGCTIMER_R4                                                    \
  0x00000010 // Timer 4 Run Mode Clock Gating
             // Control
#define SYSCTL_RCGCTIMER_R3                                                    \
  0x00000008 // Timer 3 Run Mode Clock Gating
             // Control
#define SYSCTL_RCGCTIMER_R2                                                    \
  0x00000004 // Timer 2 Run Mode Clock Gating
             // Control
#define SYSCTL_RCGCTIMER_R1                                                    \
  0x00000002 // Timer 1 Run Mode Clock Gating
             // Control
#define SYSCTL_RCGCTIMER_R0                                                    \
  0x00000001 // Timer 0 Run Mode Clock Gating
             // Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCGPIO
// register.
//
//*****************************************************************************
#define SYSCTL_RCGCGPIO_R5                                                     \
  0x00000020 // GPIO Port F Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCGPIO_R4                                                     \
  0x00000010 // GPIO Port E Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCGPIO_R3                                                     \
  0x00000008 // GPIO Port D Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCGPIO_R2                                                     \
  0x00000004 // GPIO Port C Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCGPIO_R1                                                     \
  0x00000002 // GPIO Port B Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCGPIO_R0                                                     \
  0x00000001 // GPIO Port A Run Mode Clock
             // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCDMA register.
//
//*****************************************************************************
#define SYSCTL_RCGCDMA_R0                                                      \
  0x00000001 // uDMA Module Run Mode Clock
             // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCHIB register.
//
//*****************************************************************************
#define SYSCTL_RCGCHIB_R0                                                      \
  0x00000001 // Hibernation Module Run Mode
             // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCUART
// register.
//
//*****************************************************************************
#define SYSCTL_RCGCUART_R7                                                     \
  0x00000080 // UART Module 7 Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCUART_R6                                                     \
  0x00000040 // UART Module 6 Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCUART_R5                                                     \
  0x00000020 // UART Module 5 Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCUART_R4                                                     \
  0x00000010 // UART Module 4 Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCUART_R3                                                     \
  0x00000008 // UART Module 3 Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCUART_R2                                                     \
  0x00000004 // UART Module 2 Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCUART_R1                                                     \
  0x00000002 // UART Module 1 Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCUART_R0                                                     \
  0x00000001 // UART Module 0 Run Mode Clock
             // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCSSI register.
//
//*****************************************************************************
#define SYSCTL_RCGCSSI_R3                                                      \
  0x00000008 // SSI Module 3 Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCSSI_R2                                                      \
  0x00000004 // SSI Module 2 Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCSSI_R1                                                      \
  0x00000002 // SSI Module 1 Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCSSI_R0                                                      \
  0x00000001 // SSI Module 0 Run Mode Clock
             // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCI2C register.
//
//*****************************************************************************
#define SYSCTL_RCGCI2C_R3                                                      \
  0x00000008 // I2C Module 3 Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCI2C_R2                                                      \
  0x00000004 // I2C Module 2 Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCI2C_R1                                                      \
  0x00000002 // I2C Module 1 Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCI2C_R0                                                      \
  0x00000001 // I2C Module 0 Run Mode Clock
             // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCUSB register.
//
//*****************************************************************************
#define SYSCTL_RCGCUSB_R0                                                      \
  0x00000001 // USB Module Run Mode Clock Gating
             // Control

