sethbrad/CprE288-Lab9/REF_tm4c123gh6pm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCCAN register.
//
//*****************************************************************************
#define SYSCTL_RCGCCAN_R1                                                      \
  0x00000002 // CAN Module 1 Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCCAN_R0                                                      \
  0x00000001 // CAN Module 0 Run Mode Clock
             // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCADC register.
//
//*****************************************************************************
#define SYSCTL_RCGCADC_R1                                                      \
  0x00000002 // ADC Module 1 Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCADC_R0                                                      \
  0x00000001 // ADC Module 0 Run Mode Clock
             // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCACMP
// register.
//
//*****************************************************************************
#define SYSCTL_RCGCACMP_R0                                                     \
  0x00000001 // Analog Comparator Module 0 Run
             // Mode Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCPWM register.
//
//*****************************************************************************
#define SYSCTL_RCGCPWM_R1                                                      \
  0x00000002 // PWM Module 1 Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCPWM_R0                                                      \
  0x00000001 // PWM Module 0 Run Mode Clock
             // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCQEI register.
//
//*****************************************************************************
#define SYSCTL_RCGCQEI_R1                                                      \
  0x00000002 // QEI Module 1 Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCQEI_R0                                                      \
  0x00000001 // QEI Module 0 Run Mode Clock
             // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCEEPROM
// register.
//
//*****************************************************************************
#define SYSCTL_RCGCEEPROM_R0                                                   \
  0x00000001 // EEPROM Module Run Mode Clock
             // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCWTIMER
// register.
//
//*****************************************************************************
#define SYSCTL_RCGCWTIMER_R5                                                   \
  0x00000020 // Wide Timer 5 Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCWTIMER_R4                                                   \
  0x00000010 // Wide Timer 4 Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCWTIMER_R3                                                   \
  0x00000008 // Wide Timer 3 Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCWTIMER_R2                                                   \
  0x00000004 // Wide Timer 2 Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCWTIMER_R1                                                   \
  0x00000002 // Wide Timer 1 Run Mode Clock
             // Gating Control
#define SYSCTL_RCGCWTIMER_R0                                                   \
  0x00000001 // Wide Timer 0 Run Mode Clock
             // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCWD register.
//
//*****************************************************************************
#define SYSCTL_SCGCWD_S1                                                       \
  0x00000002 // Watchdog Timer 1 Sleep Mode
             // Clock Gating Control
#define SYSCTL_SCGCWD_S0                                                       \
  0x00000001 // Watchdog Timer 0 Sleep Mode
             // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCTIMER
// register.
//
//*****************************************************************************
#define SYSCTL_SCGCTIMER_S5                                                    \
  0x00000020 // Timer 5 Sleep Mode Clock Gating
             // Control
#define SYSCTL_SCGCTIMER_S4                                                    \
  0x00000010 // Timer 4 Sleep Mode Clock Gating
             // Control
#define SYSCTL_SCGCTIMER_S3                                                    \
  0x00000008 // Timer 3 Sleep Mode Clock Gating
             // Control
#define SYSCTL_SCGCTIMER_S2                                                    \
  0x00000004 // Timer 2 Sleep Mode Clock Gating
             // Control
#define SYSCTL_SCGCTIMER_S1                                                    \
  0x00000002 // Timer 1 Sleep Mode Clock Gating
             // Control
#define SYSCTL_SCGCTIMER_S0                                                    \
  0x00000001 // Timer 0 Sleep Mode Clock Gating
             // Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCGPIO
// register.
//
//*****************************************************************************
#define SYSCTL_SCGCGPIO_S5                                                     \
  0x00000020 // GPIO Port F Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCGPIO_S4                                                     \
  0x00000010 // GPIO Port E Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCGPIO_S3                                                     \
  0x00000008 // GPIO Port D Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCGPIO_S2                                                     \
  0x00000004 // GPIO Port C Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCGPIO_S1                                                     \
  0x00000002 // GPIO Port B Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCGPIO_S0                                                     \
  0x00000001 // GPIO Port A Sleep Mode Clock
             // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCDMA register.
//
//*****************************************************************************
#define SYSCTL_SCGCDMA_S0                                                      \
  0x00000001 // uDMA Module Sleep Mode Clock
             // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCHIB register.
//
//*****************************************************************************
#define SYSCTL_SCGCHIB_S0                                                      \
  0x00000001 // Hibernation Module Sleep Mode
             // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCUART
// register.
//
//*****************************************************************************
#define SYSCTL_SCGCUART_S7                                                     \
  0x00000080 // UART Module 7 Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCUART_S6                                                     \
  0x00000040 // UART Module 6 Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCUART_S5                                                     \
  0x00000020 // UART Module 5 Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCUART_S4                                                     \
  0x00000010 // UART Module 4 Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCUART_S3                                                     \
  0x00000008 // UART Module 3 Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCUART_S2                                                     \
  0x00000004 // UART Module 2 Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCUART_S1                                                     \
  0x00000002 // UART Module 1 Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCUART_S0                                                     \
  0x00000001 // UART Module 0 Sleep Mode Clock
             // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCSSI register.
//
//*****************************************************************************
#define SYSCTL_SCGCSSI_S3                                                      \
  0x00000008 // SSI Module 3 Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCSSI_S2                                                      \
  0x00000004 // SSI Module 2 Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCSSI_S1                                                      \
  0x00000002 // SSI Module 1 Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCSSI_S0                                                      \
  0x00000001 // SSI Module 0 Sleep Mode Clock
             // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCI2C register.
//
//*****************************************************************************
#define SYSCTL_SCGCI2C_S3                                                      \
  0x00000008 // I2C Module 3 Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCI2C_S2                                                      \
  0x00000004 // I2C Module 2 Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCI2C_S1                                                      \
  0x00000002 // I2C Module 1 Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCI2C_S0                                                      \
  0x00000001 // I2C Module 0 Sleep Mode Clock
             // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCUSB register.
//
//*****************************************************************************
#define SYSCTL_SCGCUSB_S0                                                      \
  0x00000001 // USB Module Sleep Mode Clock
             // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCCAN register.
//
//*****************************************************************************
#define SYSCTL_SCGCCAN_S1                                                      \
  0x00000002 // CAN Module 1 Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCCAN_S0                                                      \
  0x00000001 // CAN Module 0 Sleep Mode Clock
             // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCADC register.
//
//*****************************************************************************
#define SYSCTL_SCGCADC_S1                                                      \
  0x00000002 // ADC Module 1 Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCADC_S0                                                      \
  0x00000001 // ADC Module 0 Sleep Mode Clock
             // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCACMP
// register.
//
//*****************************************************************************
#define SYSCTL_SCGCACMP_S0                                                     \
  0x00000001 // Analog Comparator Module 0 Sleep
             // Mode Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCPWM register.
//
//*****************************************************************************
#define SYSCTL_SCGCPWM_S1                                                      \
  0x00000002 // PWM Module 1 Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCPWM_S0                                                      \
  0x00000001 // PWM Module 0 Sleep Mode Clock
             // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCQEI register.
//
//*****************************************************************************
#define SYSCTL_SCGCQEI_S1                                                      \
  0x00000002 // QEI Module 1 Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCQEI_S0                                                      \
  0x00000001 // QEI Module 0 Sleep Mode Clock
             // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCEEPROM
// register.
//
//*****************************************************************************
#define SYSCTL_SCGCEEPROM_S0                                                   \
  0x00000001 // EEPROM Module Sleep Mode Clock
             // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCWTIMER
// register.
//
//*****************************************************************************
#define SYSCTL_SCGCWTIMER_S5                                                   \
  0x00000020 // Wide Timer 5 Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCWTIMER_S4                                                   \
  0x00000010 // Wide Timer 4 Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCWTIMER_S3                                                   \
  0x00000008 // Wide Timer 3 Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCWTIMER_S2                                                   \
  0x00000004 // Wide Timer 2 Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCWTIMER_S1                                                   \
  0x00000002 // Wide Timer 1 Sleep Mode Clock
             // Gating Control
#define SYSCTL_SCGCWTIMER_S0                                                   \
  0x00000001 // Wide Timer 0 Sleep Mode Clock
             // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCWD register.
//
//*****************************************************************************
#define SYSCTL_DCGCWD_D1                                                       \
  0x00000002 // Watchdog Timer 1 Deep-Sleep Mode
             // Clock Gating Control
#define SYSCTL_DCGCWD_D0                                                       \
  0x00000001 // Watchdog Timer 0 Deep-Sleep Mode
             // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCTIMER
// register.
//
//*****************************************************************************
#define SYSCTL_DCGCTIMER_D5                                                    \
  0x00000020 // Timer 5 Deep-Sleep Mode Clock
             // Gating Control
#define SYSCTL_DCGCTIMER_D4                                                    \
  0x00000010 // Timer 4 Deep-Sleep Mode Clock
             // Gating Control
#define SYSCTL_DCGCTIMER_D3                                                    \
  0x00000008 // Timer 3 Deep-Sleep Mode Clock
             // Gating Control
#define SYSCTL_DCGCTIMER_D2                                                    \
  0x00000004 // Timer 2 Deep-Sleep Mode Clock
             // Gating Control
#define SYSCTL_DCGCTIMER_D1                                                    \
  0x00000002 // Timer 1 Deep-Sleep Mode Clock
             // Gating Control
#define SYSCTL_DCGCTIMER_D0                                                    \
  0x00000001 // Timer 0 Deep-Sleep Mode Clock
             // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCGPIO
// register.
//
//*****************************************************************************
#define SYSCTL_DCGCGPIO_D5                                                     \
  0x00000020 // GPIO Port F Deep-Sleep Mode
             // Clock Gating Control
#define SYSCTL_DCGCGPIO_D4                                                     \
  0x00000010 // GPIO Port E Deep-Sleep Mode
             // Clock Gating Control
#define SYSCTL_DCGCGPIO_D3                                                     \
  0x00000008 // GPIO Port D Deep-Sleep Mode
             // Clock Gating Control
#define SYSCTL_DCGCGPIO_D2                                                     \
  0x00000004 // GPIO Port C Deep-Sleep Mode
             // Clock Gating Control
#define SYSCTL_DCGCGPIO_D1                                                     \
  0x00000002 // GPIO Port B Deep-Sleep Mode
             // Clock Gating Control
#define SYSCTL_DCGCGPIO_D0                                                     \
  0x00000001 // GPIO Port A Deep-Sleep Mode
             // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCDMA register.
//
//*****************************************************************************
#define SYSCTL_DCGCDMA_D0                                                      \
  0x00000001 // uDMA Module Deep-Sleep Mode
             // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCHIB register.
//
//*****************************************************************************
#define SYSCTL_DCGCHIB_D0                                                      \
  0x00000001 // Hibernation Module Deep-Sleep
             // Mode Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCUART
// register.
//
//*****************************************************************************
#define SYSCTL_DCGCUART_D7                                                     \
  0x00000080 // UART Module 7 Deep-Sleep Mode
             // Clock Gating Control
#define SYSCTL_DCGCUART_D6                                                     \
  0x00000040 // UART Module 6 Deep-Sleep Mode
             // Clock Gating Control
#define SYSCTL_DCGCUART_D5                                                     \
  0x00000020 // UART Module 5 Deep-Sleep Mode
             // Clock Gating Control
#define SYSCTL_DCGCUART_D4                                                     \
  0x00000010 // UART Module 4 Deep-Sleep Mode
             // Clock Gating Control
#define SYSCTL_DCGCUART_D3                                                     \
  0x00000008 // UART Module 3 Deep-Sleep Mode
             // Clock Gating Control
#define SYSCTL_DCGCUART_D2                                                     \
  0x00000004 // UART Module 2 Deep-Sleep Mode
             // Clock Gating Control
#define SYSCTL_DCGCUART_D1                                                     \
  0x00000002 // UART Module 1 Deep-Sleep Mode
             // Clock Gating Control
#define SYSCTL_DCGCUART_D0                                                     \
  0x00000001 // UART Module 0 Deep-Sleep Mode
             // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCSSI register.
//
//*****************************************************************************
#define SYSCTL_DCGCSSI_D3                                                      \
  0x00000008 // SSI Module 3 Deep-Sleep Mode
             // Clock Gating Control
#define SYSCTL_DCGCSSI_D2                                                      \
  0x00000004 // SSI Module 2 Deep-Sleep Mode
             // Clock Gating Control
#define SYSCTL_DCGCSSI_D1                                                      \
  0x00000002 // SSI Module 1 Deep-Sleep Mode
             // Clock Gating Control
#define SYSCTL_DCGCSSI_D0                                                      \
  0x00000001 // SSI Module 0 Deep-Sleep Mode
             // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCI2C register.
//
//*****************************************************************************
#define SYSCTL_DCGCI2C_D3                                                      \
  0x00000008 // I2C Module 3 Deep-Sleep Mode
             // Clock Gating Control
#define SYSCTL_DCGCI2C_D2                                                      \
  0x00000004 // I2C Module 2 Deep-Sleep Mode
             // Clock Gating Control
#define SYSCTL_DCGCI2C_D1                                                      \
  0x00000002 // I2C Module 1 Deep-Sleep Mode
             // Clock Gating Control
#define SYSCTL_DCGCI2C_D0                                                      \
  0x00000001 // I2C Module 0 Deep-Sleep Mode
             // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCUSB register.
//
//*****************************************************************************
#define SYSCTL_DCGCUSB_D0                                                      \
  0x00000001 // USB Module Deep-Sleep Mode Clock
             // Gating Control

