sethbrad/CprE288-Lab9/REF_tm4c123gh6pm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the UDMA_O_SRCENDP register.
//
//*****************************************************************************
#define UDMA_SRCENDP_ADDR_M 0xFFFFFFFF // Source Address End Pointer
#define UDMA_SRCENDP_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the UDMA_O_DSTENDP register.
//
//*****************************************************************************
#define UDMA_DSTENDP_ADDR_M 0xFFFFFFFF // Destination Address End Pointer
#define UDMA_DSTENDP_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the UDMA_O_CHCTL register.
//
//*****************************************************************************
#define UDMA_CHCTL_DSTINC_M 0xC0000000          // Destination Address Increment
#define UDMA_CHCTL_DSTINC_8 0x00000000          // Byte
#define UDMA_CHCTL_DSTINC_16 0x40000000         // Half-word
#define UDMA_CHCTL_DSTINC_32 0x80000000         // Word
#define UDMA_CHCTL_DSTINC_NONE 0xC0000000       // No increment
#define UDMA_CHCTL_DSTSIZE_M 0x30000000         // Destination Data Size
#define UDMA_CHCTL_DSTSIZE_8 0x00000000         // Byte
#define UDMA_CHCTL_DSTSIZE_16 0x10000000        // Half-word
#define UDMA_CHCTL_DSTSIZE_32 0x20000000        // Word
#define UDMA_CHCTL_SRCINC_M 0x0C000000          // Source Address Increment
#define UDMA_CHCTL_SRCINC_8 0x00000000          // Byte
#define UDMA_CHCTL_SRCINC_16 0x04000000         // Half-word
#define UDMA_CHCTL_SRCINC_32 0x08000000         // Word
#define UDMA_CHCTL_SRCINC_NONE 0x0C000000       // No increment
#define UDMA_CHCTL_SRCSIZE_M 0x03000000         // Source Data Size
#define UDMA_CHCTL_SRCSIZE_8 0x00000000         // Byte
#define UDMA_CHCTL_SRCSIZE_16 0x01000000        // Half-word
#define UDMA_CHCTL_SRCSIZE_32 0x02000000        // Word
#define UDMA_CHCTL_ARBSIZE_M 0x0003C000         // Arbitration Size
#define UDMA_CHCTL_ARBSIZE_1 0x00000000         // 1 Transfer
#define UDMA_CHCTL_ARBSIZE_2 0x00004000         // 2 Transfers
#define UDMA_CHCTL_ARBSIZE_4 0x00008000         // 4 Transfers
#define UDMA_CHCTL_ARBSIZE_8 0x0000C000         // 8 Transfers
#define UDMA_CHCTL_ARBSIZE_16 0x00010000        // 16 Transfers
#define UDMA_CHCTL_ARBSIZE_32 0x00014000        // 32 Transfers
#define UDMA_CHCTL_ARBSIZE_64 0x00018000        // 64 Transfers
#define UDMA_CHCTL_ARBSIZE_128 0x0001C000       // 128 Transfers
#define UDMA_CHCTL_ARBSIZE_256 0x00020000       // 256 Transfers
#define UDMA_CHCTL_ARBSIZE_512 0x00024000       // 512 Transfers
#define UDMA_CHCTL_ARBSIZE_1024 0x00028000      // 1024 Transfers
#define UDMA_CHCTL_XFERSIZE_M 0x00003FF0        // Transfer Size (minus 1)
#define UDMA_CHCTL_NXTUSEBURST 0x00000008       // Next Useburst
#define UDMA_CHCTL_XFERMODE_M 0x00000007        // uDMA Transfer Mode
#define UDMA_CHCTL_XFERMODE_STOP 0x00000000     // Stop
#define UDMA_CHCTL_XFERMODE_BASIC 0x00000001    // Basic
#define UDMA_CHCTL_XFERMODE_AUTO 0x00000002     // Auto-Request
#define UDMA_CHCTL_XFERMODE_PINGPONG 0x00000003 // Ping-Pong
#define UDMA_CHCTL_XFERMODE_MEM_SG 0x00000004   // Memory Scatter-Gather
#define UDMA_CHCTL_XFERMODE_MEM_SGA                                            \
  0x00000005                                  // Alternate Memory Scatter-Gather
#define UDMA_CHCTL_XFERMODE_PER_SG 0x00000006 // Peripheral Scatter-Gather
#define UDMA_CHCTL_XFERMODE_PER_SGA                                            \
  0x00000007 // Alternate Peripheral
             // Scatter-Gather
#define UDMA_CHCTL_XFERSIZE_S 4

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_ACTLR register.
//
//*****************************************************************************
#define NVIC_ACTLR_DISOOFP                                                     \
  0x00000200                          // Disable Out-Of-Order Floating
                                      // Point
#define NVIC_ACTLR_DISFPCA 0x00000100 // Disable CONTROL
#define NVIC_ACTLR_DISFOLD 0x00000004 // Disable IT Folding
#define NVIC_ACTLR_DISWBUF 0x00000002 // Disable Write Buffer
#define NVIC_ACTLR_DISMCYC                                                     \
  0x00000001 // Disable Interrupts of Multiple
             // Cycle Instructions

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_ST_CTRL register.
//
//*****************************************************************************
#define NVIC_ST_CTRL_COUNT 0x00010000   // Count Flag
#define NVIC_ST_CTRL_CLK_SRC 0x00000004 // Clock Source
#define NVIC_ST_CTRL_INTEN 0x00000002   // Interrupt Enable
#define NVIC_ST_CTRL_ENABLE 0x00000001  // Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_ST_RELOAD register.
//
//*****************************************************************************
#define NVIC_ST_RELOAD_M 0x00FFFFFF // Reload Value
#define NVIC_ST_RELOAD_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_ST_CURRENT
// register.
//
//*****************************************************************************
#define NVIC_ST_CURRENT_M 0x00FFFFFF // Current Value
#define NVIC_ST_CURRENT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_EN0 register.
//
//*****************************************************************************
#define NVIC_EN0_INT_M 0xFFFFFFFF // Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_EN1 register.
//
//*****************************************************************************
#define NVIC_EN1_INT_M 0xFFFFFFFF // Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_EN2 register.
//
//*****************************************************************************
#define NVIC_EN2_INT_M 0xFFFFFFFF // Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_EN3 register.
//
//*****************************************************************************
#define NVIC_EN3_INT_M 0xFFFFFFFF // Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_EN4 register.
//
//*****************************************************************************
#define NVIC_EN4_INT_M 0x000007FF // Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_DIS0 register.
//
//*****************************************************************************
#define NVIC_DIS0_INT_M 0xFFFFFFFF // Interrupt Disable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_DIS1 register.
//
//*****************************************************************************
#define NVIC_DIS1_INT_M 0xFFFFFFFF // Interrupt Disable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_DIS2 register.
//
//*****************************************************************************
#define NVIC_DIS2_INT_M 0xFFFFFFFF // Interrupt Disable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_DIS3 register.
//
//*****************************************************************************
#define NVIC_DIS3_INT_M 0xFFFFFFFF // Interrupt Disable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_DIS4 register.
//
//*****************************************************************************
#define NVIC_DIS4_INT_M 0x000007FF // Interrupt Disable

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PEND0 register.
//
//*****************************************************************************
#define NVIC_PEND0_INT_M 0xFFFFFFFF // Interrupt Set Pending

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PEND1 register.
//
//*****************************************************************************
#define NVIC_PEND1_INT_M 0xFFFFFFFF // Interrupt Set Pending

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PEND2 register.
//
//*****************************************************************************
#define NVIC_PEND2_INT_M 0xFFFFFFFF // Interrupt Set Pending

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PEND3 register.
//
//*****************************************************************************
#define NVIC_PEND3_INT_M 0xFFFFFFFF // Interrupt Set Pending

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PEND4 register.
//
//*****************************************************************************
#define NVIC_PEND4_INT_M 0x000007FF // Interrupt Set Pending

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_UNPEND0 register.
//
//*****************************************************************************
#define NVIC_UNPEND0_INT_M 0xFFFFFFFF // Interrupt Clear Pending

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_UNPEND1 register.
//
//*****************************************************************************
#define NVIC_UNPEND1_INT_M 0xFFFFFFFF // Interrupt Clear Pending

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_UNPEND2 register.
//
//*****************************************************************************
#define NVIC_UNPEND2_INT_M 0xFFFFFFFF // Interrupt Clear Pending

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_UNPEND3 register.
//
//*****************************************************************************
#define NVIC_UNPEND3_INT_M 0xFFFFFFFF // Interrupt Clear Pending

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_UNPEND4 register.
//
//*****************************************************************************
#define NVIC_UNPEND4_INT_M 0x000007FF // Interrupt Clear Pending

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_ACTIVE0 register.
//
//*****************************************************************************
#define NVIC_ACTIVE0_INT_M 0xFFFFFFFF // Interrupt Active

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_ACTIVE1 register.
//
//*****************************************************************************
#define NVIC_ACTIVE1_INT_M 0xFFFFFFFF // Interrupt Active

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_ACTIVE2 register.
//
//*****************************************************************************
#define NVIC_ACTIVE2_INT_M 0xFFFFFFFF // Interrupt Active

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_ACTIVE3 register.
//
//*****************************************************************************
#define NVIC_ACTIVE3_INT_M 0xFFFFFFFF // Interrupt Active

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_ACTIVE4 register.
//
//*****************************************************************************
#define NVIC_ACTIVE4_INT_M 0x000007FF // Interrupt Active

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI0 register.
//
//*****************************************************************************
#define NVIC_PRI0_INT3_M 0xE0000000 // Interrupt 3 Priority Mask
#define NVIC_PRI0_INT2_M 0x00E00000 // Interrupt 2 Priority Mask
#define NVIC_PRI0_INT1_M 0x0000E000 // Interrupt 1 Priority Mask
#define NVIC_PRI0_INT0_M 0x000000E0 // Interrupt 0 Priority Mask
#define NVIC_PRI0_INT3_S 29
#define NVIC_PRI0_INT2_S 21
#define NVIC_PRI0_INT1_S 13
#define NVIC_PRI0_INT0_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI1 register.
//
//*****************************************************************************
#define NVIC_PRI1_INT7_M 0xE0000000 // Interrupt 7 Priority Mask
#define NVIC_PRI1_INT6_M 0x00E00000 // Interrupt 6 Priority Mask
#define NVIC_PRI1_INT5_M 0x0000E000 // Interrupt 5 Priority Mask
#define NVIC_PRI1_INT4_M 0x000000E0 // Interrupt 4 Priority Mask
#define NVIC_PRI1_INT7_S 29
#define NVIC_PRI1_INT6_S 21
#define NVIC_PRI1_INT5_S 13
#define NVIC_PRI1_INT4_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI2 register.
//
//*****************************************************************************
#define NVIC_PRI2_INT11_M 0xE0000000 // Interrupt 11 Priority Mask
#define NVIC_PRI2_INT10_M 0x00E00000 // Interrupt 10 Priority Mask
#define NVIC_PRI2_INT9_M 0x0000E000  // Interrupt 9 Priority Mask
#define NVIC_PRI2_INT8_M 0x000000E0  // Interrupt 8 Priority Mask
#define NVIC_PRI2_INT11_S 29
#define NVIC_PRI2_INT10_S 21
#define NVIC_PRI2_INT9_S 13
#define NVIC_PRI2_INT8_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI3 register.
//
//*****************************************************************************
#define NVIC_PRI3_INT15_M 0xE0000000 // Interrupt 15 Priority Mask
#define NVIC_PRI3_INT14_M 0x00E00000 // Interrupt 14 Priority Mask
#define NVIC_PRI3_INT13_M 0x0000E000 // Interrupt 13 Priority Mask
#define NVIC_PRI3_INT12_M 0x000000E0 // Interrupt 12 Priority Mask
#define NVIC_PRI3_INT15_S 29
#define NVIC_PRI3_INT14_S 21
#define NVIC_PRI3_INT13_S 13
#define NVIC_PRI3_INT12_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI4 register.
//
//*****************************************************************************
#define NVIC_PRI4_INT19_M 0xE0000000 // Interrupt 19 Priority Mask
#define NVIC_PRI4_INT18_M 0x00E00000 // Interrupt 18 Priority Mask
#define NVIC_PRI4_INT17_M 0x0000E000 // Interrupt 17 Priority Mask
#define NVIC_PRI4_INT16_M 0x000000E0 // Interrupt 16 Priority Mask
#define NVIC_PRI4_INT19_S 29
#define NVIC_PRI4_INT18_S 21
#define NVIC_PRI4_INT17_S 13
#define NVIC_PRI4_INT16_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI5 register.
//
//*****************************************************************************
#define NVIC_PRI5_INT23_M 0xE0000000 // Interrupt 23 Priority Mask
#define NVIC_PRI5_INT22_M 0x00E00000 // Interrupt 22 Priority Mask
#define NVIC_PRI5_INT21_M 0x0000E000 // Interrupt 21 Priority Mask
#define NVIC_PRI5_INT20_M 0x000000E0 // Interrupt 20 Priority Mask
#define NVIC_PRI5_INT23_S 29
#define NVIC_PRI5_INT22_S 21
#define NVIC_PRI5_INT21_S 13
#define NVIC_PRI5_INT20_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI6 register.
//
//*****************************************************************************
#define NVIC_PRI6_INT27_M 0xE0000000 // Interrupt 27 Priority Mask
#define NVIC_PRI6_INT26_M 0x00E00000 // Interrupt 26 Priority Mask
#define NVIC_PRI6_INT25_M 0x0000E000 // Interrupt 25 Priority Mask
#define NVIC_PRI6_INT24_M 0x000000E0 // Interrupt 24 Priority Mask
#define NVIC_PRI6_INT27_S 29
#define NVIC_PRI6_INT26_S 21
#define NVIC_PRI6_INT25_S 13
#define NVIC_PRI6_INT24_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI7 register.
//
//*****************************************************************************
#define NVIC_PRI7_INT31_M 0xE0000000 // Interrupt 31 Priority Mask
#define NVIC_PRI7_INT30_M 0x00E00000 // Interrupt 30 Priority Mask
#define NVIC_PRI7_INT29_M 0x0000E000 // Interrupt 29 Priority Mask
#define NVIC_PRI7_INT28_M 0x000000E0 // Interrupt 28 Priority Mask
#define NVIC_PRI7_INT31_S 29
#define NVIC_PRI7_INT30_S 21
#define NVIC_PRI7_INT29_S 13
#define NVIC_PRI7_INT28_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI8 register.
//
//*****************************************************************************
#define NVIC_PRI8_INT35_M 0xE0000000 // Interrupt 35 Priority Mask
#define NVIC_PRI8_INT34_M 0x00E00000 // Interrupt 34 Priority Mask
#define NVIC_PRI8_INT33_M 0x0000E000 // Interrupt 33 Priority Mask
#define NVIC_PRI8_INT32_M 0x000000E0 // Interrupt 32 Priority Mask
#define NVIC_PRI8_INT35_S 29
#define NVIC_PRI8_INT34_S 21
#define NVIC_PRI8_INT33_S 13
#define NVIC_PRI8_INT32_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI9 register.
//
//*****************************************************************************
#define NVIC_PRI9_INT39_M 0xE0000000 // Interrupt 39 Priority Mask
#define NVIC_PRI9_INT38_M 0x00E00000 // Interrupt 38 Priority Mask
#define NVIC_PRI9_INT37_M 0x0000E000 // Interrupt 37 Priority Mask
#define NVIC_PRI9_INT36_M 0x000000E0 // Interrupt 36 Priority Mask
#define NVIC_PRI9_INT39_S 29
#define NVIC_PRI9_INT38_S 21
#define NVIC_PRI9_INT37_S 13
#define NVIC_PRI9_INT36_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI10 register.
//
//*****************************************************************************
#define NVIC_PRI10_INT43_M 0xE0000000 // Interrupt 43 Priority Mask
#define NVIC_PRI10_INT42_M 0x00E00000 // Interrupt 42 Priority Mask
#define NVIC_PRI10_INT41_M 0x0000E000 // Interrupt 41 Priority Mask
#define NVIC_PRI10_INT40_M 0x000000E0 // Interrupt 40 Priority Mask
#define NVIC_PRI10_INT43_S 29
#define NVIC_PRI10_INT42_S 21
#define NVIC_PRI10_INT41_S 13
#define NVIC_PRI10_INT40_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI11 register.
//
//*****************************************************************************
#define NVIC_PRI11_INT47_M 0xE0000000 // Interrupt 47 Priority Mask
#define NVIC_PRI11_INT46_M 0x00E00000 // Interrupt 46 Priority Mask
#define NVIC_PRI11_INT45_M 0x0000E000 // Interrupt 45 Priority Mask
#define NVIC_PRI11_INT44_M 0x000000E0 // Interrupt 44 Priority Mask
#define NVIC_PRI11_INT47_S 29
#define NVIC_PRI11_INT46_S 21
#define NVIC_PRI11_INT45_S 13
#define NVIC_PRI11_INT44_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI12 register.
//
//*****************************************************************************
#define NVIC_PRI12_INT51_M 0xE0000000 // Interrupt 51 Priority Mask
#define NVIC_PRI12_INT50_M 0x00E00000 // Interrupt 50 Priority Mask
#define NVIC_PRI12_INT49_M 0x0000E000 // Interrupt 49 Priority Mask
#define NVIC_PRI12_INT48_M 0x000000E0 // Interrupt 48 Priority Mask
#define NVIC_PRI12_INT51_S 29
#define NVIC_PRI12_INT50_S 21
#define NVIC_PRI12_INT49_S 13
#define NVIC_PRI12_INT48_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI13 register.
//
//*****************************************************************************
#define NVIC_PRI13_INT55_M 0xE0000000 // Interrupt 55 Priority Mask
#define NVIC_PRI13_INT54_M 0x00E00000 // Interrupt 54 Priority Mask
#define NVIC_PRI13_INT53_M 0x0000E000 // Interrupt 53 Priority Mask
#define NVIC_PRI13_INT52_M 0x000000E0 // Interrupt 52 Priority Mask
#define NVIC_PRI13_INT55_S 29
#define NVIC_PRI13_INT54_S 21
#define NVIC_PRI13_INT53_S 13
#define NVIC_PRI13_INT52_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI14 register.
//
//*****************************************************************************
#define NVIC_PRI14_INTD_M 0xE0000000 // Interrupt 59 Priority Mask
#define NVIC_PRI14_INTC_M 0x00E00000 // Interrupt 58 Priority Mask
#define NVIC_PRI14_INTB_M 0x0000E000 // Interrupt 57 Priority Mask
#define NVIC_PRI14_INTA_M 0x000000E0 // Interrupt 56 Priority Mask
#define NVIC_PRI14_INTD_S 29
#define NVIC_PRI14_INTC_S 21
#define NVIC_PRI14_INTB_S 13
#define NVIC_PRI14_INTA_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI15 register.
//
//*****************************************************************************
#define NVIC_PRI15_INTD_M 0xE0000000 // Interrupt 63 Priority Mask
#define NVIC_PRI15_INTC_M 0x00E00000 // Interrupt 62 Priority Mask
#define NVIC_PRI15_INTB_M 0x0000E000 // Interrupt 61 Priority Mask
#define NVIC_PRI15_INTA_M 0x000000E0 // Interrupt 60 Priority Mask
#define NVIC_PRI15_INTD_S 29
#define NVIC_PRI15_INTC_S 21
#define NVIC_PRI15_INTB_S 13
#define NVIC_PRI15_INTA_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI16 register.
//
//*****************************************************************************
#define NVIC_PRI16_INTD_M 0xE0000000 // Interrupt 67 Priority Mask
#define NVIC_PRI16_INTC_M 0x00E00000 // Interrupt 66 Priority Mask
#define NVIC_PRI16_INTB_M 0x0000E000 // Interrupt 65 Priority Mask
#define NVIC_PRI16_INTA_M 0x000000E0 // Interrupt 64 Priority Mask
#define NVIC_PRI16_INTD_S 29
#define NVIC_PRI16_INTC_S 21
#define NVIC_PRI16_INTB_S 13
#define NVIC_PRI16_INTA_S 5

