sethbrad/CprE288-Lab9/REF_tm4c123gh6pm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI17 register.
//
//*****************************************************************************
#define NVIC_PRI17_INTD_M 0xE0000000 // Interrupt 71 Priority Mask
#define NVIC_PRI17_INTC_M 0x00E00000 // Interrupt 70 Priority Mask
#define NVIC_PRI17_INTB_M 0x0000E000 // Interrupt 69 Priority Mask
#define NVIC_PRI17_INTA_M 0x000000E0 // Interrupt 68 Priority Mask
#define NVIC_PRI17_INTD_S 29
#define NVIC_PRI17_INTC_S 21
#define NVIC_PRI17_INTB_S 13
#define NVIC_PRI17_INTA_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI18 register.
//
//*****************************************************************************
#define NVIC_PRI18_INTD_M 0xE0000000 // Interrupt 75 Priority Mask
#define NVIC_PRI18_INTC_M 0x00E00000 // Interrupt 74 Priority Mask
#define NVIC_PRI18_INTB_M 0x0000E000 // Interrupt 73 Priority Mask
#define NVIC_PRI18_INTA_M 0x000000E0 // Interrupt 72 Priority Mask
#define NVIC_PRI18_INTD_S 29
#define NVIC_PRI18_INTC_S 21
#define NVIC_PRI18_INTB_S 13
#define NVIC_PRI18_INTA_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI19 register.
//
//*****************************************************************************
#define NVIC_PRI19_INTD_M 0xE0000000 // Interrupt 79 Priority Mask
#define NVIC_PRI19_INTC_M 0x00E00000 // Interrupt 78 Priority Mask
#define NVIC_PRI19_INTB_M 0x0000E000 // Interrupt 77 Priority Mask
#define NVIC_PRI19_INTA_M 0x000000E0 // Interrupt 76 Priority Mask
#define NVIC_PRI19_INTD_S 29
#define NVIC_PRI19_INTC_S 21
#define NVIC_PRI19_INTB_S 13
#define NVIC_PRI19_INTA_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI20 register.
//
//*****************************************************************************
#define NVIC_PRI20_INTD_M 0xE0000000 // Interrupt 83 Priority Mask
#define NVIC_PRI20_INTC_M 0x00E00000 // Interrupt 82 Priority Mask
#define NVIC_PRI20_INTB_M 0x0000E000 // Interrupt 81 Priority Mask
#define NVIC_PRI20_INTA_M 0x000000E0 // Interrupt 80 Priority Mask
#define NVIC_PRI20_INTD_S 29
#define NVIC_PRI20_INTC_S 21
#define NVIC_PRI20_INTB_S 13
#define NVIC_PRI20_INTA_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI21 register.
//
//*****************************************************************************
#define NVIC_PRI21_INTD_M 0xE0000000 // Interrupt 87 Priority Mask
#define NVIC_PRI21_INTC_M 0x00E00000 // Interrupt 86 Priority Mask
#define NVIC_PRI21_INTB_M 0x0000E000 // Interrupt 85 Priority Mask
#define NVIC_PRI21_INTA_M 0x000000E0 // Interrupt 84 Priority Mask
#define NVIC_PRI21_INTD_S 29
#define NVIC_PRI21_INTC_S 21
#define NVIC_PRI21_INTB_S 13
#define NVIC_PRI21_INTA_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI22 register.
//
//*****************************************************************************
#define NVIC_PRI22_INTD_M 0xE0000000 // Interrupt 91 Priority Mask
#define NVIC_PRI22_INTC_M 0x00E00000 // Interrupt 90 Priority Mask
#define NVIC_PRI22_INTB_M 0x0000E000 // Interrupt 89 Priority Mask
#define NVIC_PRI22_INTA_M 0x000000E0 // Interrupt 88 Priority Mask
#define NVIC_PRI22_INTD_S 29
#define NVIC_PRI22_INTC_S 21
#define NVIC_PRI22_INTB_S 13
#define NVIC_PRI22_INTA_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI23 register.
//
//*****************************************************************************
#define NVIC_PRI23_INTD_M 0xE0000000 // Interrupt 95 Priority Mask
#define NVIC_PRI23_INTC_M 0x00E00000 // Interrupt 94 Priority Mask
#define NVIC_PRI23_INTB_M 0x0000E000 // Interrupt 93 Priority Mask
#define NVIC_PRI23_INTA_M 0x000000E0 // Interrupt 92 Priority Mask
#define NVIC_PRI23_INTD_S 29
#define NVIC_PRI23_INTC_S 21
#define NVIC_PRI23_INTB_S 13
#define NVIC_PRI23_INTA_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI24 register.
//
//*****************************************************************************
#define NVIC_PRI24_INTD_M 0xE0000000 // Interrupt 99 Priority Mask
#define NVIC_PRI24_INTC_M 0x00E00000 // Interrupt 98 Priority Mask
#define NVIC_PRI24_INTB_M 0x0000E000 // Interrupt 97 Priority Mask
#define NVIC_PRI24_INTA_M 0x000000E0 // Interrupt 96 Priority Mask
#define NVIC_PRI24_INTD_S 29
#define NVIC_PRI24_INTC_S 21
#define NVIC_PRI24_INTB_S 13
#define NVIC_PRI24_INTA_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI25 register.
//
//*****************************************************************************
#define NVIC_PRI25_INTD_M 0xE0000000 // Interrupt 103 Priority Mask
#define NVIC_PRI25_INTC_M 0x00E00000 // Interrupt 102 Priority Mask
#define NVIC_PRI25_INTB_M 0x0000E000 // Interrupt 101 Priority Mask
#define NVIC_PRI25_INTA_M 0x000000E0 // Interrupt 100 Priority Mask
#define NVIC_PRI25_INTD_S 29
#define NVIC_PRI25_INTC_S 21
#define NVIC_PRI25_INTB_S 13
#define NVIC_PRI25_INTA_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI26 register.
//
//*****************************************************************************
#define NVIC_PRI26_INTD_M 0xE0000000 // Interrupt 107 Priority Mask
#define NVIC_PRI26_INTC_M 0x00E00000 // Interrupt 106 Priority Mask
#define NVIC_PRI26_INTB_M 0x0000E000 // Interrupt 105 Priority Mask
#define NVIC_PRI26_INTA_M 0x000000E0 // Interrupt 104 Priority Mask
#define NVIC_PRI26_INTD_S 29
#define NVIC_PRI26_INTC_S 21
#define NVIC_PRI26_INTB_S 13
#define NVIC_PRI26_INTA_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI27 register.
//
//*****************************************************************************
#define NVIC_PRI27_INTD_M 0xE0000000 // Interrupt 111 Priority Mask
#define NVIC_PRI27_INTC_M 0x00E00000 // Interrupt 110 Priority Mask
#define NVIC_PRI27_INTB_M 0x0000E000 // Interrupt 109 Priority Mask
#define NVIC_PRI27_INTA_M 0x000000E0 // Interrupt 108 Priority Mask
#define NVIC_PRI27_INTD_S 29
#define NVIC_PRI27_INTC_S 21
#define NVIC_PRI27_INTB_S 13
#define NVIC_PRI27_INTA_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI28 register.
//
//*****************************************************************************
#define NVIC_PRI28_INTD_M 0xE0000000 // Interrupt 115 Priority Mask
#define NVIC_PRI28_INTC_M 0x00E00000 // Interrupt 114 Priority Mask
#define NVIC_PRI28_INTB_M 0x0000E000 // Interrupt 113 Priority Mask
#define NVIC_PRI28_INTA_M 0x000000E0 // Interrupt 112 Priority Mask
#define NVIC_PRI28_INTD_S 29
#define NVIC_PRI28_INTC_S 21
#define NVIC_PRI28_INTB_S 13
#define NVIC_PRI28_INTA_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI29 register.
//
//*****************************************************************************
#define NVIC_PRI29_INTD_M 0xE0000000 // Interrupt 119 Priority Mask
#define NVIC_PRI29_INTC_M 0x00E00000 // Interrupt 118 Priority Mask
#define NVIC_PRI29_INTB_M 0x0000E000 // Interrupt 117 Priority Mask
#define NVIC_PRI29_INTA_M 0x000000E0 // Interrupt 116 Priority Mask
#define NVIC_PRI29_INTD_S 29
#define NVIC_PRI29_INTC_S 21
#define NVIC_PRI29_INTB_S 13
#define NVIC_PRI29_INTA_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI30 register.
//
//*****************************************************************************
#define NVIC_PRI30_INTD_M 0xE0000000 // Interrupt 123 Priority Mask
#define NVIC_PRI30_INTC_M 0x00E00000 // Interrupt 122 Priority Mask
#define NVIC_PRI30_INTB_M 0x0000E000 // Interrupt 121 Priority Mask
#define NVIC_PRI30_INTA_M 0x000000E0 // Interrupt 120 Priority Mask
#define NVIC_PRI30_INTD_S 29
#define NVIC_PRI30_INTC_S 21
#define NVIC_PRI30_INTB_S 13
#define NVIC_PRI30_INTA_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI31 register.
//
//*****************************************************************************
#define NVIC_PRI31_INTD_M 0xE0000000 // Interrupt 127 Priority Mask
#define NVIC_PRI31_INTC_M 0x00E00000 // Interrupt 126 Priority Mask
#define NVIC_PRI31_INTB_M 0x0000E000 // Interrupt 125 Priority Mask
#define NVIC_PRI31_INTA_M 0x000000E0 // Interrupt 124 Priority Mask
#define NVIC_PRI31_INTD_S 29
#define NVIC_PRI31_INTC_S 21
#define NVIC_PRI31_INTB_S 13
#define NVIC_PRI31_INTA_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI32 register.
//
//*****************************************************************************
#define NVIC_PRI32_INTD_M 0xE0000000 // Interrupt 131 Priority Mask
#define NVIC_PRI32_INTC_M 0x00E00000 // Interrupt 130 Priority Mask
#define NVIC_PRI32_INTB_M 0x0000E000 // Interrupt 129 Priority Mask
#define NVIC_PRI32_INTA_M 0x000000E0 // Interrupt 128 Priority Mask
#define NVIC_PRI32_INTD_S 29
#define NVIC_PRI32_INTC_S 21
#define NVIC_PRI32_INTB_S 13
#define NVIC_PRI32_INTA_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI33 register.
//
//*****************************************************************************
#define NVIC_PRI33_INTD_M                                                      \
  0xE0000000 // Interrupt Priority for Interrupt
             // [4n+3]
#define NVIC_PRI33_INTC_M                                                      \
  0x00E00000 // Interrupt Priority for Interrupt
             // [4n+2]
#define NVIC_PRI33_INTB_M                                                      \
  0x0000E000 // Interrupt Priority for Interrupt
             // [4n+1]
#define NVIC_PRI33_INTA_M                                                      \
  0x000000E0 // Interrupt Priority for Interrupt
             // [4n]
#define NVIC_PRI33_INTD_S 29
#define NVIC_PRI33_INTC_S 21
#define NVIC_PRI33_INTB_S 13
#define NVIC_PRI33_INTA_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_PRI34 register.
//
//*****************************************************************************
#define NVIC_PRI34_INTD_M                                                      \
  0xE0000000 // Interrupt Priority for Interrupt
             // [4n+3]
#define NVIC_PRI34_INTC_M                                                      \
  0x00E00000 // Interrupt Priority for Interrupt
             // [4n+2]
#define NVIC_PRI34_INTB_M                                                      \
  0x0000E000 // Interrupt Priority for Interrupt
             // [4n+1]
#define NVIC_PRI34_INTA_M                                                      \
  0x000000E0 // Interrupt Priority for Interrupt
             // [4n]
#define NVIC_PRI34_INTD_S 29
#define NVIC_PRI34_INTC_S 21
#define NVIC_PRI34_INTB_S 13
#define NVIC_PRI34_INTA_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_CPUID register.
//
//*****************************************************************************
#define NVIC_CPUID_IMP_M 0xFF000000      // Implementer Code
#define NVIC_CPUID_IMP_ARM 0x41000000    // ARM
#define NVIC_CPUID_VAR_M 0x00F00000      // Variant Number
#define NVIC_CPUID_CON_M 0x000F0000      // Constant
#define NVIC_CPUID_PARTNO_M 0x0000FFF0   // Part Number
#define NVIC_CPUID_PARTNO_CM4 0x0000C240 // Cortex-M4 processor
#define NVIC_CPUID_REV_M 0x0000000F      // Revision Number

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_INT_CTRL register.
//
//*****************************************************************************
#define NVIC_INT_CTRL_NMI_SET 0x80000000      // NMI Set Pending
#define NVIC_INT_CTRL_PEND_SV 0x10000000      // PendSV Set Pending
#define NVIC_INT_CTRL_UNPEND_SV 0x08000000    // PendSV Clear Pending
#define NVIC_INT_CTRL_PENDSTSET 0x04000000    // SysTick Set Pending
#define NVIC_INT_CTRL_PENDSTCLR 0x02000000    // SysTick Clear Pending
#define NVIC_INT_CTRL_ISR_PRE 0x00800000      // Debug Interrupt Handling
#define NVIC_INT_CTRL_ISR_PEND 0x00400000     // Interrupt Pending
#define NVIC_INT_CTRL_VEC_PEN_M 0x000FF000    // Interrupt Pending Vector Number
#define NVIC_INT_CTRL_VEC_PEN_NMI 0x00002000  // NMI
#define NVIC_INT_CTRL_VEC_PEN_HARD 0x00003000 // Hard fault
#define NVIC_INT_CTRL_VEC_PEN_MEM 0x00004000  // Memory management fault
#define NVIC_INT_CTRL_VEC_PEN_BUS 0x00005000  // Bus fault
#define NVIC_INT_CTRL_VEC_PEN_USG 0x00006000  // Usage fault
#define NVIC_INT_CTRL_VEC_PEN_SVC 0x0000B000  // SVCall
#define NVIC_INT_CTRL_VEC_PEN_PNDSV 0x0000E000 // PendSV
#define NVIC_INT_CTRL_VEC_PEN_TICK 0x0000F000  // SysTick
#define NVIC_INT_CTRL_RET_BASE 0x00000800      // Return to Base
#define NVIC_INT_CTRL_VEC_ACT_M 0x000000FF // Interrupt Pending Vector Number
#define NVIC_INT_CTRL_VEC_ACT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_VTABLE register.
//
//*****************************************************************************
#define NVIC_VTABLE_BASE 0x20000000     // Vector Table Base
#define NVIC_VTABLE_OFFSET_M 0x1FFFFC00 // Vector Table Offset
#define NVIC_VTABLE_OFFSET_S 10

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_APINT register.
//
//*****************************************************************************
#define NVIC_APINT_VECTKEY_M 0xFFFF0000    // Register Key
#define NVIC_APINT_VECTKEY 0x05FA0000      // Vector key
#define NVIC_APINT_ENDIANESS 0x00008000    // Data Endianess
#define NVIC_APINT_PRIGROUP_M 0x00000700   // Interrupt Priority Grouping
#define NVIC_APINT_PRIGROUP_7_1 0x00000000 // Priority group 7.1 split
#define NVIC_APINT_PRIGROUP_6_2 0x00000100 // Priority group 6.2 split
#define NVIC_APINT_PRIGROUP_5_3 0x00000200 // Priority group 5.3 split
#define NVIC_APINT_PRIGROUP_4_4 0x00000300 // Priority group 4.4 split
#define NVIC_APINT_PRIGROUP_3_5 0x00000400 // Priority group 3.5 split
#define NVIC_APINT_PRIGROUP_2_6 0x00000500 // Priority group 2.6 split
#define NVIC_APINT_PRIGROUP_1_7 0x00000600 // Priority group 1.7 split
#define NVIC_APINT_PRIGROUP_0_8 0x00000700 // Priority group 0.8 split
#define NVIC_APINT_SYSRESETREQ 0x00000004  // System Reset Request
#define NVIC_APINT_VECT_CLR_ACT 0x00000002 // Clear Active NMI / Fault
#define NVIC_APINT_VECT_RESET 0x00000001   // System Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_SYS_CTRL register.
//
//*****************************************************************************
#define NVIC_SYS_CTRL_SEVONPEND 0x00000010 // Wake Up on Pending
#define NVIC_SYS_CTRL_SLEEPDEEP 0x00000004 // Deep Sleep Enable
#define NVIC_SYS_CTRL_SLEEPEXIT 0x00000002 // Sleep on ISR Exit

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_CFG_CTRL register.
//
//*****************************************************************************
#define NVIC_CFG_CTRL_STKALIGN                                                 \
  0x00000200 // Stack Alignment on Exception
             // Entry
#define NVIC_CFG_CTRL_BFHFNMIGN                                                \
  0x00000100                               // Ignore Bus Fault in NMI and
                                           // Fault
#define NVIC_CFG_CTRL_DIV0 0x00000010      // Trap on Divide by 0
#define NVIC_CFG_CTRL_UNALIGNED 0x00000008 // Trap on Unaligned Access
#define NVIC_CFG_CTRL_MAIN_PEND 0x00000002 // Allow Main Interrupt Trigger
#define NVIC_CFG_CTRL_BASE_THR 0x00000001  // Thread State Control

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_SYS_PRI1 register.
//
//*****************************************************************************
#define NVIC_SYS_PRI1_USAGE_M 0x00E00000 // Usage Fault Priority
#define NVIC_SYS_PRI1_BUS_M 0x0000E000   // Bus Fault Priority
#define NVIC_SYS_PRI1_MEM_M 0x000000E0   // Memory Management Fault Priority
#define NVIC_SYS_PRI1_USAGE_S 21
#define NVIC_SYS_PRI1_BUS_S 13
#define NVIC_SYS_PRI1_MEM_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_SYS_PRI2 register.
//
//*****************************************************************************
#define NVIC_SYS_PRI2_SVC_M 0xE0000000 // SVCall Priority
#define NVIC_SYS_PRI2_SVC_S 29

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_SYS_PRI3 register.
//
//*****************************************************************************
#define NVIC_SYS_PRI3_TICK_M 0xE0000000   // SysTick Exception Priority
#define NVIC_SYS_PRI3_PENDSV_M 0x00E00000 // PendSV Priority
#define NVIC_SYS_PRI3_DEBUG_M 0x000000E0  // Debug Priority
#define NVIC_SYS_PRI3_TICK_S 29
#define NVIC_SYS_PRI3_PENDSV_S 21
#define NVIC_SYS_PRI3_DEBUG_S 5

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_SYS_HND_CTRL
// register.
//
//*****************************************************************************
#define NVIC_SYS_HND_CTRL_USAGE 0x00040000  // Usage Fault Enable
#define NVIC_SYS_HND_CTRL_BUS 0x00020000    // Bus Fault Enable
#define NVIC_SYS_HND_CTRL_MEM 0x00010000    // Memory Management Fault Enable
#define NVIC_SYS_HND_CTRL_SVC 0x00008000    // SVC Call Pending
#define NVIC_SYS_HND_CTRL_BUSP 0x00004000   // Bus Fault Pending
#define NVIC_SYS_HND_CTRL_MEMP 0x00002000   // Memory Management Fault Pending
#define NVIC_SYS_HND_CTRL_USAGEP 0x00001000 // Usage Fault Pending
#define NVIC_SYS_HND_CTRL_TICK 0x00000800   // SysTick Exception Active
#define NVIC_SYS_HND_CTRL_PNDSV 0x00000400  // PendSV Exception Active
#define NVIC_SYS_HND_CTRL_MON 0x00000100    // Debug Monitor Active
#define NVIC_SYS_HND_CTRL_SVCA 0x00000080   // SVC Call Active
#define NVIC_SYS_HND_CTRL_USGA 0x00000008   // Usage Fault Active
#define NVIC_SYS_HND_CTRL_BUSA 0x00000002   // Bus Fault Active
#define NVIC_SYS_HND_CTRL_MEMA 0x00000001   // Memory Management Fault Active

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_FAULT_STAT
// register.
//
//*****************************************************************************
#define NVIC_FAULT_STAT_DIV0 0x02000000    // Divide-by-Zero Usage Fault
#define NVIC_FAULT_STAT_UNALIGN 0x01000000 // Unaligned Access Usage Fault
#define NVIC_FAULT_STAT_NOCP 0x00080000    // No Coprocessor Usage Fault
#define NVIC_FAULT_STAT_INVPC 0x00040000   // Invalid PC Load Usage Fault
#define NVIC_FAULT_STAT_INVSTAT 0x00020000 // Invalid State Usage Fault
#define NVIC_FAULT_STAT_UNDEF                                                  \
  0x00010000                             // Undefined Instruction Usage
                                         // Fault
#define NVIC_FAULT_STAT_BFARV 0x00008000 // Bus Fault Address Register Valid
#define NVIC_FAULT_STAT_BLSPERR                                                \
  0x00002000                               // Bus Fault on Floating-Point Lazy
                                           // State Preservation
#define NVIC_FAULT_STAT_BSTKE 0x00001000   // Stack Bus Fault
#define NVIC_FAULT_STAT_BUSTKE 0x00000800  // Unstack Bus Fault
#define NVIC_FAULT_STAT_IMPRE 0x00000400   // Imprecise Data Bus Error
#define NVIC_FAULT_STAT_PRECISE 0x00000200 // Precise Data Bus Error
#define NVIC_FAULT_STAT_IBUS 0x00000100    // Instruction Bus Error
#define NVIC_FAULT_STAT_MMARV                                                  \
  0x00000080 // Memory Management Fault Address
             // Register Valid
#define NVIC_FAULT_STAT_MLSPERR                                                \
  0x00000020                              // Memory Management Fault on
                                          // Floating-Point Lazy State
                                          // Preservation
#define NVIC_FAULT_STAT_MSTKE 0x00000010  // Stack Access Violation
#define NVIC_FAULT_STAT_MUSTKE 0x00000008 // Unstack Access Violation
#define NVIC_FAULT_STAT_DERR 0x00000002   // Data Access Violation
#define NVIC_FAULT_STAT_IERR 0x00000001   // Instruction Access Violation

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_HFAULT_STAT
// register.
//
//*****************************************************************************
#define NVIC_HFAULT_STAT_DBG 0x80000000    // Debug Event
#define NVIC_HFAULT_STAT_FORCED 0x40000000 // Forced Hard Fault
#define NVIC_HFAULT_STAT_VECT 0x00000002   // Vector Table Read Fault

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_DEBUG_STAT
// register.
//
//*****************************************************************************
#define NVIC_DEBUG_STAT_EXTRNL 0x00000010  // EDBGRQ asserted
#define NVIC_DEBUG_STAT_VCATCH 0x00000008  // Vector catch
#define NVIC_DEBUG_STAT_DWTTRAP 0x00000004 // DWT match
#define NVIC_DEBUG_STAT_BKPT 0x00000002    // Breakpoint instruction
#define NVIC_DEBUG_STAT_HALTED 0x00000001  // Halt request

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_MM_ADDR register.
//
//*****************************************************************************
#define NVIC_MM_ADDR_M 0xFFFFFFFF // Fault Address
#define NVIC_MM_ADDR_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the NVIC_FAULT_ADDR
// register.
//
//*****************************************************************************
#define NVIC_FAULT_ADDR_M 0xFFFFFFFF // Fault Address
#define NVIC_FAULT_ADDR_S 0

